[
  {
    "_id": "67474407b231b42178898a5d",
    "jobNumber": "1241607",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you looking to apply your computer science and other technical expertise to develop technologies and tools and be a part of cutting edge innovations? Come join our team of experts! NSA is in search of Research Scientists and Senior Research Scientists to solve complex problems, test innovative approaches and research new solutions to make the U.S. and its allies safer and more secure. Help protect national security interests as part of the world's most advanced team of computer science professionals.",
    "fullDescription": "Are you looking to apply your computer science and other technical expertise to develop technologies and tools and be a part of cutting edge innovations? Come join our team of experts! NSA is in search of Research Scientists and Senior Research Scientists to solve complex problems, test innovative approaches and research new solutions to make the U.S. and its allies safer and more secure. Help protect national security interests as part of the world's most advanced team of computer science professionals.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-14T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-30T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you looking to apply your computer science and other technical expertise to develop technologies and tools and be a part of cutting edge innovations? Come join our team of experts! NSA is in search of Research Scientists and Senior Research Scientists to solve complex problems, test innovative approaches and research new solutions to make the U.S. and its allies safer and more secure. Help protect national security interests as part of the world's most advanced team of computer science professionals.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Computer Science (CS) or Computer Engineering (CE). Other STEM fields (e.g., Engineering, Mathematics, or Information Systems (IS)) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). \n\nRelevant experience must be in one or more of the following: computer systems research, simulation/model development and prototyping, software design, programming, computational science, algorithm analysis and design, reverse engineering, designing/developing computer or information systems, including engineering hardware or software, machine learning, artificial intelligence, visualization, human-computer interaction, data science, or high performance computing.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA Research Scientists are actively expanding the boundaries of what can be accomplished with artificial intelligence, machine learning, human-machine teaming, software reverse engineering, data science, novel architectures, cyber security, high performance computing, and computational linguistics. Our experts generalize mission problems, advance the scientific state-of-the-art to solve problems, and work with other NSA organizations to get solutions in front of mission users and decision-makers. \n\nOur researchers also have the opportunity to collaborate regularly with the scientific community, academia, industry, and other government laboratories; publish papers on unclassified aspects of our work in scientific journals and at conferences; transfer NSA technology to the marketplace through open source software releases and public-private partnerships; serve as faculty members at local universities; and participate in university and K-12 STEM outreach activities across the country.\n\nThe ideal candidate must be able to demonstrate sound judgement, strong technical skills and the ability to work effectively in a dynamic team environment, as well as independently. Excellent oral and written communication skills, and a proven track record of analyzing and solving technical problems with innovative solutions are also preferred.  The candidate should have demonstrated success in conducting Computer Science research to include turning research ideas into running prototype-grade systems. \n'\nAs a Research Scientist, other responsibilities may include:\n\n-\tConducting scientific experiments, documenting results, and communicating with colleagues, customers, and decision makers\n-\tTraining, testing, and deploying machine learning models\n-\tApplying software engineering principles to design and/or develop software applications\n-\tDesigning and optimizing algorithms, data structures, modeling, and analytics to solve real-world scientific problems\n-\tUsing principles, techniques, procedures, and tools to architect and facilitate the development of hardware solutions\n-\tDeveloping methods and applications for tools to exploit and analyze computer systems and network vulnerabilities\n-\tModeling, simulating, prototyping, and/or benchmarking high performance computing systems.\n-\tDeveloping and implementing approaches to increase the productivity and/or efficiency of high performance computers\n-\tInvestigating and validating the security properties claimed by confidential computing mechanisms and architectures\n-\tAdvancing the understanding and capabilities for flexible, layered integrity measurement and attestation architectures and mechanisms\n-\tResearch, design, and prototype novel approaches to operating system, hypervisor, or firmware security\n-\tApplying machine learning models to perform enhanced monitoring and anomaly detection on embedded systems' network communications to include IoT devices using Bluetooth and other wireless IoT protocols",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Candidates with experience in cybersecurity, computer network defense, vulnerabilities and countermeasures, software development and debugging, network protocols, and those with expertise in Artificial Intelligence and Machine Learning (AI/ML) are strongly encouraged to apply.\n\nRelevant experience in multimodal data, to include: speech, image, video or text processing and/or data science, applied machine learning or artificial intelligence across the disciplines of Human Language Technology (HLT), Computer Vision (CV), Natural Language Processing (NLP) and Natural Language Understanding (NLU).  Additionally, applicants with experience in visualization, data analysis, machine learning model research, development, and evaluation, data engineering, multilingual and multimodal modeling, automatic speech recognition (ASR) or language modeling, large language models (LLM) or related topics are especially encouraged to apply.\n\nCandidates with knowledge, skills and experience in high performance computing are also strongly encouraged to apply; in particular, processor and system architectures and networks, memory, tasking (accelerators, parallelism, resource management, heterogeneous computing), productivity (systems modeling & simulation, evaluation, prototyping and benchmarking), scalable algorithms, programming languages (Python, C++, Rust) and libraries, and hardware-software co-design.\n\nCandidates with knowledge and experience in future telecommunication networks (5G/6G), IoT security, device management, machine learning technologies, Linux or Windows programming and debugging, software design and development, virtualization/containers, Cloud, Trusted Computing, and other specialized computer platforms are encourage to apply. \n\nDesired Skills:\n\nApplicants should have excellent problem-solving, communication, and interpersonal skills, and possess a range of knowledge and experience in at least two of the following areas:\n\n-\tProgramming (low level, high level, parallel)\n-\tArtificial Intelligence and Machine Learning\n-\tFoundation models (FMs) (Large Language Models (LLMs), as well as models for other modalities)\n-\tSimulation/model development and prototyping\n-\tSoftware engineering\n-\tHardware engineering\n-\tArchitectures and Distributed Computing\n-\tAlgorithm analysis and design\n-\tReverse engineering\n-\tOperating systems and/or device driver development (desktop/server/RTOS)\n-\tCybersecurity/Computer Network Defense\n-\tTrustworthy systems\n-\tComputer and network security\n-\tTelecommunication systems",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Research Scientist / Computer Systems Researcher - Mid to Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: Salary Range: $102,477- $187,662 (Full Performance, Senior)\n\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-30T00:00:00.000Z"
  },
  {
    "_id": "67474407b231b42178898a5f",
    "jobNumber": "1239002",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Do you have expertise with policy within the federal government? Do you have knowledge and experience with the control and accountability of Communications Security (COMSEC) material and/or COMSEC policy? If so, NSA has a job for you! As a COMSEC Auditor for the NSA Central Office of Record, you will have the opportunity to travel the world to ensure that our Government and contractor's sites are in compliance with both national and NSA's standards related to the protection of our nation's COMSEC material.",
    "fullDescription": "Do you have expertise with policy within the federal government? Do you have knowledge and experience with the control and accountability of Communications Security (COMSEC) material and/or COMSEC policy? If so, NSA has a job for you! As a COMSEC Auditor for the NSA Central Office of Record, you will have the opportunity to travel the world to ensure that our Government and contractor's sites are in compliance with both national and NSA's standards related to the protection of our nation's COMSEC material.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "2",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-23T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Law and Legal Services",
    "jobFamilyId": "100090",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-29T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Do you have expertise with policy within the federal government? Do you have knowledge and experience with the control and accountability of Communications Security (COMSEC) material and/or COMSEC policy? If so, NSA has a job for you! As a COMSEC Auditor for the NSA Central Office of Record, you will have the opportunity to travel the world to ensure that our Government and contractor's sites are in compliance with both national and NSA's standards related to the protection of our nation's COMSEC material.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position. \n\nDegree in a Writing or Policy related field (e.g., Law, Communications, Public Policy, Technical Writing, Creative Writing, and English) is preferred, but a degree in any field is acceptable.\n\nFULL PERFORMANCE\n\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. A high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nRelevant experience must be performing policy related work in a subject matter related to the position in which the candidate is applying (e.g., regulatory, national and foreign security, budget and public finance) within the government or as a government contractor.\n\nSENIOR\n\nEntry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. A high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nRelevant experience must be performing policy related work in a subject matter related to the position in which the candidate is applying (e.g., regulatory, national and foreign security, budget and public finance) within the government or as a government contractor, and project management or formal/informal leadership.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Corporate Policy Officer responsibilities:\n\n- Researching and developing policies that guide behavior and support mission objectives\n- Interpreting, reviewing, and coordinating Intelligence Community (IC), Department of Defense (DoD), and National policies affecting NSA activities\n- Recommending official NSA positions on policies to senior leadership\n- Advocating, promoting, and coordinating NSA policy positions with counterparts as required in the IC, DoD, other Executive Branch agencies, Congress, and others\n- Advising senior leadership in the establishment of agreements with mission partners\n\t\n\t\nCorporate Policy Officer/COMSEC Auditor responsibilities:\n\n-  Researching and developing policies that guide behavior and support mission objectives\n-  Interpreting, reviewing, and coordinating Intelligence Community (IC), Department of Defense (DoD), and National policies affecting COMSEC activities\n-  Recommending official NSA positions on policies to senior leadership\n-  Advocating, promoting, and coordinating NSA policy positions with counterparts as required in the IC, DoD, other Executive Branch agencies, and others\n-  A comprehensive understanding of national and NSA Central Office of Record level policies.\n-  Coordination of logistics and administrative items.\n-  Provide policy expertise to 1700 NSA Central Office of Record COMSEC accounts\n-  Traveling the US and overseas, to perform COMSEC audits\n-  Must be able to travel in the US and overseas for approximately 8 weeks per year\n-  Conduct audits to ensure COMSEC accounts are compliant with national and NSA policies\n-  Communication with COMSEC Account personnel before, during, and after the audit\n-  Authoring of formal COMSEC Audit reports upon completion of the audit.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate for Corporate Policy Officer is someone with a desire for continual learning who possesses strong problem-solving, analytic, and interpersonal skills, and is:\n\n- a strong communicator (both written and oral)\n- an active listener\n- politically savvy\n- accountable\n- adaptable\n- able to balance details with strategic vision\n- able to work effectively (independently and/or within teams) across functional areas in a collaborative environment\n- able to manage multiple tasks with competing timelines and deliverables\n\nKnowledge and experience in one or more of the following areas is preferred:\n\n- Cybersecurity\n- Signals Intelligence\n- Information Technology\n- Human Resources\n- Program Management\n- Finance and Acquisition\n- Law \n- Personnel and Physical Security\n- Facilities and Logistics\n\nThe ideal Corporate Policy Officer/COMSEC Auditor candidate is someone that possesses understanding of COMSEC material control and accountability, processes, policies, and procedures. Additionally, experience with COMSEC Material Control System (CMCS) is ideal and imperative.\n\nIdeal candidate skills:\n\n- Continual learner, problem solver\n-  A strong communicator (both written and oral)\n-  An active listener\n-  Politically savvy\n-  Accountable\n-  Adaptable\n-  Able to balance details with strategic vision\n-  Able to work effectively (independently and/or within teams) across functional areas in a collaborative environment\n-  Able to manage multiple tasks with competing timelines and deliverables\n\nKnowledge and experience for Corporate Policy Officer/COMSEC Auditor  in one or more of the following is imperative:\n\n-  Communications Security (COMSEC) - top preference\n-  Cybersecurity\n-  Information Technology\n-  Program Management\n-  Personnel and Physical Security",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Corporate Policy Officer/Communications Security (COMSEC) Auditor - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $181,216 (Full Performance, Senior)\n\nSalary varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule: This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 0600 A.M. and 6:00 P.M. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-29T00:00:00.000Z"
  },
  {
    "_id": "67474407b231b42178898a5c",
    "jobNumber": "1241527",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protect NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operate.",
    "fullDescription": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protect NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operate.",
    "grade": "13/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "2",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-20T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Law and Legal Services",
    "jobFamilyId": "100090",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements. It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\t\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\t\nU.S. Citizenship is required for all applicants. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate. Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-27T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protect NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operate.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be a Professional Law Degree (LL.B. or J.D.) and requires active membership in the bar of the highest court of a State, U.S. commonwealth, U.S. territory, or the District of Columbia.\n\n*Relevant experience as determined by the Office of the General Counsel (or the Office of the Inspector General for positions in the OIG) must be professional legal experience that is commensurate with the duties and responsibilities of the position. See DoD Instruction (DoDI) 1442.02 for exceptions to the grade-level standards.  \n\n\nSENIOR \n\nGrade 13: Must have in excess of 2 years of relevant experience.* \n\nGrade 14: Must have in excess of 3 years of relevant experience.* \n\n\nEXPERT \n\nGrade 15: Must have in excess of 3 years of relevant experience.*",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA Office of General Counsel (OGC) is seeking highly motivated, accomplished attorneys from diverse backgrounds with experience in practice areas such as litigation, cybersecurity and national security law, government contracts, administrative law, human resources, equal employment opportunity, government ethics, privacy and civil liberties, compliance programs, and Congressional affairs, who are interested in joining its elite team of lawyers. At NSA OGC, you will analyze cutting-edge technical and intelligence issues and will frequently provide legal advice that relates to high-profile current events affecting our national security.\n\nAttorneys working in NSA OGC apply their expertise, skills, and education to solve a variety of challenges not found in the private sector or at any other government agency. You will have the opportunity to make a global impact on a daily basis as you work with other top caliber professionals at the highest levels of the Agency and across the U.S. Government. This critical work ensures that Agency operations comply with the law while also protecting both our national security and our civil liberties. \n\nBecause the twin missions of NSA - signals intelligence and cybersecurity - encompass counterterrorism and cybersecurity, two of the most important and dynamic challenges our Government faces today, there is rarely a typical day for an NSA attorney. We are routinely presented with exciting and novel legal issues at the intersection of technology and law.\n\nIn tackling these challenges, our attorneys work directly with senior officials at various Intelligence Community and Executive Branch agencies, as well as with relevant committees of Congress.\n\nNSA attorneys work in a highly classified setting and are entrusted with tremendous responsibility as they advise the Director and other senior leaders at the Agency on a diverse and complex spectrum of issues related to gathering the foreign intelligence information needed to fight international terrorism, espionage, transnational crime, and narcotics, to defeat foreign cyber adversaries trying to steal national secrets, and to provide intelligence support to critical military overseas tactical operations, all while protecting our civil liberties and ensuring strict compliance with the Constitution and our laws. Because the NSA is a Department of Defense agency, our attorneys have a unique opportunity to be directly involved in national security operations working alongside military and civilian colleagues, as well as to interact with the private sector in cybersecurity and other matters.\n\nIn short, many OGC attorneys say they can't imagine working in a more exciting and important position.\n\nNSA OGC has several exciting and challenging career opportunities available in a range of legal practice groups that provide advice in the areas of: Intelligence Operations; Procurement; Research and Development; Information Security; Environmental Law, Patents, Telecommunications; Security matters; Litigation; Acquisition, Research & Technology Law; and Administrative Law & Ethics. \n\nThe responsibilities of an Attorney at the NSA can include:\n\n- Advising the Agency on legal matters involving a particular subject matter (e.g., intelligence operations, procurement, research and development, information security, patents, security matters, legislation, employment/personnel issues, ethics, Freedom of Information Act (FOIA), Privacy Act (PA), or Federal Records Act (FRA) questions)\n- Analyzing legislation, programs, policies, regulations, or plans to determine impact on the Agency\n- Representing the Agency's official position in legal and legislative proceedings\n- Representing the Agency in interactions with outside customers, DoD, Congressional representatives, foreign partners, or the general public\n- Conferring with/educating clients, customers, or stakeholders on legal or policy issues\n- Determining the legal sufficiency of documents\n- Drafting legal briefs, pleadings, etc\n- Making legal determinations in accordance with laws, regulations, professional standards, or Agency policies and procedures\n\nAppointment to this position requires a minimum commitment of 2 year(s) in OGC before you can be eligible to apply for any other positions at the Agency.\n\nAFTER SUBMITTING YOUR ELECTRONIC APPLICATION, you will receive an email with instructions on how to submit the following supplemental information:\n- Cover letter\n- Professional resume\n- Legal writing sample (short, <15 pages)\n- Unofficial law school transcript \n- Past professional references (approximately three; include name, title, phone number, and email). Current employer references will only be required after a successful interview is completed.\n\nThis email will come from a member of the OGC Hiring Team from a uwe.nsa.gov account. If you do not receive this email within seven (7) business days of submitting your application, contact OGC_Applications@nsa.gov.  Your application will not be considered if these supplemental documents are not received by the date noted in the email instructions.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Experience and knowledge of law in one or more of the following areas is required:\n\n- intelligence operations\n- procurement\n- research and development\n- information security\n- environmental law\n- patents\n- telecommunications\n- security matters\n- legislation\n- human resources\n- equal employment opportunity \n- ethics\n- litigation\n- cybersecurity\n- compliance\n- Congressional affairs\n- Freedom of Information Act (FOIA)\n- Privacy Act (PA) and civil liberties \n\nThe ideal candidate is a highly-motivated and qualified attorney with excellent oral and written communication skills, a desire for continual learning, possesses problem-solving, analytic, and interpersonal skills, and is:\n\n- detail-oriented\n- customer and results oriented\n- able to adjust to changing situational requirements\n- able to build relationships across the Agency and with external stakeholders\n- able to manage multiple tasks with competing timelines and deliverables",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Attorney - Experienced to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $117,962 - $191,900 (Senior, Expert Level)\n\nSalary range varies by work level and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.  This position is hiring for Maryland.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-27T00:00:00.000Z"
  },
  {
    "_id": "67474407b231b42178898a60",
    "jobNumber": "1238663",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protect NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operate.",
    "fullDescription": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protect NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operate.",
    "grade": "13/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "2",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-20T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Law and Legal Services",
    "jobFamilyId": "100090",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position.\n \nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com**\n \nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-27T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protect NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operate.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be a Professional Law Degree (LL.B. or J.D.) and requires active membership in the bar of the highest court of a State, U.S. commonwealth, U.S. territory, or the District of Columbia.\n\n*Relevant experience as determined by the Office of the General Counsel (or the Office of the Inspector General for positions in the OIG) must be professional legal experience that is commensurate with the duties and responsibilities of the position. See DoD Instruction (DoDI) 1442.02 for exceptions to the grade-level standards.  \n\n\nSENIOR \n\nGrade 13: Must have in excess of 2 years of relevant experience.* \n\nGrade 14: Must have in excess of 3 years of relevant experience.* \n\n\nEXPERT \n\nGrade 15: Must have in excess of 3 years of relevant experience.*",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The responsibilities of NSA's Acquisition, Fiscal, Installations (AFI) Attorney:\n\n-Advising the Agency on legal matters involving procurement, fiscal, and/or installations.\n-Analyzing legislation, programs, policies, regulations, or plans to determine impact to the Agency.\n-Representing the Agency's official position in legal and administrative proceedings (e.g., GAO, ASBCA).\n-Representing the Agency in interactions with outside customers, ODNI, DoD, Congressional representatives, foreign partners, or the general public.\n-Conferring with/educating clients, customers, or stakeholders on legal or policy issues.\n-Determining the legal sufficiency of documents.\n-Drafting legal briefs, pleadings, etc.\n-Making legal determinations in accordance with laws, regulations, professional standards, or Agency policies and procedures.\n\nAFTER SUBMITTING YOUR ELECTRONIC APPLICATION, you will receive an email with instructions on how to submit the following supplemental information:\n-Cover letter\n-Professional resume\n-Legal writing sample (short, <15 pages)\n-Unofficial law school transcript \n-Past professional references (approximately three; include name, title, phone number, and email). Current employer references will only be required after a successful interview is completed.\n\nThis email will come from a member of the OGC Hiring Team from a uwe.nsa.gov account. If you do not receive this email within seven (7) business days of submitting your application, contact OGC_Applications@nsa.gov.\nYour application will not be considered if these supplemental documents are not received by the date noted in the email instructions.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Legal experience and knowledge of law in one of the following areas is required:\n\n-federal acquisition\n-fiscal law\n-installations law (which may include logistics and/or environmental) \n\nThe ideal candidate is a highly-motivated and qualified attorney with excellent oral and written communication skills, astute problem-solving, analytic, and interpersonal skills, and possess a desire for continual learning. The candidate must be:\n-detail-oriented;\n-customer and results oriented;\n-able to adjust to changing situational requirements;\n-able to build relationships across the Agency and with external stakeholders; and\n-able to manage multiple tasks with competing timelines and deliverables.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Attorney / Acquisition, Fiscal, Installations  - Experienced to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $117,962 - $191,900 (Senior - Expert) \n\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-27T00:00:00.000Z"
  },
  {
    "_id": "673f3dacb231b4217851cae8",
    "jobNumber": "1241290",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-02T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-25T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Computer Science (CS). Related fields (e.g., Engineering, Mathematics, Information Technology, Information Systems) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). \n\nRelevant experience must be in the design/development of computer or information systems and include engineering hardware and/or software over their lifecycle (i.e., requirements analysis, design, implementation, testing, integration, deployment/installation, and maintenance), programming, computer systems research, reverse engineering, and/or computer/network security. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Computer Systems Architects at NSA use commercial and government developed hardware, software, networking, and security products to:\n\n-\tdrive information technology projects\n-\tproduce compliance results for established project requirements and IT architecture  \n-\tmodernize IT architecture through analysis of research and introducing changes based on evolving project requirements\n-\tintegrate industry trends, emerging technologies and standards, and new vendor features  \n-\tcollaborate with experts in technical and application teams to identify, evaluate, and recommend technical solutions to support project requirements\n-\tdefine and analyze data requirements, mapping legacy data stores and formats to logical and physical data models \n-\tpropose standard ways for information transport between IT systems and stored within corporate knowledge databases\n-\tperform architectural alignment of the enterprise logical data model and physical data models",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is a self-starter with a desire for continual learning and strong problem-solving, analytic, and interpersonal skills who is able to: \n\n-\twork in a team environment \n-\tadapt to change\n-\tprovide innovative solutions\n-\tcommunicate effectively \n-\tmulti-task across multiple projects\n\nThe ideal candidate will also reflect specialized skill and experience in one or more of the following:\n \n-\tSystem administration with Windows, UNIX, and/or Linux\n-\tProgramming and scripting experience (e.g., C, C++, Java, Assembly, Python, Perl, Ruby, Bash, Node.js, Spark, Puppet, SALT, KAFKA, HADOOP)\n-\tDatabase design/development (e.g., NiFi, MongoDB)\n-\tNetwork protocols and hardware \n-\tVirtualization fundamentals\n-\tCloud architecture\n-\tSecurity architectures and appliances\n-\tFirewalls Boundary device solutions/architecture",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Computer Systems Architect - Mid Level (Utah)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": null,
    "locationArea": "1257",
    "locationFull": "Draper, Utah, UT",
    "locationSpecificId": "49A",
    "postedDate": "2024-11-25T00:00:00.000Z"
  },
  {
    "_id": "673f3dacb231b4217851cae7",
    "jobNumber": "1241307",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "fullDescription": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "grade": "12/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "Q",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-26T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900001",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-25T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "jobQualifications": null,
    "jobQualificationsExt": "Applicants will be evaluated by hiring managers and assessed according to the position requirements. Qualified applicants must be either current Federal civilian retirees or be within 6 months of retirement from civilian Federal service.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Retired Federal civilian employees employed at the National Security Agency (NSA) provide expertise and corporate knowledge to temporarily support mission requirements, augment the existing work force, and/or mentor the next generation of Agency employees.\n\nPlease respond to the screening questions attached to this job posting. Your responses enable our hiring team to match your skills and experience to mission needs.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Retired Federal civilian employees are encouraged to apply so that your skills and experience can be reviewed according to current needs and requirements.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Retired Federal Government Civilian Employees (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary range varies by location, work level, and relevant experience to the position. \n\nWork Schedule: Part-time, flexible according to the mission needs and hiring organization.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-25T00:00:00.000Z"
  },
  {
    "_id": "673f3dacb231b4217851cae9",
    "jobNumber": "1241252",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an established Software Engineer, NSA has opportunity for you to contribute, learn, and grow in virtually any Computer Science focus area, including: Cybersecurity, High Performance Computing (HPC), Quantum Computing Research, Data Analytics, Machine Learning/Artificial Intelligence (ML/AI), Cryptology/Cryptography, and countless others.  If it is considered Computer Science, chances are good we have at least one team focused on it. Individual opportunities are too numerous to list, so tell us what you want to do and let's talk!",
    "fullDescription": "As an established Software Engineer, NSA has opportunity for you to contribute, learn, and grow in virtually any Computer Science focus area, including: Cybersecurity, High Performance Computing (HPC), Quantum Computing Research, Data Analytics, Machine Learning/Artificial Intelligence (ML/AI), Cryptology/Cryptography, and countless others.  If it is considered Computer Science, chances are good we have at least one team focused on it. Individual opportunities are too numerous to list, so tell us what you want to do and let's talk!",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-06T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-25T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an established Software Engineer, NSA has opportunity for you to contribute, learn, and grow in virtually any Computer Science focus area, including: Cybersecurity, High Performance Computing (HPC), Quantum Computing Research, Data Analytics, Machine Learning/Artificial Intelligence (ML/AI), Cryptology/Cryptography, and countless others.  If it is considered Computer Science, chances are good we have at least one team focused on it. Individual opportunities are too numerous to list, so tell us what you want to do and let's talk!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Computer Science (CS) or Software Engineering. Related fields (e.g., Engineering, Mathematics) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). \n\nRelevant experience must be in the software development process (i.e., requirements analysis, software design, implementation, testing, integration, deployment/installation, and maintenance) and programming.\n\nFULL PERFORMANCE \nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n \nSENIOR \nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position. \n\nEXPERT \nEntry is with a Bachelor's degree plus 9 years of relevant experience or a Master's degree plus 7 years of relevant experience or a Doctoral degree plus 5 years of relevant experience. An Associate's degree plus 11 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA is seeking experienced Software Engineers to advance a number of high impact systems and teams.  Opportunities change constantly, but recent needs include: large scale platform development (hardware and software, HPC, cloud); accessibility development (508 compliance); AI/ML; complex algorithms and cryptography. \n\nAs a Software Engineer at NSA, your work makes the world a safer place in countless ways including: saving lives of U.S. and allied soldiers; providing U.S. policy and decision makers with critical, timely intelligence; ensuring the continued safety of U.S. citizens and residents by thwarting foreign adversaries; and defending vital networks.\n\nThe Agency offers a work/life balance that is hard to beat, with flexible work schedules, generous leave policies, and a number of continuing education programs to help meet your long term career goals. The sheer breadth of technologies supported provides endless opportunity for broadening expertise and leadership growth.\n\nTools and technologies used evolve quickly, with systems and responsibilities spanning the full spectrum.  More common tools and areas of interest include: C/C++, Java, cloud computing, Angular, React, Python, PIG Analytics, Pyspark, agile development, continuous integration/continuous delivery (CI/CD), containers and Docker, Kubernetes, Amazon Web Services (AWS), Linux (VMWare), ElasticSearch, Rust, micro services, Ansible, clusters, digital forensics, incident response, quantum, and so much more.   Beyond technical skills, we also need strong critical thinkers, collaborators, independent self-starters, continuous learners and flexible contributors.   We look forward to hearing from you - what excites you and where you think you can make the most impact.\n\n*We strongly encourage you to upload transcripts as you apply, for qualification verification.*",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "With a broad range of positions available, tools, platforms, and methodologies used will vary from one team to another.\n\nUse of industry norms is common, including but not limited to: Docker, Kubernetes, AWS, GitLab, Atlassian Suite, Open Source (see code.nsa.gov for examples of NSA contribution, like Ghidra, Apache Accumulo, and Apache Nifi), Databases (both relational and non-relational), various languages (Java, C, C++, Python, etc.).",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Software Engineer - Mid to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $191,900 (Full Performance, Senior, Expert)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-25T00:00:00.000Z"
  },
  {
    "_id": "6744a96ab231b42178770193",
    "jobNumber": "1241123",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'",
    "grade": "09/1 to 13/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-09T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-25T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nFULL PERFORMANCE\nEntry is with a high school diploma or GED, plus applicable training, plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience.  \n\nDegree must be in an Engineering or an Engineering Technology related field. If qualifying with a high school diploma/GED, must have applicable Vocational/Technical or Military training (for example, Electronics, Computers, Drafting, Engineering, Manufacturing, or Networking).\n\nRelevant experience must include one or more of the following: providing engineering technical support for the development, fabrication, testing, or site installation of electrical, electronic, mechanical, or software products/systems; assisting in assembling, modifying, debugging, or testing prototype products; working as an electrician or with electronic or appliance repair. Relevant experience may also include formal or informal experience working with computers, robotics, electronics, or manufacturing, electronic shop experience, or experience with schematic diagrams, environmental testing, and quality assurance testing. \n\nCommercial industry certifications, such as the MASE (Master Automotive Service Excellence), would count for two years of experience.\n\nSENIOR\nEntry is with a high school diploma or GED, plus applicable training, plus 6 years of relevant experience, or an Associate's degree plus 4 years of relevant experience, or a Bachelor's degree plus 2 years of relevant experience.\n\nDegree must be in an Engineering or an Engineering Technology related field. If qualifying with a high school diploma/GED, must have applicable Vocational/Technical or Military training (for example, Electronics, Computers, Drafting, Engineering, Manufacturing, or Networking).\n\nRelevant experience must include one or more of the following: providing engineering technical support for the development, fabrication, testing, or site installation of electrical, electronic, mechanical, or software products/systems; assisting in assembling, modifying, debugging, or testing prototype products; working as an electrician or with electronic or appliance repair. Relevant experience may also include formal or informal experience working with computers, robotics, electronics, or manufacturing, electronic shop experience, or experience with schematic diagrams, environmental testing, and quality assurance testing.\n\nCommercial industry certifications, such as the MASE (Master Automotive Service Excellence), would count for two years of experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Do you have vocational/technical training in Technical Trades, Electronics, Computers, Drafting, or Engineering? Do you enjoy building, installing, modifying, repairing, fabricating prototyping parts/mechanisms, and/or testing electronic equipment?\n\nThe National Security Agency is seeking skilled Precision Machinists and Precision Sheet Metal Fabricators to set up and operate a wide range of machinery to produce one-of-a-kind products.  Qualified candidates will work with the latest Computer Numeric Control (CNC) machine tools using a variety of fabrication techniques to make complex parts and fixtures and/or the latest fabrication equipment and tooling to make complex parts. Individuals will interface with customers, design engineers, and other skilled craftsman in an exciting and challenging environment.  \n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate has experience from a vocational/trade school or apprenticeship and a desire for continual learning along with excellent problem-solving, analytic and interpersonal skills, a precision and attention to detail, and a mechanical aptitude to use a variety of industry tools and machinery.\n\nThe ideal candidate will have experience in precision sheet metal fabrication with knowledge in bending, forming and shaping metal sheets or experience in precision machining, with knowledge in different material and hardware characteristics.\n\nThe ideal candidate will also be:\n\n-  Innovative\n-  Well-organized\n-  Able to handle and prioritize multiple assignments\n-  Able to accomplish assignments with little direct supervision\n-  Able to communicate effectively both orally and written\n-  Able to lift 50 pounds\n-  Medically clearable for worldwide travel\n-  Able to work effectively across several different functional areas in a collaborative environment\n\nKnowledge, skills, and experience in one or more of the following is desired:\n\n-  Perform basic mathematics functions such as Algebra, Trigonometry, Geometry\n-  Understand decimals/fractions and can read to .001' using measuring tools (ex. Micrometers, Dial calipers).\n-  Ability to read and understand engineering blueprints/drawings \n-  Analyze 3D models and assemblies using CAD/CAM Operations \n-  Mechanical and Technical aptitude using a variety of industry tools and machines to include:\n-  Punch/Laser Press \n-  Sheet Metal Press Brake \n-  Waterjet cutting machines\n-  Machine specific software \n-  Band saws, Grinders, Sanders, Drill press, Hand tools (ex. Hammers, Punches, Files, Taps and Dies)\n-  Manual Mills and Lathes\n-  3, 4 & 5 Axis CNC Mills\n-  Wire and RAM EDMs\n-  Analyze problems to determine technical solutions\n-  Devise procedures to solve the technical problems  \n-  Create and maintain documentation on technical information\n-  Ability to communicate and work well with others or teams\n-  Willingness to learn\n\nIf you believe you significantly exceed the competencies, we recommend considering the Mechanical Design Engineer job posting.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Engineering Specialist/Technician - Mid to Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $68,405 - $153,354 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-25T00:00:00.000Z"
  },
  {
    "_id": "6740b38cb231b421785c4e2f",
    "jobNumber": "1241324",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is growing by leaps and bounds and is in need of skilled/experienced Industrial Control System (ICS) Specialists/Engineers to ensure the proper operation and cybersecurity of NSA's and Department of Defense (DoD) ICS, from concept to operation.",
    "fullDescription": "NSA is growing by leaps and bounds and is in need of skilled/experienced Industrial Control System (ICS) Specialists/Engineers to ensure the proper operation and cybersecurity of NSA's and Department of Defense (DoD) ICS, from concept to operation.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "T",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-05T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Infrastructure and Logistics",
    "jobFamilyId": "100160",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-22T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is growing by leaps and bounds and is in need of skilled/experienced Industrial Control System (ICS) Specialists/Engineers to ensure the proper operation and cybersecurity of NSA's and Department of Defense (DoD) ICS, from concept to operation.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Computer Science, Engineering, Information Technology, or a related STEM field (for example, Building Automation Systems, Control Systems, Information Systems, Cybersecurity, Computer Security).\n\nRelevant experience must be in one or more of the following: industrial or commercial control systems; information technology or information systems; or in the operation, maintenance, design, or modification of facilities-related control systems.\n\nFULL PERFORMANCE\nEntry is with an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nSENIOR\nEntry is with an Associate's degree plus 10 years of relevant experience, or a Bachelor's degree plus 8 years of relevant experience, or a Master's degree plus 6 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency (NSA) currently has opportunities for highly motivated Industrial Control System (ICS) Specialists/Engineers to provide expertise in the design, construction, commissioning, and operation of new and renovated electrical and mechanical infrastructure. This position has two areas of focus, one within Design and Engineering (D&E) and the other with Operations and Maintenance (O&M).\n\nAs an ICS Specialist/Engineer within D&E, you will work closely with multidisciplinary teams encompassing project managers, stakeholders, and contractors throughout the entirety of the project life-cycle, including close coordination with O&M. You will also be responsible for the development and review of designs, specifications, technical reports, and cost estimates for power monitoring and control of electrical and mechanical infrastructure, energy management monitoring, and ICS cybersecurity.\n\nAs an ICS Specialist/Engineer within O&M, you will work closely with ICS Specialists who support many facets of the Industrial Control Systems in the Facilities Control Center (FCC), which is a 24/7 operations center where facilities systems can be effectively monitored and maintained.  The ICS team supports power monitoring and control, energy management monitoring and control, the transport network and various Information Technology (IT) and Operational Technology (OT) hardware, components, software, and applications to ensure a robust secure operation of the overall system.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Support for Industrial Control Systems require a variety of skills. The successful candidate shall have knowledge/skills in at least one of the following areas and the drive and passion to master many of these functions:\n\n-  ICS Power Control - Provide support in the area of electrical power control and monitoring systems also known as Supervisory Control and Data Acquisition (SCADA) systems. The candidate should be knowledgeable about or interested in learning about electrical power systems, configuring Schweitzer protective relays, integrating power devices into Real-Time Automation Controllers (RTAC) as well as Programmable Logic Controllers (PLC) programming. Knowledge of the protocols used by these devices, including mirrored bits, Modbus, DNP3, and SNMP, is desired.\n\n-  ICS Building Automation - Provide support to a variety of technical areas that include HVAC and chilled water distribution systems, coordination of utility outages that impact the ICS and to minimize disruptions to mission systems and support of the ICS installation and oversight of ICS commissioning. Knowledge or interest in learning about the field of building automation and the variety of components used by such systems is preferred. This includes devices such as Direct Digital Controls (DDC), DDC Logic, seniors, and end devices such as, but not limited to Variable Frequency Drives (VFD), dampers, actuators, and valves.\n\n-  Networking Technologies - The candidate should be knowledgeable about or interested in learning about configuring and troubleshooting Cisco switches and routers. Knowledge of and experience in routing protocols, Port Security, Cisco Identity Services Engine (ISE), Domain Authentication, and VLANs is desired. Additionally, knowledge of best security practices is desired.\n\n-  Firewalls - The candidate should be knowledgeable about or interested in learning about Cisco firewalls, including Firewall Management Center (FMC) for deployment and management of firewalls.\n\n-  Information Technology (IT) Management - The candidate should be knowledgeable about or interested in learning about Microsoft Endpoint Configuration Manager (MECM), Microsoft Active Directory (AD), and similar tools used for managing access controls, patch deployments, configuring policies, troubleshooting application issues, and developing/deploying software images.\n\n-  Network Security - The candidate should be knowledgeable about or interested in learning about multiple topics including, but not limited to, System Information and Event Management (SIEM), including creating anomalies alert dashboards; management of Antivirus (AV) and malware protection; access controls to include Identification, Authentication, Authorization, and Accountability (IAAA), as well as Multifactor Authentication (MFA); cybersecurity framework and policies;  Network Discovery and asset management; Network Intrusion Prevention and Detection Systems (IPS/IDS); ICS/SCADA network protocol and vulnerability analysis; ICS/SCADA recovery & mitigation and signature development and implementation; and network penetration testing.  A working knowledge of assessment and analytic tools and techniques is a plus.\n\nIn addition, the candidate shall adapt work methods in response to new information, changing conditions, emergencies or unexpected challenges. Have the ability to articulate viewpoints and answers to customers, peers, and supervisors in an effective manner, both written and orally. Identify and analyze technical issues, report, document, and attend project status briefings. Knowledgeable with calendar scheduling, MS Outlook, MS Word/Excel and office equipment such as copiers, printers and scanners.\n\nThe ideal candidate demonstrates the following:\n     - Problem Solving\n     - Interpersonal Skills\n     - Partnering\n     - Customer Service\n     - Accountability\n     - Continual Learning\n     - Resilience\n     - Effective Communication\n\nKnowledge and experience in one or more of the following is desired:\n     - Reliable power distribution design (high voltage, medium voltage, low voltage)\n     - Substation and generators plant relay protection and control systems\n     - Codes and standards (NFPA, IEEE, etc.)\n     - Technical modeling and simulation software packages (AutoCAD, ETAP, SKM, EasyPower, PowerWorld, etc.)\n     - Cost estimating\n     - Commissioning: Factory witness testing, functional performance testing, and integrated system testing\n     - Building Automation System programming control logic\n     - Creating and modifying Building Automation System graphics\n     - Third party integration via BACnet/Modbus protocols\n     - Managing and securing network infrastructure (e.g. port security, certificate management, etc.)\n     - Applying concepts, principles, and methods for network connectivity (e.g. routing, switching, tunneling, and IP addressing)\n     - Configuring, maintaining, and troubleshooting firewalls and access control lists.\n     - Implementing, configuring, and sustaining computer security (e.g. Active Directory, Domain Policies, Patch Deployment, Antivirus, and Allowlisting)\n     - Employing Secure Technical Implementation Guidance (STIG) and government security standards.\n     - Configuring and supporting Schweitzer Real Time Automation Controllers (RTAC)\n     - Evaluating and documenting PLC programs for electrical power control\n     - Creating and modifying SCADA system graphics and points \n     - Equipment: Transformers, switchgear, switchboards, panelboards, Uninterruptible Power Supply (UPS) systems, Automatic Transfer Switches (ATS), and Static Transfer Switches (STS)\n     - Controls and metering: SCADA, power metering, and electrical control systems\n     - Assisting project teams throughout the project life-cycle\n     - Configuring firewall rulesets and troubleshooting issues\n     - Computer network defense and forensic capability awareness and use\n     - Industrial Control Systems network defense experience a plus\n     - Red and Blue team activities\n     - Computer network monitoring and forensic experience",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Industrial Control System Specialist - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by work level and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-22T00:00:00.000Z"
  },
  {
    "_id": "6740b38cb231b421785c4e30",
    "jobNumber": "1241326",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is growing by leaps and bounds and is in need of skilled/experienced Facilities and Logistics professionals.",
    "fullDescription": "NSA is growing by leaps and bounds and is in need of skilled/experienced Facilities and Logistics professionals.",
    "grade": "09/1 to 13/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "T",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-12-06T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Infrastructure and Logistics",
    "jobFamilyId": "100160",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-22T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is growing by leaps and bounds and is in need of skilled/experienced Facilities and Logistics professionals.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nIf qualifying with a degree, degree must be in an Electrical related field (for example, Electrical Technology, Electronics Technology, Applied Science in Electrical Engineering, and Computer Networking). \n \nRelevant experience must include one or more of the following: working as an electrical tradesperson for the military or working as an industrial, utility, or commercial electrician, or as a relay or power generation technician. Journeyman license can count for 4 years' experience.\n\nFULL PERFORMANCE\nEntry is with a high school diploma or GED plus 8 years of relevant experience, an Associate's degree plus 6 years of relevant experience, or Bachelor's degree plus 4 years of relevant experience.\n\nSENIOR\nEntry is with a high school diploma or GED plus 12 years of relevant experience, or an Associate's degree plus 10 years of relevant experience, or Bachelor's degree plus 8 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency (NSA) has opportunities available for highly motivated High Voltage Technicians with industrial/commercial experience. Our well-rounded team of professionals maintains the infrastructure that powers NSA's mission around the globe. The best candidates will use their technical and leadership skills to ensure best-in-class electrical services. This position will provide development opportunities to maximize your career growth in a rewarding environment.  \n\nOur High Voltage Technicians are responsible for high, medium, and low voltage electrical power installations. Responsibilities include emergency and supplemental power generation, primary (HV/MV) and secondary (LV) electrical substations, overhead and underground power distribution, SCADA systems, digital and analog control systems, protective relaying equipment, large scale UPS systems, building services, switchgear, power conditioning equipment, as well as general lighting, grounding, and lightning protection systems.\n\nOur High Voltage Technicians operate and maintain high voltage electrical systems such as main switchgear, relays, generators, uninterruptible power systems (UPS), power panels, lights, outlets, motors and controls operating at up to 115,000 volts. The candidate will adapt work methods in response to new information, changing conditions, emergencies, or unexpected obstacles. The candidate will have the ability to articulate viewpoints and solutions to customers, peers, and supervisors in an effective manner. The candidate will identify and analyze technical issues, reporting, and documentation and contribute to project status briefings.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Successful candidates will possess strong written and oral communication skills and demonstrate understanding of key principles of electrical power technology. Ability to work well in a rotating shift or fixed shift, fast-paced, challenging environment is essential.\n\nCompletion of formal training in a recognized Electrical Apprenticeship Training Program is preferred and/or military experience in the Prime Power Production Specialist MOS with Instrumentation or Electrical Specialties.\n\nThe ideal candidate demonstrates the following:\n  - Problem Solving\n  - Interpersonal Skills\n  - Partnering\n  - Customer Service\n  - Accountability\n  - Continual Learning\n  - Resilience\n  - Effective Communication\n\nThe ideal candidate has knowledge and experience in the following: \n  - Electrical Safe Work Practices\n  - Electrical Safe Design\n  - Closed transition switching procedures\n  - Electrical inspections and procedures\n  - Electrical system and circuit trouble-shooting\n  - Electrical system fault analyses \n  - OSHA and other safety regulations\n  - Electrical Operations and Maintenance\n  - Construction technology/management\n  - Analysis, design, construction, national/local code compliance\n  - Develop work plans, safety plans, job hazard analyses, and programs to comply with laws, regulations, and policies",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High Voltage Technician - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $68,405 - $153,354 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-22T00:00:00.000Z"
  },
  {
    "_id": "67337e7eb231b42178fd20b6",
    "jobNumber": "1240582",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The 9-12 month Psychology Practicum Program for Doctoral Level Students placement is designed for three doctoral students in psychology who are interested in developing their clinical skills and building their knowledge base.  The practical application of this knowledge is in the treatment of a diverse workforce within the federal government's Intelligence Community.",
    "fullDescription": "The 9-12 month Psychology Practicum Program for Doctoral Level Students placement is designed for three doctoral students in psychology who are interested in developing their clinical skills and building their knowledge base.  The practical application of this knowledge is in the treatment of a diverse workforce within the federal government's Intelligence Community.",
    "grade": "07/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "R",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2025-01-15T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "How to Apply\n\nApplications must be submitted online at www.IntelligenceCareers.gov on or before 15 January 2025. Applications received after the deadline, as well as incomplete packages, will not be considered.\n\nTo be considered for the Psychology Practicum Program, submit a complete application package that includes: \n\n-\tCurrent CV\n-\tA cover letter addressing experience and interest in the above described practicum placement\n-\tOfficial transcript(s)\n-\tTwo letters of recommendation from professionals familiar with your clinical work\n\nTo submit the online application, you must use our resume builder application tool - you cannot upload a resume. For step-by-step instructions on how to complete the application, please refer to the application guide at intelligencecareeers.gov/nsa ' 'Job Search/Apply' ' and look under the 'Need Help' section.\n\nTranscripts: \n\nTranscripts may be issued directly by the Registrar, or issued to you by the Registrar, then sent with your application materials. Only originals via post, photocopies of originals via post, scanned copies of originals via email (PDF format only) will be accepted. If your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcript as an attachment. Please do not send html transcripts accessible via a website or text versions thereof.\n\nIMPORTANT: When applying online, you may only submit your resume at www.IntelligenceCareers.gov.  All other required documentation must be emailed to EAS_STP@nsa.gov by the application deadline.\n\nQuestions\n\nIf you have questions about the Student Practicum Program, please contact us at the e-mail address above or call 1-866-NSA-HIRE. You may also email SummerInterns@uwe.nsa.gov or call 410-854-4726. \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-15T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The 9-12 month Psychology Practicum Program for Doctoral Level Students placement is designed for three doctoral students in psychology who are interested in developing their clinical skills and building their knowledge base.  The practical application of this knowledge is in the treatment of a diverse workforce within the federal government's Intelligence Community.",
    "jobQualifications": null,
    "jobQualificationsExt": "Qualification Criteria\n\n-\tMust be a U.S. citizen\n-\tMust be eligible to be granted a security clearance \n-\tMust be within the third year or higher of an APA-accredited counseling or clinical psychology doctoral degree program\n-\tMust be available for the entire 9-12 month program\n-\tMust be available for an operational interview and other applicable processing between January and May 2025\n\nClearance/Security Requirements\nApplicants will be processed for a security clearance, and will be required to pass a psychological exam, lifestyle and counterintelligence polygraph, drug screening test, and complete a comprehensive history form that documents foreign travel, education background and employment history, among other areas.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "About the Practicum Program\n\nThe Employee Assistance Services (EAS) is the psychological treatment division of the National Security Agency (NSA).  It offers clinical services to all Agency employees and their spouses.  EAS is an ideal setting for practicum students to gain relevant experience working with a wide variety of presenting concerns and a broad range of diagnoses.  The EAS clientele also offers the opportunity to work with diverse cultural and ethnic backgrounds.  The 9-12 month practicum placement is designed for three doctoral students in psychology who are interested in developing their clinical skills and building their knowledge base.  The practical application of this knowledge is in the treatment of a diverse workforce within the federal government's Intelligence Community. \nThe 9-12 month practicum placement requires approximately 16-20 hours per week, dependent on the practicum students interests and the requirements of their respective graduate program (this includes administrative responsibilities and supervision preparation).  Practicum students are responsible for ensuring that their hours meet criteria for their respective programs.  The following is a tentative outline of weekly activities.\n\n1.\tIndividual Therapy (7-8 hours per week).  Clients will generally be seen once a week with a ten-session limit.  Some cases may be more appropriate for biweekly counseling, which can be arranged.  Practicum students will be provided with a private office at EAS in which they will see clients.  Practicum students will carry 7-10 individual therapy clients at a time.\n\n2.\tGroup Therapy.  Practicum students will be provided with the opportunity to participate in co-facilitation of group therapy with a licensed EAS staff clinician.  The types and dates of groups offered at EAS at any given time vary and are dependent on the EAS staff clinician offering the group. \n\n3.\tIndividual and Group Supervision (2 hours per week).  Each practicum student will have one or two direct clinical supervisors for all client cases, at least one of which will be a licensed clinical psychologist.  Additionally, a multi-disciplinary consultation team will be made available to the practicum student in formal and informal ways in order to provide an opportunity for the practicum student to be exposed to various treatment modalities and theoretical orientations.\n\n4.\tIntake evaluation.  Learning to evaluate the client and the client's situation so as to help the client make the most of their counseling is essential to the work at EAS.  Practicum students will conduct an intake evaluation with clients prior to starting individual therapy.  This evaluation will be conducted with a supervisor available at all times during the intake for consultation as needed, and will allow for the practicum student and supervisor to determine whether or not a particular client is appropriate for the practicum student to manage in individual therapy.  At least once per semester, direct observation of an intake evaluation will occur in which the student and the supervisor will both be present in the room.\n\n5.\tClinical Meeting (1.5 hours per week; Wednesdays 1:00PM - 2:30PM).  Practicum students meet with the clinical staff to present cases and to discuss particular problems or issues related to their work with clients.  At least once per semester, they will be asked to give a formal case presentation to the clinical staff on a client which poses a particular challenge.\n\n6.\tWorkplace Consultations/Corporate Outreach.  Each practicum student will participate in at least one workplace consultation/outreach activity for the workforce.  Practicum students are encouraged to complete this in the fall semester.\n\n7.\tSeminar (1.5 hours per week; Wednesdays 11:30AM - 1:00PM).   Practicum students are required to attend the Selected Topics & Clinical Application Seminar.  This seminar (conducted by staff members and visiting clinicians) focuses on a number of clinical areas in depth including: theories; application of theory; and other clinical topics (e.g., workplace consultations, substance abuse, collaboration within a work environment, work-life issues).  Readings for the seminars are generally assigned in advance of class (all reading materials provided by EAS).  During the course of the practicum placement, the practicum students will be asked to present a journal article.\n\n8.\tEvaluation and Feedback.  Feedback on progress will be provided in individual supervision as well as more formally throughout each semester.  Practicum students are evaluated based on their ability to establish rapport with clients, integrate theory and practice, and intervene with clients.\n\nApplication Deadline:\nApplications for the 2025/2026 program are accepted 15 November 2024 - 15 January 2025.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Psychology Practicum Program for Doctoral Level Students",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salary\n\nThe NSA's Psychology Practicum Program offers a paid position. Students will earn a competitive salary commensurate with their education level.\n\nBenefits  \n\n Practicum students will receive the following benefits:\n\n-\tAnnual leave, sick leave and paid federal holidays\n-\tParticipation in agency-wide extracurricular programs\n\nStudents are hired on a temporary appointment, and are not eligible for health insurance, life insurance, or Thrift Savings Plan benefits. \n\nWe recognize that practicum students will be enrolled in their graduate programs and continue to take courses/meet program demands at their home school while training here.  As such, practicum students will not be expected to relocate and will not be provided with funding for travel or housing.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-15T00:00:00.000Z"
  }
]
