[
  {
    "_id": "667ece32b231b42178b4d79e",
    "jobNumber": "1233908",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "fullDescription": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "grade": "12/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "Q",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-09-30T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900001",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-06-28T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "jobQualifications": null,
    "jobQualificationsExt": "Applicants will be evaluated by hiring managers and assessed according to the position requirements. Qualified applicants must be either current Federal civilian retirees or be within 6 months of retirement from civilian Federal service.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Retired Federal civilian employees employed at the National Security Agency (NSA) provide expertise and corporate knowledge to temporarily support mission requirements, augment the existing work force, and/or mentor the next generation of Agency employees.\n\nPlease respond to the screening questions attached to this job posting. Your responses enable our hiring team to match your skills and experience to mission needs.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Retired Federal civilian employees are encouraged to apply so that your skills and experience can be reviewed according to current needs and requirements.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Retired Federal Government Civilian Employees (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary range varies by location, work level, and relevant experience to the position. \n\nWork Schedule: Part-time, flexible according to the mission needs and hiring organization.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-06-28T00:00:00.000Z"
  }
]
