[
  {
    "_id": "67698b1bb231b421787d97ea",
    "jobNumber": "1242593",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Communications personnel at the National Security Agency (NSA) provide NSA with the means to build capacity through timely and effective tailored communications to inform, educate and inspire. Examples include building state-of-the-art websites and web applications for the Agency intranet, performing closed captioning at a live event, designing logos, publishing reports, and maintaining/safeguarding records.",
    "fullDescription": "Communications personnel at the National Security Agency (NSA) provide NSA with the means to build capacity through timely and effective tailored communications to inform, educate and inspire. Examples include building state-of-the-art websites and web applications for the Agency intranet, performing closed captioning at a live event, designing logos, publishing reports, and maintaining/safeguarding records.",
    "grade": "07/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "4",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2025-01-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Comm. and Public Affairs",
    "jobFamilyId": "100150",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-12-23T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Communications personnel at the National Security Agency (NSA) provide NSA with the means to build capacity through timely and effective tailored communications to inform, educate and inspire. Examples include building state-of-the-art websites and web applications for the Agency intranet, performing closed captioning at a live event, designing logos, publishing reports, and maintaining/safeguarding records.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Communication, Marketing, Public Relations, Journalism, English, Writing, or a related field.\n\nENTRY/DEVELOPMENTAL\n\nEntry is with a high school diploma or GED plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience, or a Bachelor's degree and no experience.  \n\nRelevant experience must be in the IC/DoD or in a communications or public affairs related area (for example, writing, marketing, or public relations). Successful completion of the Defense Information School (DINFOS) Public Affairs & Communications Strategy Qualification (PACS-Q) Course can count for 3 months experience.\n\nFULL PERFORMANCE \n\nEntry is with a high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.  \n\nRelevant experience must be in the IC/DoD or in a communications or public affairs related area (for example, writing, marketing, or public relations). Successful completion of the Defense Information School (DINFOS) Public Affairs & Communications Strategy Qualification (PACS-Q) Course can count for 3 months experience.\n\nSENIOR\n\nEntry is with a high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience, or a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience.  \n\nRelevant experience must include at least 2 years in a communications or public affairs-related area (for example, writing, marketing, or public relations). Additional relevant experience may also include DoD/IC experience. Successful completion of the Defense Information School (DINFOS) Public Affairs & Communications Strategy Qualification (PACS-Q) Course can count for 3 months experience.\n\nEXPERT \n\nEntry is with a high school diploma or GED plus 13 years of relevant experience, or an Associate's degree plus 11 years of relevant experience, or a Bachelor's degree plus 9 years of relevant experience, or a Master's degree plus 7 years of relevant experience, or a Doctoral degree plus 5 years of relevant experience.  \n\nRelevant experience must include at least 5 years in a communications or public affairs-related area (for example, writing, marketing, or public relations). Additional relevant experience may also include DoD/IC experience. Successful completion of the Defense Information School (DINFOS) Public Affairs & Communications Strategy Qualification (PACS-Q) Course can count for 3 months experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Communications Officers develop and deliver communications to a wide range of stakeholders (both internal and external). They leverage a full range of journalistic, public relations, and marketing techniques, platforms, and products, such as storytelling, social media, speeches, briefings, articles, and others to inform, increase awareness, and shape the Agency's image.\n\nCommunications Officers engage with appropriate outlets to promote programs and initiatives and market informational events. They work on activities across the organization and the agency.\n\nDescription of the Position\n\nThe responsibilities of a Communications Officer include:\n\n- Gathering desired outcomes and analyzing corporate or customer requirements for communication strategies or products\n- \n- Designing and executing communication campaigns and strategies using corporate communications and industry best practices\n- Creating content for social media accounts\n- Engaging with appropriate outlets to promote programs and initiatives\n- Coaching and advising others to create and deliver effective messages (for senior positions)\n- Measuring communication product outcomes and routinely analyzing return on investment",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continual learning and who possesses strong communication (oral and written), problem-solving, analytic, interpersonal skills, and is able to:\n\n- Provide excellent customer service  while remaining focused on outcomes\n- Effectively work (independently and/or within teams) across functional areas in a collaborative environment\n- Manage multiple tasks with competing timelines and deliverables\n- Remain adaptable, agile, and resilient to focus on top Agency priorities\n\n\nKnowledge and experience in one or more of the following areas is preferred:\n\n- Communications\n- Social Media\n- Journalism\n- Media / Broadcasting\n- DoD / Intelligence Community",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Communications Officer - Entry to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $55,924 - $191,900 (Entry - Expert)\n\nSalary range varies by work level and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-12-23T00:00:00.000Z"
  },
  {
    "_id": "67507e93b231b42178c9f962",
    "jobNumber": "1241813",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "fullDescription": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "grade": "07/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "6",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2025-01-10T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Physical Security",
    "jobFamilyId": "100110",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-12-05T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nENTRY/DEVELOPMENTAL\nEntry is with a high school diploma or GED and no experience.\n\nMust be at least 21 years of age and possess a valid U.S. driver's license.\n\n\nFULL PERFORMANCE \nEntry is with a high school diploma or GED plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience, or military training plus 2 years of relevant experience.\n\nA degree in any field is acceptable. Military training must be at least 18 semester hours of training in security disciplines (for example, force protection, anti-terrorism, physical security, crime prevention). \n\nRelevant experience must include one or more of the following: law enforcement, or experience in any discipline within security (personnel or physical) or counterintelligence. Must be at least 21 years of age and possess a valid U.S. driver's license. If not counted toward education, military experience may count for up to two years of relevant experience.\n\n\nSENIOR\nEntry is with a high school diploma or GED plus 6 years of relevant experience, or an Associate's degree plus 4 years of relevant experience, or military training plus 4 years of relevant experience, or a Bachelor's degree plus 2 years of relevant experience.\n\nA degree in any field is acceptable. Military training must be at least 18 semester hours of training in security disciplines (for example, force protection, anti-terrorism, physical security, crime prevention). \n\nRelevant experience must include one or more of the following: law enforcement, or experience in any discipline within security (personnel or physical) or counterintelligence. Must be at least 21 years of age and possess a valid U.S. driver's license. If not counted toward education, military experience may count for up to two years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "National Security Agency's Police Officers provide armed and uniformed security, force protection, and law enforcement functions in support of NSA's mission, assets, personnel, and facilities headquartered in and around Fort Meade. The NSA Police Force is an integral part of the NSA Security and Counterintelligence organization, which provides NSA worldwide counterintelligence, personnel, and facilities security support. \n\nPrimary Responsibilities: \n- Counterterrorism & Force Protection \n- Pedestrian and vehicular access control \n- Response and mitigation of security, medical, and fire emergencies \n- Critical incident management \n- Enforcement of laws and regulations relative to the protection of NSA assets \n- Vehicle, facility, and material security inspections \n- Firearms training and range management \n- Patrol of NSA property",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "- Enforce federal and state laws and applicable regulations\n- Respond to and investigate incidents\n- Validate badges to determine if individuals are authorized access to controlled areas\n- Operate and maintain proficiency with weapons\n- Patrol agency compounds, facilities, and perimeters to detect and deter potential unlawful acts, security breaches, or dangerous situations\n- Secure dangerous areas\n- Subdue suspects while conducting investigative detentions and/or arrests\n- Stand, walk, or kneel for long periods\n- Perform tasks that involve repetitive motions of the fingers, hands, arms, feet, legs, or other body parts\n- Perform physical activities outdoors under all weather conditions\n- Perform physically strenuous activities when responding to emergencies\n- Maintain endurance and agility in accordance with current regulations in order to perform specific job requirements \n- Drive vehicles, such as cars, vans, or trucks to transport cargo or passengers\n- Operate a motor vehicle under high speeds or high risk conditions\n- Follow safety and security procedures and practices when operating machinery, vehicles, or equipment\n\nOnly the highest caliber individuals qualify for these selected positions. At a minimum, applicants must meet the following qualifications: \n\n- Applicant must be a U.S. citizen.\n\n- Unquestionable loyalty to the United States and sound moral character as established by a comprehensive Federal Special Background Investigation (to include a polygraph).\n\n- Issues that could disqualify an applicant from consideration include, but are not limited to, whether the applicant has engaged in serious criminal activity, recent illegal drug use, a history of adverse employment actions to include absenteeism and termination, or significant credit problems such as recent bankruptcies. \n\n- This position requires the carrying of an Agency-issued firearm. The Gun Control Act of 1968, as amended, and applicable implementing regulations prohibit the NSA from issuing a firearm or ammunition to anyone who has a record of having been convicted of a crime involving domestic violence. Applicants who have been convicted of such a crime are not eligible to be considered for this position. \n\n- At least 21 years of age. \n\n- Excellent physical condition. \n\n- Must meet DoD vision standards for law enforcement occupations.\n\n- Must meet DoD hearing standards for law enforcement occupations. \n\n- Must be willing to work outdoors, shift-work, weekends, holidays, and overtime, under strenuous and potentially dangerous conditions. \n\n- Possess a valid state driver's license. \n\n- Entry is with a high school diploma or GED and no experience.\n\n- Experience working with basic office resources (e.g., e-mail, web browsers, word processors, and presentation graphics), working in security, law enforcement, and/or military service is desired. Must be at least 21 years of age and possess a valid U.S. driver's license. DoD Post Certification, CPR, and AED is preferred.\n\nAPPLICATION INFORMATION \n\nApplicants selected for further processing will be scheduled for the National Police Officer Selection Test (POST), NSA Police Physical Ability Test (PAT) and an Operational Interview. The PAT is included as part of the applicant process as it is a required element of the training. The PAT consists of:\n \n- 19 Push-Ups within 2 minutes\n- 1.5 mile run within 17 minutes and 30 seconds\n\nApplicants who successfully complete the initial testing may be extended a conditional offer of employment contingent upon successful completion of security and medical screenings, as follows: \n\n- Medical/psychological screening by NSA medical staff \n- Full field background investigation and polygraph testing\n\nApplicants selected for the position will have to successfully complete: \n\n- A Federal Law Enforcement Training Accreditation (FLETA) accredited basic academy program\n\nThis training provides a rigorous, physically and academically challenging battery of courses/instruction in law enforcement skills/techniques, which includes classroom instruction with written examinations, graded practical exercises, firearms instruction, and a PAT. \n\nThis training may be waived for candidates who have previously successfully completed a FLETA, CALEA or State P.O.S.T. accredited basic academy program, and can produce the course curriculum, transcript, and official certificate of completion.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Police / Law Enforcement Officer - Entry to Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary Offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range:  $59,141 - $128,956 (Entry/Developmental, Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn-the-job training, Internal NSA courses, and external training will be made available based upon the need and experience of the selectee.\n\nWork Schedule:  Applicants should be aware this position supports 24/7 Operations.\n\nBenefits: All NSA employees are provided a comprehensive Federal employment benefit package that includes: \n\n- Federal health and life insurance options \n- Federal retirement plan \n- 11 paid holidays a year \n- Sick leave accrued at the rate of 4 hours per pay period (13 days/year) \n- Vacation leave ranging from 13-26 days a year (based on years of Federal service) \n- Military leave \n- Shift, weekend, and holiday salary differential \n- Paid overtime \n- Tuition reimbursement program \n- On-site child care (fee for service) \n- Credit Union services \n\nIN ADDITION, OFFICERS ARE PROVIDED: \n- Uniforms, equipment, and laundering at no cost \n- Performance based rank and salary promotions \n- Opportunities to apply for vacancies in the following specialized units: \n- Emergency Response Team (SWAT) \n- Chemical and Biological Rapid Response Team \n- K-9 Unit \n- Dispatch \n- Mountain Bike Patrol \n- Police Training Unit \n- Firearms Instructors",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-12-05T00:00:00.000Z"
  },
  {
    "_id": "67337e7eb231b42178fd20b6",
    "jobNumber": "1240582",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The 9-12 month Psychology Practicum Program for Doctoral Level Students placement is designed for three doctoral students in psychology who are interested in developing their clinical skills and building their knowledge base.  The practical application of this knowledge is in the treatment of a diverse workforce within the federal government's Intelligence Community.",
    "fullDescription": "The 9-12 month Psychology Practicum Program for Doctoral Level Students placement is designed for three doctoral students in psychology who are interested in developing their clinical skills and building their knowledge base.  The practical application of this knowledge is in the treatment of a diverse workforce within the federal government's Intelligence Community.",
    "grade": "07/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "R",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2025-01-15T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "How to Apply\n\nApplications must be submitted online at www.IntelligenceCareers.gov on or before 15 January 2025. Applications received after the deadline, as well as incomplete packages, will not be considered.\n\nTo be considered for the Psychology Practicum Program, submit a complete application package that includes: \n\n-\tCurrent CV\n-\tA cover letter addressing experience and interest in the above described practicum placement\n-\tOfficial transcript(s)\n-\tTwo letters of recommendation from professionals familiar with your clinical work\n\nTo submit the online application, you must use our resume builder application tool - you cannot upload a resume. For step-by-step instructions on how to complete the application, please refer to the application guide at intelligencecareeers.gov/nsa ' 'Job Search/Apply' ' and look under the 'Need Help' section.\n\nTranscripts: \n\nTranscripts may be issued directly by the Registrar, or issued to you by the Registrar, then sent with your application materials. Only originals via post, photocopies of originals via post, scanned copies of originals via email (PDF format only) will be accepted. If your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcript as an attachment. Please do not send html transcripts accessible via a website or text versions thereof.\n\nIMPORTANT: When applying online, you may only submit your resume at www.IntelligenceCareers.gov.  All other required documentation must be emailed to EAS_STP@nsa.gov by the application deadline.\n\nQuestions\n\nIf you have questions about the Student Practicum Program, please contact us at the e-mail address above or call 1-866-NSA-HIRE. You may also email SummerInterns@uwe.nsa.gov or call 410-854-4726. \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-15T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The 9-12 month Psychology Practicum Program for Doctoral Level Students placement is designed for three doctoral students in psychology who are interested in developing their clinical skills and building their knowledge base.  The practical application of this knowledge is in the treatment of a diverse workforce within the federal government's Intelligence Community.",
    "jobQualifications": null,
    "jobQualificationsExt": "Qualification Criteria\n\n-\tMust be a U.S. citizen\n-\tMust be eligible to be granted a security clearance \n-\tMust be within the third year or higher of an APA-accredited counseling or clinical psychology doctoral degree program\n-\tMust be available for the entire 9-12 month program\n-\tMust be available for an operational interview and other applicable processing between January and May 2025\n\nClearance/Security Requirements\nApplicants will be processed for a security clearance, and will be required to pass a psychological exam, lifestyle and counterintelligence polygraph, drug screening test, and complete a comprehensive history form that documents foreign travel, education background and employment history, among other areas.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "About the Practicum Program\n\nThe Employee Assistance Services (EAS) is the psychological treatment division of the National Security Agency (NSA).  It offers clinical services to all Agency employees and their spouses.  EAS is an ideal setting for practicum students to gain relevant experience working with a wide variety of presenting concerns and a broad range of diagnoses.  The EAS clientele also offers the opportunity to work with diverse cultural and ethnic backgrounds.  The 9-12 month practicum placement is designed for three doctoral students in psychology who are interested in developing their clinical skills and building their knowledge base.  The practical application of this knowledge is in the treatment of a diverse workforce within the federal government's Intelligence Community. \nThe 9-12 month practicum placement requires approximately 16-20 hours per week, dependent on the practicum students interests and the requirements of their respective graduate program (this includes administrative responsibilities and supervision preparation).  Practicum students are responsible for ensuring that their hours meet criteria for their respective programs.  The following is a tentative outline of weekly activities.\n\n1.\tIndividual Therapy (7-8 hours per week).  Clients will generally be seen once a week with a ten-session limit.  Some cases may be more appropriate for biweekly counseling, which can be arranged.  Practicum students will be provided with a private office at EAS in which they will see clients.  Practicum students will carry 7-10 individual therapy clients at a time.\n\n2.\tGroup Therapy.  Practicum students will be provided with the opportunity to participate in co-facilitation of group therapy with a licensed EAS staff clinician.  The types and dates of groups offered at EAS at any given time vary and are dependent on the EAS staff clinician offering the group. \n\n3.\tIndividual and Group Supervision (2 hours per week).  Each practicum student will have one or two direct clinical supervisors for all client cases, at least one of which will be a licensed clinical psychologist.  Additionally, a multi-disciplinary consultation team will be made available to the practicum student in formal and informal ways in order to provide an opportunity for the practicum student to be exposed to various treatment modalities and theoretical orientations.\n\n4.\tIntake evaluation.  Learning to evaluate the client and the client's situation so as to help the client make the most of their counseling is essential to the work at EAS.  Practicum students will conduct an intake evaluation with clients prior to starting individual therapy.  This evaluation will be conducted with a supervisor available at all times during the intake for consultation as needed, and will allow for the practicum student and supervisor to determine whether or not a particular client is appropriate for the practicum student to manage in individual therapy.  At least once per semester, direct observation of an intake evaluation will occur in which the student and the supervisor will both be present in the room.\n\n5.\tClinical Meeting (1.5 hours per week; Wednesdays 1:00PM - 2:30PM).  Practicum students meet with the clinical staff to present cases and to discuss particular problems or issues related to their work with clients.  At least once per semester, they will be asked to give a formal case presentation to the clinical staff on a client which poses a particular challenge.\n\n6.\tWorkplace Consultations/Corporate Outreach.  Each practicum student will participate in at least one workplace consultation/outreach activity for the workforce.  Practicum students are encouraged to complete this in the fall semester.\n\n7.\tSeminar (1.5 hours per week; Wednesdays 11:30AM - 1:00PM).   Practicum students are required to attend the Selected Topics & Clinical Application Seminar.  This seminar (conducted by staff members and visiting clinicians) focuses on a number of clinical areas in depth including: theories; application of theory; and other clinical topics (e.g., workplace consultations, substance abuse, collaboration within a work environment, work-life issues).  Readings for the seminars are generally assigned in advance of class (all reading materials provided by EAS).  During the course of the practicum placement, the practicum students will be asked to present a journal article.\n\n8.\tEvaluation and Feedback.  Feedback on progress will be provided in individual supervision as well as more formally throughout each semester.  Practicum students are evaluated based on their ability to establish rapport with clients, integrate theory and practice, and intervene with clients.\n\nApplication Deadline:\nApplications for the 2025/2026 program are accepted 15 November 2024 - 15 January 2025.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Psychology Practicum Program for Doctoral Level Students",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salary\n\nThe NSA's Psychology Practicum Program offers a paid position. Students will earn a competitive salary commensurate with their education level.\n\nBenefits  \n\n Practicum students will receive the following benefits:\n\n-\tAnnual leave, sick leave and paid federal holidays\n-\tParticipation in agency-wide extracurricular programs\n\nStudents are hired on a temporary appointment, and are not eligible for health insurance, life insurance, or Thrift Savings Plan benefits. \n\nWe recognize that practicum students will be enrolled in their graduate programs and continue to take courses/meet program demands at their home school while training here.  As such, practicum students will not be expected to relocate and will not be provided with funding for travel or housing.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-15T00:00:00.000Z"
  }
]
