[
  {
    "_id": "6724ee10b231b421788fc595",
    "jobNumber": "1240395",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Cryptologic Engagement Officers engage with internal and external stakeholders to deliver products; protect assets -  for example: make procurements; influence policy; protect, develop and acquire human resources; develop partnerships; and share and receive knowledge.",
    "fullDescription": "Cryptologic Engagement Officers engage with internal and external stakeholders to deliver products; protect assets -  for example: make procurements; influence policy; protect, develop and acquire human resources; develop partnerships; and share and receive knowledge.",
    "grade": "09/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "8",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-12T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Comm. and Public Affairs",
    "jobFamilyId": "100150",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-05T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Cryptologic Engagement Officers engage with internal and external stakeholders to deliver products; protect assets -  for example: make procurements; influence policy; protect, develop and acquire human resources; develop partnerships; and share and receive knowledge.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nA degree in any field is acceptable. Military training must be at least 18 semester hours of coursework on serving as a liaison or in NSA mission areas.\n\nRelevant experience must include one or more of the following: an area directly related to NSA mission (for example, collection, intelligence, cryptology), NSA/IC/DoD mission support, NSA/IC/DoD inter-agency support, or NSA-relevant industry, academic, or governmental entities.\n\n\nENTRY/DEVELOPMENTAL\nEntry is with a high school diploma or GED plus 5 years of relevant experience, or an Associate's degree plus 3 years of relevant experience, or military training plus 3 years of relevant experience, or a Bachelor's degree plus 2 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. \n\nFULL PERFORMANCE\nEntry is with a high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience, or military training plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 years of relevant experience, or a Doctoral degree and no experience. \n\nSENIOR\nEntry is with a high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience, or military training plus 8 years of relevant experience, or a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. \n\nEXPERT\nEntry is with a high school diploma or GED plus 13 years of relevant experience, or an Associate's degree plus 11 years of relevant experience, or military training plus 11 years of relevant experience, or a Bachelor's degree plus 9 years of relevant experience, or a Master's degree plus 7 years of relevant experience, or a Doctoral degree plus 5 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Cryptologic Engagement Officers' responsibilities include:\n\n-\tDeveloping, nurturing, and/or negotiating relationships with the Department of Defense (DoD), Intelligence Community (IC), Industry and foreign partners.\n-\tOperating in a collaborative and responsive environment, maximizing dynamic partner capabilities.\n-\tAssessing stakeholder needs and identifying capabilities to address those needs.\n-\tProviding timely and effective support and information sharing within appropriate legal authorities.\n-\tIdentifying the internal and external politics that impact the work of the organization and responding accordingly.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continual learning and who possesses strong communication (oral and written), problem-solving, analytic, interpersonal skills, and is:\n-\tCustomer and results oriented.\n-\tAble to negotiate with and influence others. \n-\tAble to build relationships across the Agency and with external stakeholders, as appropriate.\n-\tAble to work effectively (independently and/or within teams) across functional areas in a collaborative environment.\n-\tAble to take action in highly complex situations.\n-\tDetail-oriented.\n-\tAble to manage multiple tasks with competing timelines and deliverables.\n-\tAble to identify, manage and resolve conflicts and disagreements in a constructive manner.\n-\tAccountable.\n-\tAdaptable.\n\nPreferred qualifications for one of the Cryptologic Engagement Officer focus areas include the following:\n-\t15+ years of experience in supporting national incident surges, threats to homeland and experience with IC representatives on input and review of national counterterrorism strategies and policies\n-\tSpecific knowledge of counterterrorism (CT) mission set and demonstration of National Security Council level engagements\n-\tAbility to navigate sensitive political and operational situations related to the CT mission\n-\tHistorical knowledge of CT mission area to enable navigation of nuances with key partners (both across the IC and foreign partners)",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cryptologic Engagement Officer - Entry to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $68,405 - $191,900 (Entry/Developmental, Full Performance, Senior, Expert)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-05T00:00:00.000Z"
  },
  {
    "_id": "67239c80b231b42178850636",
    "jobNumber": "1240369",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-18T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-04T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Electrical Engineering, General Engineering or Architectural Engineering. If program is not ABET accredited, it must include specified coursework.*  A degree in Engineering Technology will also be considered if it includes specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nRelevant experience must be working in an electrical engineering capacity (for example, UPS, switchgear, SCADA, transformers, substations, power panels, switchboards, and metering of power). Additionally, must have experience using NEC code and computer aided design and drafting, reading design drawings, and cost estimation. Experience may also include project management.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Be a part of our mission to protect the national security of the United States, and have a direct impact to enable success in Agency operations. As a Facilities Electrical Engineer, you will have the opportunity to work directly with mission customers to validate the requirements and unique needs to provide reliable technical solutions.\n\nWith the ever-changing industry and increase of technology complexities to accommodate our workforce, NSA's Installation & Logistics organization needs motivated Electrical Engineers to provide facilities design expertise, guidance, and support to the development and implementation of facilities solutions that enable capabilities that align with mission driven priorities. \n\nAdditionally, the Installations & Logistics organization is seeking Electrical Engineers with a focus or specialty in control and monitoring of electrical systems. Candidates with this specialty should be knowledgeable about or interested in learning about Supervisory Control and Data Acquisition (SCADA) and electrical control systems, electrical power systems, Schweitzer protective relays, Real-Time Automation Controllers (RTAC) as well as Programmable Logic Controllers (PLCs). Knowledge of the protocols used by these devices including mirrored bits, Modbus, DNP, and SNMP is desired.\n\nAs an Electrical Engineer at NSA, responsibilities may include:\n\n-  Prepare design and construction cost estimates.\n-  Development of designs for new and renovated facilities.\n-  Prepare engineering technical reports, specifications, and drawings.\n-  Provide construction detailing.\n-  Perform engineering analysis and calculations.\n-  Conduct code analysis.\n-  Project management.\n-  Facilities planning.\n-  Drafting of electrical plans and schematics.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate demonstrates the following:\n\n-  Problem Solving\n-  Interpersonal Skills\n-  Partnering\n-  Customer Service\n-  Accountability\n-  Continual Learning\n-  Resilience\n-  Effective Communication\n\nFor the monitoring and control system focus area, knowledge and experience in one or more of the following is desired:\n\n-  Supervisory Control and Data Acquisition (SCADA) and electrical control systems\n-  Implementation of relays and data aggregators\n-  Configuring and supporting Schweitzer Real Time Automation Controllers (RTAC)\n-  Evaluating and documenting PLC programs for electrical power control\n-  Relay protection design\n-  Applying concepts, principles, and methods for network connectivity (e.g. routing, switching, tunneling, and IP addressing)\n\nAdditional knowledge and experience in one or more of the following is desired:\n\n-  Technical software packages (e.g., AutoCAD, ETAP, SKM, CDEGS, ASPEN,  AGI32, Visual Lighting, MEGAMAN)\n-  Relay protection design\n-  Generators and plant control systems\n-  Uninterruptible Power Supply (UPS) systems\n-  Electrical distribution design and equipment (high voltage, medium voltage, low voltage)\n-  Electrical power system grounding and signal grounding\n-  Operation and design of SCADA and electrical control systems\n-  Emergency power systems\n-  Codes and standards (NFPA ' including NEC, UL, IEEE, etc.)\n-  Electrical schematics and blueprints\n-  Cost estimating\n-  Reliability and availability\n-  Startup and commissioning\n-  Electrical operations & maintenance\n-  Generators and plant control systems\n-  Uninterruptible Power Supply (UPS) systems\n-  Electrical distribution design and equipment (high voltage, medium voltage, low voltage)\n-  Emergency power systems\n-  Codes and standards (NFPA ' including NEC, UL, IEEE, etc.)\n-  Technical software packages (e.g., AutoCAD, ETAP, SKM, CDEGS, ASPEN, AGI32, Visual Lighting)\n-  Electrical schematics and blueprints\n-  Cost estimating\n-  Reliability and availability\n-  Startup and commissioning\n-  Electrical operations & maintenance",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Electrical Engineer - Facilities - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.  This position is hiring for Maryland.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-04T00:00:00.000Z"
  },
  {
    "_id": "6724ee10b231b421788fc594",
    "jobNumber": "1240399",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-15T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-04T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Computer Science (CS). Related fields (e.g., Engineering, Mathematics, Information Technology, Information Systems) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). \n\nRelevant experience must be in the design/development of computer or information systems and include engineering hardware and/or software over their lifecycle (i.e., requirements analysis, design, implementation, testing, integration, deployment/installation, and maintenance), programming, computer systems research, reverse engineering, and/or computer/network security. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Computer Systems Architects at NSA use commercial and government developed hardware, software, networking, and security products to:\n\n-\tdrive information technology projects\n-\tproduce compliance results for established project requirements and IT architecture  \n-\tmodernize IT architecture through analysis of research and introducing changes based on evolving project requirements\n-\tintegrate industry trends, emerging technologies and standards, and new vendor features  \n-\tcollaborate with experts in technical and application teams to identify, evaluate, and recommend technical solutions to support project requirements\n-\tdefine and analyze data requirements, mapping legacy data stores and formats to logical and physical data models \n-\tpropose standard ways for information transport between IT systems and stored within corporate knowledge databases\n-\tperform architectural alignment of the enterprise logical data model and physical data models",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is a self-starter with a desire for continual learning and strong problem-solving, analytic, and interpersonal skills who is able to: \n\n-\twork in a team environment \n-\tadapt to change\n-\tprovide innovative solutions\n-\tcommunicate effectively \n-\tmulti-task across multiple projects\n\nThe ideal candidate will also reflect specialized skill and experience in one or more of the following:\n \n-\tSystem administration with Windows, UNIX, and/or Linux\n-\tProgramming and scripting experience (e.g., C, C++, Java, Assembly, Python, Perl, Ruby, Bash, Node.js, Spark, Puppet, SALT, KAFKA, HADOOP)\n-\tDatabase design/development (e.g., NiFi, MongoDB)\n-\tNetwork protocols and hardware \n-\tVirtualization fundamentals\n-\tCloud architecture\n-\tSecurity architectures and appliances\n-\tFirewalls Boundary device solutions/architecture",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Computer Systems Architect - Mid Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-04T00:00:00.000Z"
  },
  {
    "_id": "6724ee10b231b421788fc596",
    "jobNumber": "1240405",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-16T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-04T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree in any area is acceptable.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. A high school diploma or GED plus 7 years of experience; or an Associate's degree plus 5 years of experience; or at least 18 semester hours of military coursework/training plus 5 years of experience may be considered. Military coursework/training must be in hardware or software lifecycle maintenance or computer/network security.\n\nRelevant experience must include Linux and scripting (for example, Python, Bourneshell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), or computer/network security, or high performance computing.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. A high school diploma or GED plus 10 year of experience; or an Associate's degree plus 8 years of experience; or at least 18 semester hours of military coursework/training plus 8 years of experience may be considered. Military coursework/training must be in hardware or software lifecycle maintenance or computer/network security.\n\nRelevant experience must be in high performance computing, including tuning Linux, and automation through scripting (for example, Python, Bourneshell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), monitoring enhancements, or mitigating computer security vulnerabilities.\n\nEXPERT\nEntry is with a Bachelor's degree plus 9 years of relevant experience or a Master's degree plus 7 years of relevant experience or a Doctoral degree plus 5 years of relevant experience. A high school diploma or GED plus 13 years of experience; or an Associate's degree plus 11 years of experience; or at least 18 semester hours of military coursework/training plus 11 years of experience may be considered. Military coursework/training must be in hardware or software lifecycle maintenance or computer/network security. Degree in any area is acceptable.\n \nRelevant experience must be in high performance computing, including tuning Linux, implementing and optimizing system architecture plans, and automation through scripting (for example, Python, Bourneshell, PERL). In addition, it may also include improving hardware or software lifecycle activities (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), monitoring enhancements, or mitigating computer security vulnerabilities",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "High Performance Computing (HPC) Specialists maintain high performance computing ecosystems including identifying solutions to requirements for complex hardware and software computing infrastructure, data storage, and security.\n\nHPC Specialists play a vital role at NSA by providing life-cycle support for one or more unique computing systems including building, testing, monitoring, maintaining/repairing, security patching, or refreshing systems.\n\nHPC Specialists upgrade and decommission systems, re-configure systems, and optimize performance to meet the computing needs of internal customers and manage relationships with external vendors.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continual learning and who possesses strong interpersonal, communication (oral and written), and problem-solving skills, and is:\n\n- people focused\n- accountable\n- adaptable\n- detail-oriented\n- customer service & requirements oriented\n- able to work effectively in a collaborative environment\n- able to manage multiple tasks with competing timelines and deliverables\n\nRelevant experience must include Linux and scripting (for example, Python, Bourne shell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), or computer/network security, or high performance computing.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High Performance Computing (HPC) Systems Administrator/HPC Specialist - Mid to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $191,900 (Full Performance, Senior, Expert)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-04T00:00:00.000Z"
  },
  {
    "_id": "671911a8b231b4217834c464",
    "jobNumber": "1239583",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Join the agency's exciting Intelligence Analysis mission, using your skills in research, analysis, reporting, and telecommunications to help protect US government information systems and ensure senior leaders are provided with time-sensitive cryptologic support for integrated information and cyberspace operations across the DOD and US Government.",
    "fullDescription": "Join the agency's exciting Intelligence Analysis mission, using your skills in research, analysis, reporting, and telecommunications to help protect US government information systems and ensure senior leaders are provided with time-sensitive cryptologic support for integrated information and cyberspace operations across the DOD and US Government.",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "I",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-07T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Intelligence Analysis",
    "jobFamilyId": "100010",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Join the agency's exciting Intelligence Analysis mission, using your skills in research, analysis, reporting, and telecommunications to help protect US government information systems and ensure senior leaders are provided with time-sensitive cryptologic support for integrated information and cyberspace operations across the DOD and US Government.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nA degree in any field is acceptable.\n\nRelevant experience must be in one or more of the following: performing intelligence or language analysis; writing, editing, or producing technical/analytic reports or products (e.g., working aids, briefings); conducting research and analysis using established professional methods and techniques; data/information management in an area directly related to an NSA mission; threat analysis, risk analysis, or traffic analysis; geospatial analysis and/or geospatial information systems; or drafting/editing intelligence reports. Experience may also include multi-source or technical threat analysis (e.g., SIGINT, ELINT, FISINT, Open-Source, and Geospatial) or experience in a similar mission in the IC or DoD.\n\nFULL PERFORMANCE \nEntry is with a high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.  \n\nSENIOR \nEntry is with a high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience, or a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. \n\nEXPERT\nEntry is with a high school diploma or GED plus 13 years of relevant experience, or an Associate's degree plus 11 years of relevant experience, or a Bachelor's degree plus 9 years of relevant experience, or a Master's degree plus 7 years of relevant experience, or a Doctoral degree plus 5 years of relevant experience.\n\n\n---------------------------------------------------------------------\n\n\n**********This position includes an Unproctored Internet Testing (UIT) requirement measuring cognitive ability, motivation, and English proficiency.**********\nUpon application submission, you should immediately see an automated response in your provided email (Inbox or SPAM folder) with testing instruction and your test link. \nYour opportunity to test for consideration into this position will expire 7 days following application submission.  Please be sure to complete the assessment as soon as you can, as this information will be used as part of the selection decision, with processing hindered until test results are recorded. You may also access your test link through your Dashboard on the Applicant Portal.  If you do not receive a test link within a few business days after applying to this position, please contact 1-844-IC-HIRES (1-844-424-4737) for a review of your submission.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA Intelligence Analysts are at the leading edge of NSA's mission, and have the power to influence world affairs.  NSA Analysts are poised to provide the most complete possible foreign signals intelligence picture to U.S. policy makers and military commanders. They detect, discover, and deter foreign adversary intrusions into US networks and devise new ways to exploit foreign adversary capabilities. They do so in a variety of ways: \n\n- Leverage NSA's unique capabilities to understand and mitigate global Cyber threats \n- Research foreign intelligence targets and their geo-political environment\n- Apply new techniques and develop creative solutions to address analytic problems such as synthesizing large volumes of data and disparate sources of information\n- Understand communications technology and burgeoning commercial and foreign intelligence target technology trends\n- Craft written assessments of foreign intelligence that provide unique insight into target intentions unavailable from other intelligence disciplines\n- Collaborate effectively (both within NSA and with the Intelligence Community) to further NSA missions",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Relevant experience, coursework, and knowledge in one or more of the following is desired: \n\n-      Signals intelligence analysis and reporting\n-      Target development\n-      Computer science and networking\n-      Network Security\n-      Cybersecurity Research \n-      Information Security\n-      Military exercises / operational planning\n-      Data modeling, mining, or science\n-      ELINT / Geospatial analysis\n-      Foreign Relations/Partnering\n-      Legislative Affairs, Policy Development\n-      Intelligence analysis\n-      Technical skills\n-      Analytic editing/writing\n-      Leadership\n-      Intelligence Watch and/or Operations Center\n-      Network incident triage\n-      Metadata analysis\n-      Quantitative / Statistical analysis\n-      Research methodology \n-      Social network analysis\n-      Critical foreign languages\n-      Telecommunications\n-      Regional studies/expertise relevant to national security \n-      Information/Data management (archival, historical, metadata tagging/filtering/retrieval)\n\nRelevant Internships, extracurricular activities, and/or foreign study are also considered.  \nPrior military without a degree but with intelligence analysis cryptologic experience will be considered.\n\nThe ideal candidate has experience in areas of intelligence analysis, is intellectually curious, has a strong desire for learning and is also:\n\n-\twell-organized and able to handle multiple assignments in a fast-paced environment\n-\tflexible and able to adapt to evolving priorities\n-\ta strong written and oral communicator     \n-\table to synthesize information to solve complex problems\n-\table to work effectively across several different functional areas in a collaborative environment\n-\table to provide timely and accurate customer service\n\n**********This position includes an Unproctored Internet Testing (UIT) requirement measuring cognitive ability, motivation, and English proficiency.**********\nUpon application submission, you should immediately see an automated response in your provided email (Inbox or SPAM folder) with testing instruction and your test link. \nYour opportunity to test for consideration into this position will expire 7 days following application submission.  Please be sure to complete the assessment as soon as you can, as this information will be used as part of the selection decision, with processing hindered until test results are recorded. You may also access your test link through your Dashboard on the Applicant Portal.  If you do not receive a test link within a few business days after applying to this position, please contact 1-844-IC-HIRES (1-844-424-4737) for a review of your submission.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Intelligence Analyst - Experienced to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $191,900 (Full Performance, Senior, Expert Level)\nSalary range varies by location, work level, and relevant experience to the position. This position is hiring for Maryland.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-01T00:00:00.000Z"
  },
  {
    "_id": "67224ae9b231b421787a439b",
    "jobNumber": "1239727",
    "OtherActivities": null,
    "agency": "NSA",
    "description": null,
    "fullDescription": null,
    "grade": "07/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "O",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-13T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900000",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": null,
    "jobQualifications": null,
    "jobQualificationsExt": null,
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency employs a diverse workforce that plays a critical role in protecting our nation's security every day. The NSA is seeking individuals with relevant Intelligence Community (IC) experience to support our mission. Previous NSA employees are highly encouraged to apply to this job posting. Applicants to this advertisement will be considered against the two skill areas that they chose in the screening questions and will be required to meet all applicable minimum qualifications. To determine the minimum qualifications associated with a particular vacancy, please review the relevant vacancy announcement.\n\nRetired Federal government employees are encouraged to apply directly to the \"Retired Federal Government Employees\" job posting so that we can consider your application as a reemployed annuitant. In addition, we suggest you contact the Office of Personnel Management should you have any questions regarding the impact of reemployment on your current benefits as a federal retiree.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "NSA corporately hires for many areas of consideration. Your responses to screening questions attached to this job posting will help us to guide you toward the area(s) that best fit your background/experience:\n\no Computer Science\no Corporate Officer\no Cybersecurity & Analysis\no Data Science\no Engineering and Physical Science\no Human Resources\no Language Analysis\no Mathematics\no Networking and Telecommunications \no Signals Analysis\n\nQualifications\n\nThe minimum qualifications against which the applicant will be evaluated derive from the skill area to which they are matched. In addition, the applicant must have previous experience working as a civilian employee or military affiliate in an Intelligence Community Agency.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Former Intelligence Community (IC) Professionals",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-01T00:00:00.000Z"
  },
  {
    "_id": "67239c80b231b42178850634",
    "jobNumber": "1240070",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-15T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nFor all 3 types of Microelectronics Engineers, the degree must be in Engineering, Physics, or Materials Science from an accredited college or university, or a relevant professional technical field (for example, microelectronics, semiconductor, chemistry, architecture, computer science, mathematics, hydrology, geology)\n\nFor all of the above degrees, if program is not ABET EAC accredited, it must include specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i) computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\n-------------------------------------------------------------------------------\n\nFOR MICROELECTRONICS PACKAGE DESIGN ENGINEER:\n\nSENIOR\nEntry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience. An Associate's degree plus 8 years of relevant experience may also be considered.  \n\nRelevant experience must be in one or more of the following: developing advanced microelectronics systems through the design of integrated circuits, custom multichip modules (MCMs), printed circuit boards (PCBs), high density redistribution layers, 3D multi-layer integrated technologies, or system enclosures using electronic design automation (EDA) tools.\n\n-------------------------------------------------------------------\n\nFOR MICROELECTRONICS PROCESS ENGINEER:\n\nSENIOR \nEntry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience. An Associate's degree plus 8 years of relevant experience may also be considered. \n\nRelevant experience must be in one or more of the following: assembly or fabrication process improvement of advanced microelectronics systems such as integrated circuit enclosures, custom multichip modules (MCMs), printed circuit boards (PCBs), high density redistribution layers, 3D multi-layer integrated technologies, or system enclosures.\n\n------------------------------------------------------------------------\n\nFOR MICROELECTRONICS TECHNOLOGY ENGINEER:\n\nFULL PERFORMANCE \nWith a degree in professional Engineering, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.  With a degree in either (1) Physics or Materials Science from an accredited college or university or (2) a relevant professional technical field (for example, microelectronics, semiconductor, chemistry, architecture, computer science, mathematics, hydrology, geology), entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience. \n\nRelevant experience must be in one or more of the following: characterization, test, reliability, or failure root cause analysis of advanced microelectronics systems such as integrated circuits, custom multichip modules (MCMs), printed circuit boards (PCBs), high density redistribution layers, 3D multi-layer integrated technologies, or system enclosures.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "With the ever-increasing technological complexities in the world of Microelectronics, we need talented Microelectronics Engineers to be part of our team designing, assembling, testing, and qualifying the next generation of electronics hardware in support of our mission. Our goal is to provide microelectronics services of the highest quality to ensure the success of the Agency's mission. \n\nMicroelectronics Engineers utilize electrical, computer, mechanical, and materials engineering knowledge and skills to design, assemble, test, analyze and qualify the next generation of electronics hardware in support of the NSA mission. \n\nThe National Security Agency (NSA) currently has opportunities for three types of Microelectronics positions: Microelectronics Package Design Engineer, Microelectronics Process Engineer, and Microelectronics Technology Engineer. \n\n1. A Microelectronics Package Design Engineer is focused on developing advanced microelectronics systems through the design of custom multichip modules (MCM), printed circuit board (PCB), high density redistribution layers, 3D multi-layer integrated technologies and/or system enclosures. Areas of responsibility can also include: \n\n-  Knowledge of Application Specific Integrated Circuit (ASIC) and Field Programmable Gate Array (FPGA) design \n-  Knowledge of Register Transfer Level (RTL) design including Verilog and VHDL \n-  Knowledge of Digital/Analog Logic design/simulation, functional verification, Design For Test (DFT), testability analysis \n-  Understanding and development of assembly specifications in accordance with industry standards \n-  Understanding and application of Signal Integrity (SI)/Power Integrity (PI)/Electro-Magnetic Integrity (EMI) Analysis methodologies for design \n-  Conduct research including studies, experiments, and investigations on new or alternate methodologies \n-  Enhance process design and development to support advanced assembly techniques such as Three Dimensional Interconnect (3DI) and Printed Electronics\n\n2. A Microelectronics Process Engineer is focused on assembly and fabrication of advanced microelectronics systems such as custom multichip modules (MCM), printed circuit board (PCB), high density redistribution layers, 3D multi-layer integrated technologies and/or system enclosures. Areas of responsibility can also include: \n\n-  Participate in assembly and fabrication process improvement efforts \n-  Conduct research including studies, experiments, and investigations on new or alternate methodologies, fabrication, and/or assembly equipment\n-  Enhance process and mature development of advanced assembly techniques such as Three Dimensional Interconnect (3DI) and Printed Electronics \n\n3. A Microelectronics Technology Engineer is focused on the test, failure, and physical analysis of advanced microelectronics systems such as integrated circuits, custom multichip modules (MCM), printed circuit board (PCB), high density redistribution layers, 3D multi-layer integrated technologies, and/or system enclosures. Areas of responsibility can also include: \n\n-  Conduct environmental and reliability tests \n-  High-pin-count Integrated Circuit (IC) design and operation validation \n-  Parametric testing - Accelerated testing / qualification / screening \n-  Develop test plans according to industry and military specifications \n-  Design and develop test platforms\n-  Support quality assurance efforts for developed and fielded systems\n-  Disassembly and sample preparation for physical analysis of ICs for failure analysis\n-  Perform scanning electron microscopy (SEM), low energy electrons microscopy (LEEM), and/or atomic force microscopy (AFM)\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Microelectronics Package Design Engineer Specialized Skills: \n\n-  Concepts, theories, and methods for designing, analyzing, testing, and integrating electrical and communications systems \n-  Designing analog and digital circuits (e.g., FPGAs, ASICs, PCBs) \n-  Use modeling/simulation to evaluate designs \n-  Experience using Electronic Design Automation (EDA) tools for ASIC and/or PCB design is required \n-  Applying engineering principles to perform printed circuit board layout \n-  Applying engineering principles to perform redistribution layer design and layout \n-  Applying engineering principles to perform 3D integration design and layout \n-  Application of the scientific principles, methods, and processes used to conduct research studies (e.g., study design, data collection and analysis, and reporting results) \n\nMicroelectronics Process Engineer Specialized Skills: \n\n-  Concepts, theories, and methods for designing, analyzing, testing, and integrating electrical and communications systems is desired \n-  Understanding of circuit design is desired (e.g., FPGAs, ASICs, PCBs) \n-  Understanding of modeling/simulation to evaluate designs is desired \n-  Experience using Electronic Design Automation (EDA) tools is desired \n-  Applying engineering principles to perform printed circuit board layout is desired \n-  Application of the scientific principles, methods, and processes used to conduct research studies (e.g., study design, data collection and analysis, and reporting results) \n-  Semiconductor or integrated circuit quality assurance and materials science/fabrication experience is preferred \n\nMicroelectronics Technology Engineer Specialized Skills: \n\n-  Concepts, theories, and methods for designing, analyzing, testing, and integrating electrical and communications systems \n-  Understanding of digital circuits designs and schematics (e.g., FPGAs, ASICs) \n-  Understanding of packaging and/or assembling processes for custom microelectronics (ASICs, FPGAs, PCBs) test and evaluation \n-  Use modeling/simulation to evaluate microelectronics designs for test \n-  Testing of integrated circuit devices, FPGAs and complex microelectronics systems \n-  Microelectronics design engineering including analog or digital logic design is desired. \n-  Experience using Electronic Design Automation (EDA) tools is desired \n-  Application of the scientific principles, methods, and processes used to conduct research studies (e.g., study design, data collection and analysis, and reporting results) \n-  Semiconductor or integrated circuit quality assurance and materials science/fabrication experience is desired \n-  Develop test plans for environmental and reliability evaluations \n-  Understanding of industry and military test and reliability standards is desired \n\nTechnical competencies for all three positions may include: \n\n-  Create and maintain documentation on technical information \n-  Operate specialized scientific and technical equipment \n-  Attend conferences and communicate with people in a particular technical field to keep abreast of new technologies and information \n-  Serve as a subject matter expert to support research and development efforts - Collaborate extensively with customers and develop requirements, project milestones, deliverables and reports \n-  Research emerging technologies for application(s) within the Agency \n-  Concepts, theories, and methods related to the composition, structure, and properties of materials, and the identification/processing of optimal materials for various uses \n-  Solving technical problems \n-  Translate conceptual designs into technical specifications \n-  Evaluate information in technical documents to understand its importance and significance \n-  Work with customers to clarify their needs and to determine how their needs can be met - Semiconductor or integrated circuit quality assurance \n-  Operate specialized scientific and technical equipment\n-  Conduct research including studies, experiments, and investigations on new or alternate methodologies\n-  Conduct research including studies, experiments, and investigations on new or alternate fabrication and assembly/disassembly equipment and analysis tools\n-  Participate in disassembly and/or physical analysis of microelectronics systems or integrated circuits and contribute to process improvement efforts\n-  Develop and apply new processes and techniques for the full die imaging and analysis of ICs\n-  Develop and apply new processes and techniques for full die processing and sample preparation of ICs through the use of polishing/lapping, wet chemistry, plasma etching, thin film coating, and optical metrology tools\n-  Use microscopy techniques such as scanning electron microscopy (SEM), low energy electron microscopy (LEEM), and/or atomic force microscopy (AFM)\n-  Develop new techniques and advanced processes for circuit edit, cross sectioning, and imaging for IC's using state of the art focused ion beam tools\n-  Develop IC failure analysis techniques\n\nThe ideal candidate is someone with excellent problem-solving, communication, and interpersonal skills who is: \n\n-  Motivated \n-  Creative \n-  Able to work effectively across several different functional areas in a collaborative environment \n-  Well-organized and able to handle multiple assignments \n-  Customer service and requirements focused \n-  Detail oriented",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Microelectronics Engineer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-01T00:00:00.000Z"
  },
  {
    "_id": "6721009fb231b42178702dd3",
    "jobNumber": "1240119",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Occupational Health and Well-Being Services (OHWB), Advocacy Services is seeking the ideal candidate to serve as a Sexual Assault Response Coordinator (SARC) within the NSA Sexual Assault Prevention and Response (SAPR) Program.  This position is focused on providing an immediate response and ongoing support for victims of sexual assault, and comprehensive education and training for the NSA at large on sexual assault awareness, prevention, and response.",
    "fullDescription": "Occupational Health and Well-Being Services (OHWB), Advocacy Services is seeking the ideal candidate to serve as a Sexual Assault Response Coordinator (SARC) within the NSA Sexual Assault Prevention and Response (SAPR) Program.  This position is focused on providing an immediate response and ongoing support for victims of sexual assault, and comprehensive education and training for the NSA at large on sexual assault awareness, prevention, and response.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "D",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-14T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Medicl and Occupatnal Hlth",
    "jobFamilyId": "100100",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-31T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Occupational Health and Well-Being Services (OHWB), Advocacy Services is seeking the ideal candidate to serve as a Sexual Assault Response Coordinator (SARC) within the NSA Sexual Assault Prevention and Response (SAPR) Program.  This position is focused on providing an immediate response and ongoing support for victims of sexual assault, and comprehensive education and training for the NSA at large on sexual assault awareness, prevention, and response.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nA degree in any field is acceptable.\n\nRelevant experience must include one or more of the following: work-life services, medical records, human resources, safety, industrial hygiene, or other occupational health-related environments (for example, drug deterrence, blood donor, wellness, smoking cessation, sexual assault victim advocacy). Experience must also include managing programs (any type).\n\nFULL PERFORMANCE\nEntry is with an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience.\n\nSENIOR\nEntry is with an Associate's degree plus 8 years of relevant experience, or a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "-\tDevelop and implement local policies and procedures in line with NSA and Department of Defense (DoD) directives, ensuring victim access to medical, mental health, and counseling services.\n -\tProvide 24/7 availability for victim advocacy services, ensuring coordination with medical, legal, and law enforcement personnel. Guide and support assigned Victim Advocates (VAs) for cohesive program accountability.\n -\tEnsure the prompt handling of reports, maintaining oversight throughout the process while ensuring confidentiality.\n-\tOversee Memorandums of Understanding (MOUs), Standard Operating Procedures (SOPs), and Memorandums of Agreement (MOAs) to meet victims' needs and compliance with organizational standards.\n-\tProvide immediate crisis intervention, emotional support, and safety planning for victims, guiding them through medical, investigative, and legal processes.\n-\tLead the development of training programs for SARCs, VAs, and other stakeholders. Coordinate outreach activities, including awareness programs during Sexual Assault Awareness and Prevention Month (SAAPM).\n-\tEnsure accurate and confidential data entry into the Defense Sexual Assault Incident Database (DSAID) and maintain compliance with regulatory requirements.\n-\tDevelop and implement strategic goals for the SAPR program, ensuring effective integration with installation objectives. Evaluate program effectiveness, recommending improvements for continued growth and success.\n -\tManage program budgets, ensuring alignment with goals\n-\tServe as a representative for the SAPR program in high-level engagements, advising leadership on policy implementation and programmatic objectives.\n-\tEmployee will be required to travel for TDYs or conferences relevant to sexual assault.\n-\tThis position requires a high degree of discretion in relation to sensitive information of which the incumbent is aware.\n-\tAble to serve in an \"on call\" duty status outside of normal work hours that includes remaining ready to perform work, manning enterprise cellphone, and remaining in a reasonable call back radius, staffing the 24/7 support helpline, as needed; regularly checking emails to respond to crises; and/or reporting to a designated place of duty to perform work.\n-\tEmployee may also be required to work other than normal duty hours, to include evenings, weekends, and holidays.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continuous learning and strong problem-solving who is (has):\n\n-\tNational Advocate Credentialing Program (NACP) with Intermediate or Advanced level of experience or DoD Sexual Assault Advocate Certification Program (D-SAACP) Level III or level IV Certification  \n-\tAbility to obtain and maintain DoD Sexual Assault Advocate Certification and recertification from the National Organization of Victim Assistance (NOVA), as specified by DoD.\n-\tCurrent state driver's license or the ability to obtain and maintain one.\n-\tComprehensive knowledge of a wide range of sexual assault laws, precedent decisions, policies, principles, and methods to carry out a program which fulfills these requirements.\n-\tKnowledge of DoD SAPR Policy to ensure compliance with DoD requirements.\n-\tTechnical knowledge of equal opportunity policies, sexual assault prevention and response, and skills to plan, organize, and carry out the SAPR program\n-\tAbility to plan, organize, and identify Agency problems and recommend courses of action.\n-\tSkilled in fact-finding, analysis of a wide range of programs to study broad topics related to sexual assault, problem solving and training needed assessment and skill in evaluating programs and study findings to develop policy and guidelines which will impact the Agency.\n-\tAbility to use moderate degree of discretion, independent judgment, initiative, tact and confidentiality.\n-\tSkill in oral and written communication that would assist in conveying to clients, peers, and team members issues encountered by victims, the appropriate methods and plans for managing the issues while placing clients at ease and obtaining information relating to cause of the issues.\n-\tAbility to communicate effectively, both written and verbal, with internal and external stakeholders, leaders and peers.\n-\tExcellent judgment, objectivity, and expertise in addressing employee issues and concerns\n-\tAbility to develop and effectively deliver presentations and training\n-\tAbility to collect and monitor data used to compose written reports and to assist with an end resolution\n-\tProject management skills to implement crisis intervention and situational assessment techniques, analyze the needs of the victim, and provide support and/or assistance to them in the resolution of complex problems\n-\tAbility to effectively communicate with all levels of management, staff, intervening agencies, and families from diverse racial, ethnic, religious, and socioeconomic backgrounds, both verbally and in writing\n-\tPossess strong interpersonal skills\n-\tAbility to build trust and develop supportive relationships\n-\tStrong analytical ability to intervene in crisis situations, using sound professional judgment and ethical practice",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Sexual Assault Response Coordinator (SARC) - Occupational Health Officer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $181,216 (Full Performance - Senior)\nSalary range varies by work level and relevant experience to the position.\n\nOn-the-job training, internal NSA courses, and external training will be made available based up the need and the experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and Federal retirement plan.\n\nWork Schedule: This is a full-time position, Monday - Friday with basic 8 hr/day work requirement between 6:00 a.m and 6 p.m. (flexible). \n\nCandidates should have the ability to serve in an \"on call\" duty status outside of normal work hours that includes remaining ready to perform work, manning enterprise cell phone, and remaining in a reasonable call back radius, staffing the 24/7 support helpline, as needed; regularly checking emails to respond to crises; and/or reporting to a designated place of duty to perform work.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-31T00:00:00.000Z"
  },
  {
    "_id": "67224ae9b231b421787a439a",
    "jobNumber": "1240069",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you an Engineering, Computer Science or Applied Mathematics professional who enjoys working with hardware to understand its basic operation?  Would you like to apply these skills in support of the Intelligence Community mission? NSA is seeking experienced professionals in computer design, microelectronics, radio frequency design, and systems engineering to solve emerging challenges. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "fullDescription": "Are you an Engineering, Computer Science or Applied Mathematics professional who enjoys working with hardware to understand its basic operation?  Would you like to apply these skills in support of the Intelligence Community mission? NSA is seeking experienced professionals in computer design, microelectronics, radio frequency design, and systems engineering to solve emerging challenges. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-14T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-31T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you an Engineering, Computer Science or Applied Mathematics professional who enjoys working with hardware to understand its basic operation?  Would you like to apply these skills in support of the Intelligence Community mission? NSA is seeking experienced professionals in computer design, microelectronics, radio frequency design, and systems engineering to solve emerging challenges. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nFor both HARDWARE/SOFTWARE DESIGN ENGINEER and HARDWARE/SOFTWARE ANALYSIS ENGINEER:\n\nFor engineering degrees, if program is not ABET-EAC accredited, it must include specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\n---------\n\nHARDWARE/SOFTWARE DESIGN ENGINEER\n\nDegree must be in Engineering, Computer Science, or Mathematics.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nRelevant experience must be designing, developing, or constructing electronic hardware and software processing components.\n\n-----------\n\nHARDWARE/SOFTWARE ANALYSIS ENGINEER\n\nFULL PERFORMANCE\nWith a professional Engineering, Computer Science, or Mathematics degree, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nWith a degree in either (1) Physics or Astronomy from an accredited college or university or (2) a relevant professional technical field (e.g. chemistry, architecture,  hydrology, geology), entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience. \n\nRelevant experience must be in one or more of the following: designing and verifying integrated and digital circuit devices, designing and integrating electrical and communication systems, or reverse engineering.\n\nSENIOR\nWith a professional Engineering, Computer Science, or Mathematics degree, entry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience.\n\nDegree must be in either (1) professional Engineering, (2) Physics or Astronomy from an accredited college or (3) a relevant professional technical field (e.g. chemistry, architecture, hydrology, geology).\n\nRelevant experience must be in one or more of the following:  designing and verifying integrated and digital circuit devices, designing and integrating electrical and communication systems, or reverse engineering.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "With the ever-accelerating technological advances and growing system complexity, NSA needs Hardware/Software Engineers to design, develop, construct and evaluate electronic hardware and software processing components. These components are typically subsystems of communication, collection, processing or analysis systems. \n\nHardware Software Engineers utilize electrical, computer, mechanical, and materials engineering knowledge and skills to design, assemble, test, analyze and reverse engineer electronics hardware in support of the NSA mission.\n\nThe National Security Agency (NSA) currently has opportunities for two types of Hardware/Software Engineers positions: Hardware/Software Design Engineers, and Hardware/Software Analysis Engineers. \n\n1.  HARDWARE/SOFTWARE DESIGN ENGINEERS are hired into positions supporting a broad range of specialized skills including Computer Engineering, Computer Programming, Computer Software Engineering, Electrical Engineering, and Communications Engineering. Positions will be in an office directly supporting a technical mission. \n\nThe responsibilities of a Hardware/Software Design Engineer may include: \n-  Designing, developing, testing, and/or evaluating computer or computer-related equipment. \n-  Designing, developing, testing and evaluation of programmable hardware devices or digital circuits.\n-  Programming, modifying and/or configuring system software that manages the computer hardware and provides services to the applications.\n-  Applying software engineering principles to design, develop, test, and evaluate/modify software applications.\n\n2.  HARDWARE/SOFTWARE ANALYSIS ENGINEERS are hired into positions supporting a broad range of specialized skills including Computer Science, Software Engineering, Electrical Engineering, Telecommunications Engineering and Applied Mathematics. Positions will be in an office directly supporting a technical mission.\n\nThe responsibilities of a Hardware/Software Analysis Engineer may include: \n-  Design, develop, construct, test, or analyze firmware, hardware or software components.\n-  Develop new or utilize existing methods and tools to analyze or protect specific hardware, software or firmware. \n-  Develop/recommend mitigation strategies and techniques.\n-  Develop and implement hardware forensic methodologies and applications.\n-  Test, evaluate and/or reverse engineer microelectronic components (FPGA, ASICs, PCB, Microcontrollers, etc.), technology and equipment. \n-  Program, modify and analyze system software/tools that control microelectronics hardware.\n-  Apply hardware and software engineering principles to design, develop, test, and evaluate/modify applications and systems.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Knowledge, skills, and experience in one or more of the following is desired: \n\n-  Experience with Agile Software Development. \n-  Experience in one or more of the following programming languages: C, C++, Java, Java Script, VHDL, Verilog, SystemVerilog, etc. \n-  Experience reverse engineering firmware or software.\n-  Experience in Information Assurance analysis or implementation.\n-  Experience organizing and managing their own projects or the projects of small teams.\n-  Understanding of the basic concepts of cryptography and cryptographic systems.\n-  Understanding of the basics of computer networking and low level protocols.\n-  Familiarity with basic electronic components such as ASICs, PCBs, microcontrollers, FPGAs, etc.\n-  Familiarity with electronics debugging equipment such as multi-meters and oscilloscopes. \n-  Experience with application of 2D/3D imaging for hardware analysis.\n-  Experience with embedded or operating system level programming.\n\nThe ideal candidate has a desire for continual learning along with excellent problem-solving, analytic, and interpersonal skills, who is: \n\n-  Innovative \n-  Well-organized \n-  Able to handle and prioritize multiple assignments \n-  Able to communicate effectively both orally and written \n-  Able to work effectively across several different functional areas in a collaborative environment.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Hardware/Software Design & Analysis Engineer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-31T00:00:00.000Z"
  },
  {
    "_id": "67239c80b231b42178850635",
    "jobNumber": "1230224",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "In support of the Agency as a whole, the Business Analysis group leverages financial analytic tools to facilitate data collection management, data analysis, advanced analytic studies tool development, metrics, and forecasting.  This organization provides cost/financial data and analyses to enable senior leader resource decision making.",
    "fullDescription": "In support of the Agency as a whole, the Business Analysis group leverages financial analytic tools to facilitate data collection management, data analysis, advanced analytic studies tool development, metrics, and forecasting.  This organization provides cost/financial data and analyses to enable senior leader resource decision making.",
    "grade": "12/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "B",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-07T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Bus., Accntng and Bdgt",
    "jobFamilyId": "100070",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-31T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "In support of the Agency as a whole, the Business Analysis group leverages financial analytic tools to facilitate data collection management, data analysis, advanced analytic studies tool development, metrics, and forecasting.  This organization provides cost/financial data and analyses to enable senior leader resource decision making.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in a Business Field (for example, Program Management, Business Management, Business Administration, Accounting, Finance, and Economics) or a Technical Field (for example, Engineering, Systems Management, Computer Science, and Information Technology).\n\nFULL PERFORMANCE\nEntry is with a high school diploma or GED plus 7 years of relevant experience, an Associate's degree plus 5 years of relevant experience, a Bachelor's degree plus 3 years of relevant experience, a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. \n\nRelevant experience must include one or more of the following: business, finance, computer programming, or management information systems.\n\nSENIOR \nEntry is with a high school diploma or GED plus 10 years of relevant experience, an Associate's degree plus 8 years of relevant experience, a Bachelor's degree plus 6 years of relevant experience, a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. \n\nDegree must be in a Business Field (for example, Program Management, Business Management, Business Administration, Accounting, Finance, and Economics) or a Technical Field (for example, Engineering, Systems Management, Computer Science, and Information Technology).\n\nRelevant experience must include one or more of the following: business, finance, computer programming, or management information systems. Additionally, must have formal or informal leadership experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "As a Business Technologist, you will assist management (i.e., executives, managers, business analysts, and decision makers throughout the Agency) in a wide range of operational (day-to-day) and strategic business issues and actions to support decision-making by providing data, analytical tools and evaluation techniques/methods.  Utilize state-of-the-art computer technologies to capture and model significant business processes and evaluate business practices. This work will be accomplished in coordination with teams of managers, data stewards, process partners, and customers to facilitate the delivery of the business intelligence necessary to guide the Agency toward strategic success.  Use a variety of computer software tools including, but not limited to: Data Base Management Systems (DBMS), On-Line Analytical Processing (OLAP), Data Mining, Report Generation, Data Transformation, and modeling.  Well versed in utilizing performance measurement techniques, economic analysis, data warehousing, managerial cost accounting, business modeling and financial reporting. \n\nBusiness Technologist day-to-day responsibilities include:\n-   Employing some combination (2 or more) of analysis, computer science, mathematics, and software engineering skills to devise strategies for extracting meaning and value from large datasets. \n-   Through analytic modeling, scripting, and/or programming, develop and implement qualitative and quantitative methods for characterizing large datasets in various states of organization, cleanliness and structure. \n-   Reviewing the nature and quality of cost data sources and evaluate their relevance to analyses; recommending action for improvement and use of sources.\n-   Translating practical mission needs and analytic questions related to large datasets into technical requirements and, conversely, assist others with drawing appropriate conclusions from the analysis of such data. \n-   Effectively communicate complex technical information to non-technical audiences through varied visualization and presentation methods. \n-   Design analytic tables, reports and dashboards using business intelligence tools and platforms.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continual learning and who possesses strong communication (oral and written), problem-solving, analytic, interpersonal skills and is:\n\n-   Adaptable\n-   Detail-oriented\n-   Able to manage multiple tasks with competing timelines and deliverables\n-   Adept at manipulating large data sets\n\nKnowledge and experience in the following areas is desired:\n\n-   Managing complex projects with multiple tasks and milestones \n-   Manipulating large data sets",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Business Technologist - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $99,200 - $181,216 (Full Performance - Senior)\n\nSalary range varies by work level and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-31T00:00:00.000Z"
  },
  {
    "_id": "6721009fb231b42178702dd5",
    "jobNumber": "1238784",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The Office of Inspector General (OIG) defines the oversight authority, responsibilities, and guidance regarding activities of the OIG at NSA and conducts oversight of the NSA mission. Within the OIG, the Investigations division performs thorough, independent, and accurate investigations of employees of NSA/CSS and affiliates to detect and prevent fraud, waste and abuse, and assist management effectiveness and efficiency across the entire enterprise.",
    "fullDescription": "The Office of Inspector General (OIG) defines the oversight authority, responsibilities, and guidance regarding activities of the OIG at NSA and conducts oversight of the NSA mission. Within the OIG, the Investigations division performs thorough, independent, and accurate investigations of employees of NSA/CSS and affiliates to detect and prevent fraud, waste and abuse, and assist management effectiveness and efficiency across the entire enterprise.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "2",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-08T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Law and Legal Services",
    "jobFamilyId": "100090",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-30T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The Office of Inspector General (OIG) defines the oversight authority, responsibilities, and guidance regarding activities of the OIG at NSA and conducts oversight of the NSA mission. Within the OIG, the Investigations division performs thorough, independent, and accurate investigations of employees of NSA/CSS and affiliates to detect and prevent fraud, waste and abuse, and assist management effectiveness and efficiency across the entire enterprise.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nA degree in any field is acceptable.\n\nRelevant experience must include one or more of the following: working as an investigator (for example, law enforcement, inspector general, security, or fraud), grievance examiner, reporter, analyst, or compliance officer; or in positions dealing with law, performing EEO functions (for example, analysis, training, program management, case management, or policy development), in an oversight organization (for example, Office of General Counsel, intelligence oversight), in government contracting, conducting intelligence work within the IC, or performing analysis, interviewing, or report writing.\n\nFULL PERFORMANCE \n\nEntry is with a high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. \n\n\nSENIOR \n\nEntry is with a high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience, or a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The Office of the Inspector General (OIG) has an opening for an Investigator within the Investigations division. The selectee will be responsible for conducting investigations involving allegations of violations of laws, rules, and regulations; mismanagement; gross waste of funds; abuse of authority; and substantial and specific dangers to public health and safety. The selectee will be required to document investigative results in reports of investigation (ROIs). The selectee may also be tasked to conduct investigations involving misuse of Government Resources and Information Systems. Due to the sensitive nature of OIG work, the position requires the highest standards in official and personal conduct.\n\nThe selectee will plan, conduct, and produce reports on investigations and audits. They will be responsible for researching applicable authorities, policies, and procedures, interviewing witnesses and collecting relevant documents and other evidence. The selectee will analyze data and report on investigative procedures, findings, and conclusions.\n\nPreferred experience must include working as an investigator (e.g., law enforcement, inspector general, security, or fraud), grievance examiner, reporter, analyst, compliance officer, in positions dealing with law, in positions performing EEO functions (analysis, training, program management, case management, and policy development, etc.), or in an oversight organization (Office of General Counsel, intelligence oversight). Other relevant experiences involve analysis, interviewing, and report writing.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "-\tSetting and holding self and others accountable for meeting or exceeding personal or group goals\n-\tModeling high ethical standards that demonstrate alignment with pertinent laws, regulations, and policies \n-\tPreparing accurate and complete reports that document processes, outcomes, and findings \n-\tUsing multiple investigative techniques, laws, directives and applying investigative standards, policies and procedures necessary to make competent investigative determinations\n-\tCommunicate information or ideas clearly, concisely, and professionally\n-\tResponding appropriately to the needs and feelings of different people in different situations",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Investigator - Mid to Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $181,216.  (Full Performance, Senior) \nSalary range varies by relevant experience to the position. On-the-job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nThis position is hiring for Maryland.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Thrift Savings Plan (TSP), and a Federal retirement plan. \n\nWork Schedule:  Applicants should be aware that some of these jobs support 24/7 operations based on mission requirements and shift schedules may vary. This is a full-time position, Monday through Friday (0700 to 1530) Flexible.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-30T00:00:00.000Z"
  },
  {
    "_id": "6721009fb231b42178702dd2",
    "jobNumber": "1240059",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-12T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-29T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Engineering, Computer Science, Mathematics, Physics, or a relevant professional technical field.   \n-  For Engineering degrees, the program must be ABET accredited or include specified coursework.*  \n-  For Computer Science, Mathematics, Physics, or other relevant degrees, the program must include the specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\nRelevant experience must be in the design and engineering of communication systems and/or radio frequency (RF) systems, and/or experience with test equipment.\n\nFULL PERFORMANCE\nWith a degree in Engineering, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.  With a degree in Computer Science, Mathematics, Physics, or a relevant professional technical field, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience. \n\nSENIOR\nEntry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Every day, NSA solves unique intelligence problems for scenarios not found anywhere else in the defense of our nation. Are you interested in applying your knowledge to cutting-edge technologies having far-reaching applications and global implications? Do you want the opportunity gain new skills that support fulfilling our country's most critical intelligence needs? If so, RF Engineering, a core component capability development activity within NSA, may be for you!\n\nThe communications of our foreign adversaries are accelerating and gaining in complexity. NSA's Signals Intelligence (SIGINT) and Cybersecurity missions must keep pace with advances in the high speed, multi-functional technologies of communications in order to guard against possible harm to our Nation and stay ahead of potential threats. From short wave radio to sophisticated satellites, transmissions in the RF spectrum crowd the airwaves. NSA's goal is to intercept those signals and collect the ones most likely to produce timely and valuable foreign intelligence needed by US military and national policymakers.\n\nOur highly technical RF workforce is dedicated to keeping pace with advances to address threats to our Nation and our Allies. NSA is responsible for designing, developing, building, and deploying small form factor, mobile systems as well as larger sustained systems. We also build the underlying framework to run systems for data collection and processing to meet national intelligence mission requirements.\n\nNSA is seeking talented colleagues to join world class team of analysts, engineers, researchers and developers who create RF technologies, communications, and capabilities to acquire target signals, condition them for follow-on processing, and deliver end-to-end solutions for survey, collection and emitter location and follow on analysis for advancing global advantage in both information gathering and national defense. RF Engineers work on projects using antenna and receiver design, signals analysis, digital signal processing (software defined radio), end-to-end system design, and emitter location and direction finding techniques in order to design, develop and deploy advanced survey and collection capabilities to propel our mission.\n\nAs an RF Engineer, your responsibilities can include:\n\n-  Design, build, test and deploy end-to-end RF systems, from the antenna through follow-on processors.\n-  Design, build, test and deploy communications systems using commercial off the shelf (COTS)/government off the shelf (GOTS) radios, software-defined radios (SDR) and SDR frameworks, as well as field programmable gate array (FPGA) technologies.\n-  Design, develop, construct, test and maintain hardware and software processing components; typically subsystems of communication, collection, processing or analysis systems.\n-  Conduct RF site surveys and include results in the design and performance assessments of RF systems.\n-  Work with and/or lead project teams to satisfy operational requirements for RF systems.\n-  Analyze results of RF collection in support of national mission requirements\n-  Lead new advances in RF engineering and push the leading edge of RF communications technologies:\n-  Antenna theory, design, and fabrication techniques with particular focus on beam-forming technologies - Modulation (BPSK, QPSK, spread spectrum, etc.), demodulation and signal separation techniques\n-  Low power, space and cooling environments (including embedded systems)\n-  Commercial telecommunication standards, protocols and topologies\n-  Compression and other bandwidth optimization techniques\n-  RF interference detection and mitigation approaches\n-  Active RF techniques\n-  Low probability intercept (LPI) and low probability of detection (LPD) techniques\n-  Service-oriented architectures\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with excellent problem-solving, communication, and interpersonal skills who is able to:\n\n-  Work equally well independently and in a team environment\n-  Effectively address multiple concurrent projects\n-  Synthesize information to solve complex problems\n-  Apply knowledge of communications theory to RF engineering problems\n-  Develop, diagnose, and operate survey and collection systems\n-  Identify customer needs and validate system design\n-  Operate in a fast-paced environment\n\nKnowledge and experience in one or more of the following is desired:\n\n-  Applying principles, methods, analysis, and applications of radio frequency theory such as radio wave propagation, antenna theory, antenna usage\n-  Applying principles, methods, and applications of communication theory such as signal processing, decision theory, estimation theory and modulation-demodulation\n-  Applying concepts, theories, and methods for designing, analyzing, testing, and integrating electrical and communications systems; includes aspects of energy conversion, electrical power generation, and energy transmission, control, distribution, or use\n-  Applying principles of math, physics, electronics theory, electrical network theory, and control systems to the design, fabrication, and testing of devices that are designed to operate in the radio frequency spectrum\n-  Hardware design; includes analog (A/D, amplifiers, power supplies, switches), board-level (board layout, circuit analysis, firmware), chip technologies (ASIC, CMOS, VHDL, VLSI), and digital (control logic, control systems, DSP, serial communications)\n-  Programming (e.g. Assembly Language; high level languages such as JAVA, Matlab, Python, Ruby, Shell Script; and hardware description languages VHDL, and SystemVerilog)\n-  Computer networking (e.g., communication protocols, distributed systems, Internet of Things, real-time systems, routing and switching)\n-  Lab equipment (e.g. spectrum analyzers, oscilloscopes, network analyzers, etc.)\n-  Amateur or HAM Radio clubs\n-  Open-source Wi-Fi tools",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Radio Frequency (RF) Design Engineer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-29T00:00:00.000Z"
  },
  {
    "_id": "6721009fb231b42178702dd4",
    "jobNumber": "1238794",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Do you have at least 1 year or more of experience supporting mission in the DoD or IC? Within the OIG, the Intelligence Oversight division ensures the lawful conduct of NSA/CSS intelligence-related activities by conducting evaluations of NSA/CSS organizations and programs regarding compliance with the laws, executive orders, regulations, and directives governing such activities. The Office of Inspector General (OIG) conducts independent oversight that promotes Agency respect for Constitutional rights, adherence to laws, rules, and regulations, and the wise use of public resources.",
    "fullDescription": "Do you have at least 1 year or more of experience supporting mission in the DoD or IC? Within the OIG, the Intelligence Oversight division ensures the lawful conduct of NSA/CSS intelligence-related activities by conducting evaluations of NSA/CSS organizations and programs regarding compliance with the laws, executive orders, regulations, and directives governing such activities. The Office of Inspector General (OIG) conducts independent oversight that promotes Agency respect for Constitutional rights, adherence to laws, rules, and regulations, and the wise use of public resources.",
    "grade": "13/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "2",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-08T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Law and Legal Services",
    "jobFamilyId": "100090",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-29T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Do you have at least 1 year or more of experience supporting mission in the DoD or IC? Within the OIG, the Intelligence Oversight division ensures the lawful conduct of NSA/CSS intelligence-related activities by conducting evaluations of NSA/CSS organizations and programs regarding compliance with the laws, executive orders, regulations, and directives governing such activities. The Office of Inspector General (OIG) conducts independent oversight that promotes Agency respect for Constitutional rights, adherence to laws, rules, and regulations, and the wise use of public resources.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nEntry is with an Associate's degree plus 8 years of relevant experience, or a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. \n\nDegree in any field is acceptable.\n\nRelevant experience must be in one or more of the following: an area directly related to or supporting NSA mission and/or a similar mission in the U.S. Intelligence Community (IC) or Department of Defense (DoD), information technology (for example, computer networking), or engineering. At least one year of the experience must be in the DoD or IC.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The Office of the Inspector General (OIG) at NSA conducts independent oversight that promotes wise use of public resources; adherence to laws, rules, and regulations; and respect for Constitutional rights.  The OIG also detects and deters waste, fraud, abuse, and misconduct, and promotes economy, efficiency, and effectiveness in the administration of NSA's programs and operations worldwide.\n\nAs an Evaluator assigned to the Audits and Evaluations Division located within the OIG, the selectee will play a critical role in improving Agency operations.  The selectee will serve on teams responsible for evaluating NSA's effectiveness and efficiency in program oversight and operations.  \n\nSpecific responsibilities include:\n\n-\tPlanning, leading, and/or conducting evaluations of high-risk and sensitive Agency activities.  Evaluations are schedule-driven activities that require sound project and time management skills.  Whether working independently or as part of a team, the selectee will conduct research; evaluate key processes and controls, and perform testing, as appropriate; conduct interviews; consolidate results; and present findings that require management action to address any weaknesses found.  Your recommendations, based on solid documented evidence, will positively contribute to improved confidence in mission compliance, and may serve as the basis for new or modified policies, procedures, or systems.\n\n-\tEngaging Agency professionals and reviewing technical documentation to evaluate the strength of governance practices for the Agency's infrastructure.\n\n-\tAssessing the ability of Agency programs to meet strategic goals by reviewing project data (e.g., budget, schedule, and performance).\n\n-\tUsing technical experience to analyze the Agency's IT infrastructure against security and functional standards, policy, and regulations.\n\n-\tBriefing management and teams on the status of efforts, and working with OIG teams to develop reports.\n\nThe selectee should be comfortable working in a team and must be able to communicate technically complex issues (orally and in writing).  The selectee should demonstrate process-oriented thinking, strong problem-solving skills, and a commitment to discerning the truth.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The Candidate should also have the ability to:\n\n-\tEvaluate operational performance, gather technical information, and assess hardware and software design and implementation;\n-\tConduct interviews and gather evidence within the context of the evaluation.\n-\tReport results and findings from evaluations to appropriate parties; and\n-\tConduct risk evaluations on facilities, operations, or systems.\n\nAdditionally, the ideal candidate should thrive in a dynamic and challenging mission space that requires critical thinking, creativity, strong interpersonal and problem-solving skills, and the ability to partner at all levels across organizational and Agency boundaries, often with minimal supervision and/or precedent.  The ability to effectively interact with individuals possessing diverse skill sets is also desired. \n\nAll Evaluators are required to complete at least 40 hours of annual training to maintain requisite knowledge, skills, abilities, and professional development.  The ideal candidate is someone with a desire for continuous learning who has strong problem-solving, communication (both oral and written), and interpersonal skills.  The ideal candidate should also be accountable, detail oriented, able to adapt to changing requirements, able to manage multiple tasks and assignments, and able to work effectively (independently or within teams) across functional areas in a professional and collaborative environment.  Specialized knowledge and experience in any of the following is desired:  applying auditing standards, principles, and appropriate methods when analyzing processes and evaluating internal management controls; applying techniques of interviewing, elicitation, and debriefing in a systematic manner; obtaining, evaluating, organizing, and maintaining information; and leading an audit team.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Inspector - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position. \n\nSalary ranges vary by location and work level.\n\nSalary Range: $117,962 - $181,216 \n\nOn-the job training, Internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nWork Schedule:  Applicants should be aware that some of these jobs support 24/7 operations based on mission requirements and shift schedules may vary to include night shift.  Monday- Friday with basic 8 hr/ day work requirements between 0600 and 1800 (flexible). Travel may be required.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-29T00:00:00.000Z"
  },
  {
    "_id": "670939b5b231b42178bf79b8",
    "jobNumber": "1239316",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you a computer science or computer/electrical engineering professional? Do you have strong software or hardware design, development, testing or reverse engineering skills? Do you want to be part of a team that develops ground breaking solutions? If so, click here to learn more and apply.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a degree that demonstrates a concentration of Computer Science (CS) courses in foundational CS areas.",
    "fullDescription": "Are you a computer science or computer/electrical engineering professional? Do you have strong software or hardware design, development, testing or reverse engineering skills? Do you want to be part of a team that develops ground breaking solutions? If so, click here to learn more and apply.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a degree that demonstrates a concentration of Computer Science (CS) courses in foundational CS areas.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-07T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-24T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you a computer science or computer/electrical engineering professional? Do you have strong software or hardware design, development, testing or reverse engineering skills? Do you want to be part of a team that develops ground breaking solutions? If so, click here to learn more and apply.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a degree that demonstrates a concentration of Computer Science (CS) courses in foundational CS areas.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Computer Science (CS), Mathematics, Engineering, or a related field. Degrees in Information Technology, Information Systems, Information Security, Networking (Systems Administration), Information Assurance, or Cybersecurity may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and upper-level mathematics (for example, calculus, discrete mathematics).\n\nRelevant experience must be in one or more of the following: engineering hardware or software over their lifecycle (i.e., requirements analysis, design, development, implementation, testing, integration, deployment/installation, and maintenance), programming, vulnerability analysis, penetration testing, computer forensics, or systems engineering. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Are you driven by a passion to work at the cutting edge of technology? Do you dream to make the impossible possible?  The National Security Agency is seeking highly motivated Computer Science and Computer/Electrical Engineering professionals to drive its mission to develop new capabilities, design new approaches, help solve complex problems, and research new solutions to propel our mission.\n\nAs a Capabilities Development Specialist (CDS), your job will be to develop custom high-priority offensive and defensive capabilities targeting the hardest-to-reach adversarial networks in the world. In defense of our Nation, we conduct innovative research and produce hardware and software tools unlike anything in the world. By joining our team, you will apply and grow your expertise to create new ways to get critical information to our national decision makers. Whether it is in software, hardware, or cutting-edge research, if you are up for a challenge, have unbridled curiosity, and a drive to develop tomorrow's technologies and tools today, apply to join our team. Use your unique experiences and expertise to protect national security interests as part of the world's most advanced team of computer science and engineering professionals!\n\n\nIf you have interests, skills, or experience in one or more of the following areas, we'd like to hear from you:\n\n- Software Specialties: Strong software development skills (C, C++, Assembly, ARM); Software RE/interactive debugging tools (e.g., Ghidra, OllyDbg, gdb); Software application vulnerability analysis and exploitation; Operating system internals; Mobile platform development and analysis; algorithmic analysis; prototyping.\n\n- Malware Reverse Engineer: Perform advanced malware analysis/reverse engineering of specialized malware/complex files.  CISSP, CEH, GREM, GPEN certifications are a plus.\n\n- Hardware Specialties: - Hardware RE, design, development, or testing (Verilog, VHDL, FPGA, PCB); Testing and debugging tools (JTAG, Oscilloscopes, etc.);\n\nJob roles may include:\n\n- Developing exploitation capabilities and analytics to enable foreign target network collection \n- Designing hardware components and systems to further signals intelligence missions\n- Analyzing sophisticated malware\n\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a degree that demonstrates a concentration of Computer Science (CS) courses in foundational CS areas.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "We're looking for someone with knowledge, skills, and experience in one or more of the following:\n\n- Programming in languages such as C, C++, and Java, especially in kernel development and device driver development, network/socket programming, and embedded systems development\n- Advanced malware analysis/reverse engineering skills for specialized malware/complex files.  CISSP, CEH, GREM, GPEN certifications are a plus\n- Assembly language(s)\n- Hardware design (e.g., FPGA, VHDL, Verilog, PCB)\n- Hardware Reverse Engineering\n- RF system design (e.g., DSP, SDR)\n- Embedded systems development\n- Software reverse engineering/interactive debugging tools (e.g., Ghidra, OllyDbg, gdb)\n- Hardware analysis tools (e.g., JTAG, Oscilloscopes)\n- Software vulnerability analysis and exploitation",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Engineer/Developer - Software, Hardware, Research (Capabilities Development Specialist) - Mid to Experienced Level (Colorado)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Denver, CO",
    "locationArea": "169",
    "locationFull": "Denver/Aurora, CO",
    "locationSpecificId": "L169",
    "postedDate": "2024-10-24T00:00:00.000Z"
  },
  {
    "_id": "6717c03cb231b421782ae34e",
    "jobNumber": "1239564",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is growing by leaps and bounds and is in need of skilled/experienced Facilities and Logistics professionals.",
    "fullDescription": "NSA is growing by leaps and bounds and is in need of skilled/experienced Facilities and Logistics professionals.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "T",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-06T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Infrastructure and Logistics",
    "jobFamilyId": "100160",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-23T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is growing by leaps and bounds and is in need of skilled/experienced Facilities and Logistics professionals.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nEntry is with a high school diploma or GED plus 7 years of relevant experience, or vocational/technical training in a relevant field plus 6 years of relevant experience, or an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience, or Master's degree plus 1 year of relevant experience, or a Journeyman license in a relevant field plus 1 additional year of relevant experience. \n \nIf qualifying with a degree, degree must be in Architecture, Interior Design, Electrical, Mechanical or a related field (for example, Construction Management and Space Planning) or a Business related field (for example, Economics, Marketing, Accounting, Business Administration, and Finance). \n\nRelevant experience must include two or more of the following: trades/facilities operations; facilities system integration/interaction; review of facilities information to determine design solutions; construction; hospitality; development of cost estimating and projections, scope of work and project schedule in a related facilities or trade environment. Certification in a relevant field (for example, electrical, mechanical, interior) may count for up to one year of experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA is hiring for both General Facility Services Officers (FSO) and Facility Services Officers with specialization in Mechanical and Electrical Systems.\n\nFSOs are responsible for oversight of the operation, maintenance, repair, modification, design, construction, and inspection of Agency facilities. Specific responsibilities vary based upon areas of expertise. \n\n1)  General Facility Services Officers:\nGeneral Facility Services Officers who are proficient in the Computerized Maintenance Management System (CMMS) within the IBM Maximo application suite will gather requirements, analyze current processes and industry best practices, and collaborate for successful CMMS implementations. Other General Facility Officers will determine budget and project funding requirements for physical infrastructure, utilities, roadways, and surrounding grounds and oversees the work in those areas performed by a variety of trades, labor employees, and/or contractors.  Develop or review options available for the provision of facilities services and interprets available policies and regulations to select the most appropriate option, or to develop a unique solution.  Conduct site inspections and evaluations to validate modification requests and to determine the means and methods to fulfill the requests.  Prepare building designs and coordinate the utilization of buildings, utilities, and storage operations (e.g., determine the location of furniture, equipment, and hazardous materials).  Work involves ensuring that facility and associated utility systems are designed, constructed, operated, and maintained in a manner that is consistent with all compliance, certification, and safety standards.\n\n2)  Facility Services Officers (Mechanical & Electrical Systems): \nAssigned to the 24/7 Facilities Watch Team, monitor and operate the Chilled Water and Electrical distribution systems at the NSA complex. Responsible for monitoring the condition of all other facilities systems during scheduled and unscheduled outages, construction projects, and activities that place the facility in an abnormal condition. Key component services provided to assure \treliable operations: \n\n- Coordinate all utility outages with other maintenance customers and mission support elements.\n- Ensure that timely notification of facility emergencies are made to all personnel that are impacted.\n- Prepare and review daily logs and alarm summaries to ensure that follow-up actions are taken. \n- Provide shift coverage to maintain the recommended staffing levels needed to operate the campus systems and provide emergency response to facility emergencies. \n- Supervise Campus Utility outages when needed and assist with shutdown sequences and outage coordination. \n- Review day to day operations of the Chilled Water and Electrical distribution systems and coordinate plant changes with Building Maintenance & Operations personnel.\n- Provide accurate monitoring and control of the Agency's HVAC and Chilled Water Distribution systems through the Agency's Energy Management and Control Systems (EMCS). \n- Provide accurate monitoring and control of the Agency's Electrical Distribution systems through the Agency's Supervisory Control and Data Acquisition (SCADA) System. \n- Operations of the Chilled Water and Electrical distribution systems and coordinate plant changes with Building Maintenance & Operations personnel.\n- Provide accurate monitoring and control of the Agency's HVAC and Chilled Water Distribution systems through the Agency's Energy Management and Control Systems (EMCS). \n- Provide accurate monitoring and control of the Agency's Electrical Distribution systems through the Agency's Supervisory Control and Data Acquisition (SCADA) System. \n- Initiate daily plant status reports and make operator log entries to reflect the health and welfare of the systems.\n- Maintain Operator logs to reflect any plant reconfigurations, responses to problem areas by tour persons, as well as any impact to Chilled Water distribution, Electrical distribution and Fire alarm operations. \n- Conduct routine virtual Mechanical and Electrical Systems Tours to inspect and monitor maintenance activities to assure availability of systems are not interrupted. \n- Respond and/or dispatch facility personnel to emergencies and routine service calls as needed.\n- Take necessary actions to control or repair the problems and provide follow up details for Watch logs.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate demonstrates the following:\n- Problem Solving\n- Interpersonal Skills\n- Partnering\n- Customer Service\n- Accountability\n- Continual Learning\n- Resilience\n- Effective Communication\n\nPreferred Qualifications for General FSOs:\n- IBM Maximo Application Suite (Computerized Maintenance Management System)\n- Audits/Inspections\n- Building & Construction\n- Facilities Maintenance & Operations\n- Electrical & Mechanical Infrastructure\n\nPreferred Qualifications for FSO (Mechanical & Electrical Systems Operator) - \nKnowledge and experience in one or more of the following is desired: \n- Building Automation System (BAS) operation\n- Mechanical system operation \n- Fire Alarm Systems\n- Chilled water Systems\n- Electrical systems\n- SCADA system operation\n- Construction technology/management\n- Leading project teams\n- Contract mechanisms\n- Analysis and life-cycle maintenance of installations and facilities\n- Analysis, design, construction, national/local code compliance\n- Design safety plans and programs to comply with laws, regulations, and policies",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Facility Services Officer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $128,956 \nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-23T00:00:00.000Z"
  },
  {
    "_id": "671911a8b231b4217834c466",
    "jobNumber": "1239639",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Candidate will develop and implement both short-term and long-term strategic plans and operational concepts contributing to National Security/Emergency Preparedness, \nThis position will require operational and/or training deployments to include nights, holidays and weekends; both short term and potentially extended. Travel is required, often without sufficient notification. Employee may be subject to 24-hour on-call duty. In an emergency, this service may require irregular working hours, work at locations other than the official duty station, and may include duties other than those specified in the incumbent's official position description. Employee must be able to relocate to emergency sites with little advance notice and function under increased mental and physical stress. Employee must physically be able to move and assemble equipment relating to communications and operations centers.\n\nThe incumbent is designated as an Essential Employee for purposes of weather-related events or other short term, isolated emergencies.\n\nThis position requires a TOP SECRET clearance and SPECIAL BACKGROUND INVESTIGATION (SBI). Subject to random drug testing. Subject to random polygraph testing.",
    "fullDescription": "Candidate will develop and implement both short-term and long-term strategic plans and operational concepts contributing to National Security/Emergency Preparedness, \nThis position will require operational and/or training deployments to include nights, holidays and weekends; both short term and potentially extended. Travel is required, often without sufficient notification. Employee may be subject to 24-hour on-call duty. In an emergency, this service may require irregular working hours, work at locations other than the official duty station, and may include duties other than those specified in the incumbent's official position description. Employee must be able to relocate to emergency sites with little advance notice and function under increased mental and physical stress. Employee must physically be able to move and assemble equipment relating to communications and operations centers.\n\nThe incumbent is designated as an Essential Employee for purposes of weather-related events or other short term, isolated emergencies.\n\nThis position requires a TOP SECRET clearance and SPECIAL BACKGROUND INVESTIGATION (SBI). Subject to random drug testing. Subject to random polygraph testing.",
    "grade": "01/0 to 01/0",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "G",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-20T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900002",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements. It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process. Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position.\n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications. **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov. \n\nU.S. Citizenship is required for all applicants. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564.  Employment is contingent upon successful completion of a security background investigation and polygraph.  Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate. Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.\n\nFor current DISLs, you must submit a copy of your most recent SF-50 in addition to your resume. For all non-DISL applicants, in addition to your resume, you must submit a 3-page document (no less than 11-point font, 1-inch margins) showing evidence that you meet the Technical Qualifications described in this Posting. Failure to submit either an SF-50 or your 3-page Technical Qualification write-up will disqualify you from consideration.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-23T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "SL",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Candidate will develop and implement both short-term and long-term strategic plans and operational concepts contributing to National Security/Emergency Preparedness, \nThis position will require operational and/or training deployments to include nights, holidays and weekends; both short term and potentially extended. Travel is required, often without sufficient notification. Employee may be subject to 24-hour on-call duty. In an emergency, this service may require irregular working hours, work at locations other than the official duty station, and may include duties other than those specified in the incumbent's official position description. Employee must be able to relocate to emergency sites with little advance notice and function under increased mental and physical stress. Employee must physically be able to move and assemble equipment relating to communications and operations centers.\n\nThe incumbent is designated as an Essential Employee for purposes of weather-related events or other short term, isolated emergencies.\n\nThis position requires a TOP SECRET clearance and SPECIAL BACKGROUND INVESTIGATION (SBI). Subject to random drug testing. Subject to random polygraph testing.",
    "jobQualifications": null,
    "jobQualificationsExt": "Must be a U.S. Citizen; background investigation is required. Top Secret with Special Background Investigation\n\nQualifications Required:\n-\tOne or more professional certifications, such as a Certified Board Continuity Professional (CBCP), Certified Information Systems Security Professional (CISSP); Program Management Professional (PMP), etc.\n\nEDUCATION:\n\nEntry is with a Bachelor's degree plus 15 years of relevant experience, or a Master's degree plus 5 year's experience.\nDegree must be in a technical field (computer science, information technology, information systems management, etc.)\n\n\nFor Non-DISL applicants:\n\nThe applicant selected must meet all the Technical Qualifications (TQ) listed below. Applicants should provide a brief narrative (no more than one-half page) to support each TQ. In addition, each applicant must submit a resume.\n\nHow You Will Be Evaluated:\n\nThe applicant selected must meet all the Technical Qualifications (TQ) listed below.  Applicants should provide a brief narrative (no more than one-half page) to support each TQ.  In addition, each applicant must submit a resume.  \n\nTQ 1: Professional Achievements \nSpecific Technical/Professional Achievement focuses on personal technical achievement which demonstrates innovative research and/or breakthrough successes. While achievement may take the form of participation in group efforts, the candidate under review should be distinguished from the accomplishments of the team as a whole and evaluated in terms of the impact of individual skills and knowledge on the team effort.\nCompetencies: \n- Expertise and Depth - Demonstrates recognized expertise and depth and/or breadth in the aspirant's field. Consistently demonstrates specific technical achievements and accomplishments (i.e. developed techniques and methods, inventions, or legal, fiscal, and/or other major contributions) that evidence mission impact that can be directly tied to an articulated mission need. \n- Problem Solving - Identifies and solves critical and/or sensitive problems by finding opportunities for improvement and addressing them through practical, sustainable responses resulting in significant Agency and/or IC-wide impact. Adapts to changing situations/priorities by modifying plans, programs and/or policies as appropriate, positively affecting major organizations and/or customers/stakeholders and/or redirecting activities towards new strategic thrusts.\n- Flexibility - Is open to change and new information; rapidly adapts to new information, changing conditions, or unexpected obstacles. \n- Innovative Research - Demonstrates innovative research and/or breakthrough successes by applying knowledge of the scientific principles, methods and processes used; develops new insights into situations; questions conventional approaches; encourages new ideas and innovations; designs and implements new or cutting-edge programs/processes.\n- Applied Expertise to Multiple Domains -Demonstrates understanding of various disciplines and concepts; utilizes that knowledge to approach increasingly complex problems from multiple directions\n\nTQ 2: Technical/Professional Development of Others\nTechnical/Professional Development of Others focuses on the transfer of skills to others, especially to the next generation of experts. Covered in this category are not only concrete skills and knowledge, but such intangibles as how to approach problems, how to balance risk against the chance of success, factors in building problem-solving teams, how to communicate effectively, and the like. Developing skills in others can be accomplished in a multitude of ways beyond mentoring, including but not limited to, building curriculum, teaching, or transferring knowledge through papers and talks.\nCompetencies: \n- Developing Others - Establishes mentoring relationships with one or more individuals by providing guidance, direction, and advice through formal or informal mentoring. Ensures their skills are transferred to others in support of the development of the next generation of experts in their domain. Actively supports hiring, promotion processes, retention and other agency wide initiatives to support building and sustaining an expert workforce. \n- Leveraging Diversity - Fosters a diverse, equitable, and inclusive workplace where individual differences are valued and leveraged in support of a culture that promotes collaboration and productivity to achieve the vision and mission of the organization. Contributes to a culture that promotes collaboration and productivity. \n- Participation in the Community - Leads and influences boards, committees, panels, etc. of significance to the growth of a technical community of significance to NSA; actively participates in efforts aimed at conveying knowledge, such as seminars and conferences, teaching at the NCS, conducting on-the-job training, etc.\n- Ability to Communicate - Demonstrates executive level writing and oral communication skills; demonstrates effective listening and grounds communication in language and framing that exhibits understanding of the audience and allows the relaying of complex topics.. \n\nTQ 3: Technical/Professional Leadership/Decision Making \nTechnical/Professional Decision Making focuses on the extent to which the employee is developing as a technical leader. At the highest levels this leadership should be unquestioned. In this area also fall such intangible components of leadership as perseverance and dependability\nCompetencies: \n- Standing in Field - Demonstrates experience as a strong and credible technical leader. Provides high-impact expert advice to top management, peers and/or customers, partners or national leaders.\n- Ability to Influence - Provides high-impact expert advice to top management, peers and/or customers, partners or national leaders. Persuades others; builds consensus through give and take; gains cooperation from others to obtain information; displays persistence to find solutions and accomplish goals. Communicates confidently and skillfully with internal and external audiences.\n- Role in Decision Making - Makes sound and timely decisions to carry out ideas, develop systems or execute programs.\n\nTQ 4: Continued Technical/Professional Development\nContinued Technical/Professional Development focuses on the continuous enhancement of technical/professional skills and knowledge. Formal training, \"stretch\" assignments, research and writing projects, interaction with other experts, and other activities appropriate to the particular discipline should be evaluated as part of the appraisal process.\nCompetencies: \n- Complexity - Seeks opportunities to increase understanding of complex and highly technical subjects, including participating in specific areas to deepen area of expertise. \n- Broadening of Vision - Acquires expertise in other disciplines, leading to additional opportunities and impacts. Examines biases and seeks insights to avoid stereotypical responses and behavior.\n- Ongoing Education - Demonstrates continual learning through formal training, 'stretch' assignments, research and writing projects, interaction with other experts, and other activities appropriate to the particular discipline.\n\nTQ 5: LEADING THE INTELLIGENCE ENTERPRISE \nThis core qualification is comprised of the Intelligence Community (IC)-specific \"joint\" competencies of Collaboration and Integration, Enterprise Focus, and Value-Centered Leadership. \nCompetencies: \n- Collaboration and Integration - Share information and knowledge to achieve results by creating an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. \n- Enterprise Focus - Demonstrate a deep understanding of how the mission, structures, leaders, and cultures of the various DoD and IC components interact and connect. \n- Value-Centered Leadership - Advance and reinforce DoD and IC core values: A Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties; the integrity and Courage (moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk; and Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The Chief, Communications & IT Division oversees and directs activities for one of five major organizational elements of the TF. The role is a blend of traditional Chief Information Officer and Chief Technology Officer functions supporting unique and customized TF requirements. The incumbent is responsible for the program management of a highly complex network and involves application of advanced state-of-the-art technology.\n\nAdditionally, the Chief is responsible for:\n-\tProviding guidance to TF and partner Information Technology (IT) managers and staff involved in the design, development, implementation, modification, maintenance and integration of intra-and inter- agency systems;\n\n-\tResearching, proposing, and implementing complex communications infrastructure (such as emerging satellite communications systems, cellular transport, voice, video, and data networks) to meet stakeholder requirements while ensuring continuity of communications regardless of the interruption;\n\n- Directing the strategy for planning, architecture, design and configuration management of all TF hardware, software, database management systems, telecommunications, data and local area network, and related equipment and approves methodologies and configurations changes to infrastructure;\n\n-\tEffectively supporting, developing and managing a workforce that is capable of anticipating and responding to stakeholder requirements;\n\t\n\t\n-\tServing as principal advisor to senior-level program stakeholders for areas assigned;\n\n-\tManaging the division's budget and workload, establishing performance requirements for subordinate staff and ensuring appropriate performance standards are applied; ensuring accountability and transparency in financial planning, decision-making and reporting, and ensuring sound investment of government financial resources and integrity of the Federal contracting process;\n\n-\tDemonstrating the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Establishes and implements an organizational vision in a continuously changing environment;\n\n-\tProviding executive leadership and direction in concert with the TF leadership and stakeholders for mission assurance, critical infrastructure protection, cybersecurity, risk management, emergency preparedness, and records management programs;\n\n-\tDetermining the optimal organizational structure and utilization of resources to accomplish mission and objectives in an efficient, economical, and effective manner;\n\n-\tLeading a team of System Engineers, Emergency Management, Information Technology, and Cybersecurity Professionals toward meeting the organization's vision, mission and goals; \n\n-\tLeading the preparation and delivery of communications and briefings of senior stakeholders, as well as all internal and external customers and partners of the TF. Interfacing with customers and representing the TF Director at meetings, briefings, conferences, etc. Establishing and maintaining partnerships with key customers and stakeholders;\n\n-\tDirecting the implementation of approved plans. Tasking organizations and/or contractors to carry out technology initiatives. Evaluating technical progress to assess performance, conducting risk assessments, and coordinating technical modifications to accommodate requirements.\n\n-\tLeading efforts to fully understand and meet stakeholder needs and requirements in the areas of risk mitigation and response readiness;\n\n-\tPerforming other duties as assigned.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Senior Technical Leader/ Chief, Communications and IT Division",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay, Benefits, & Work Schedule\n\nPay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: DISL Tier 1 - $191,900 - $204,000\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule: This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).\n\nTravel may be required.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Washington DC, DC",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-23T00:00:00.000Z"
  },
  {
    "_id": "670939b5b231b42178bf79b7",
    "jobNumber": "1239314",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you a computer science or computer/electrical engineering professional? Do you have strong software or hardware design, development, testing or reverse engineering skills? Do you want to be part of a team that develops ground breaking solutions? If so, click here to learn more and apply.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a degree that demonstrates a concentration of Computer Science (CS) courses in foundational CS areas.",
    "fullDescription": "Are you a computer science or computer/electrical engineering professional? Do you have strong software or hardware design, development, testing or reverse engineering skills? Do you want to be part of a team that develops ground breaking solutions? If so, click here to learn more and apply.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a degree that demonstrates a concentration of Computer Science (CS) courses in foundational CS areas.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-05T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-22T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you a computer science or computer/electrical engineering professional? Do you have strong software or hardware design, development, testing or reverse engineering skills? Do you want to be part of a team that develops ground breaking solutions? If so, click here to learn more and apply.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a degree that demonstrates a concentration of Computer Science (CS) courses in foundational CS areas.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Computer Science (CS), Mathematics, Engineering, or a related field. Degrees in Information Technology, Information Systems, Information Security, Networking (Systems Administration), Information Assurance, or Cybersecurity may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and upper-level mathematics (for example, calculus, discrete mathematics).\n\nRelevant experience must be in one or more of the following: engineering hardware or software over their lifecycle (i.e., requirements analysis, design, development, implementation, testing, integration, deployment/installation, and maintenance), programming, vulnerability analysis, penetration testing, computer forensics, or systems engineering. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Are you driven by a passion to work at the cutting edge of technology? Do you dream to make the impossible possible?  The National Security Agency is seeking highly motivated Computer Science and Computer/Electrical Engineering professionals to drive its mission to develop new capabilities, design new approaches, help solve complex problems, and research new solutions to propel our mission.\n\nAs a Capabilities Development Specialist (CDS), your job will be to develop custom high-priority offensive and defensive capabilities targeting the hardest-to-reach adversarial networks in the world. In defense of our Nation, we conduct innovative research and produce hardware and software tools unlike anything in the world. By joining our team, you will apply and grow your expertise to create new ways to get critical information to our national decision makers. Whether it is in software, hardware, or cutting-edge research, if you are up for a challenge, have unbridled curiosity, and a drive to develop tomorrow's technologies and tools today, apply to join our team. Use your unique experiences and expertise to protect national security interests as part of the world's most advanced team of computer science and engineering professionals!\n\n\nIf you have interests, skills, or experience in one or more of the following areas, we'd like to hear from you:\n\n- Software Specialties: Strong software development skills (C, C++, Assembly, ARM); Software RE/interactive debugging tools (e.g., Ghidra, OllyDbg, gdb); Software application vulnerability analysis and exploitation; Operating system internals; Mobile platform development and analysis; algorithmic analysis; prototyping.\n\n- Malware Reverse Engineer: Perform advanced malware analysis/reverse engineering of specialized malware/complex files.  CISSP, CEH, GREM, GPEN certifications are a plus.\n\n- Hardware Specialties: - Hardware RE, design, development, or testing (Verilog, VHDL, FPGA, PCB); Testing and debugging tools (JTAG, Oscilloscopes, etc.);\n\nJob roles may include:\n\n- Developing exploitation capabilities and analytics to enable foreign target network collection \n- Designing hardware components and systems to further signals intelligence missions\n- Analyzing sophisticated malware\n\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.  Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical since the minimum qualifications for this position require a degree that demonstrates a concentration of Computer Science (CS) courses in foundational CS areas.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "We're looking for someone with knowledge, skills, and experience in one or more of the following:\n\n- Programming in languages such as C, C++, and Java, especially in kernel development and device driver development, network/socket programming, and embedded systems development\n- Advanced malware analysis/reverse engineering skills for specialized malware/complex files.  CISSP, CEH, GREM, GPEN certifications are a plus\n- Assembly language(s)\n- Hardware design (e.g., FPGA, VHDL, Verilog, PCB)\n- Hardware Reverse Engineering\n- RF system design (e.g., DSP, SDR)\n- Embedded systems development\n- Software reverse engineering/interactive debugging tools (e.g., Ghidra, OllyDbg, gdb)\n- Hardware analysis tools (e.g., JTAG, Oscilloscopes)\n- Software vulnerability analysis and exploitation",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Engineer/Developer - Software, Hardware, Research (Capabilities Development Specialist) - Mid Level (Texas)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "San Antonio, TX",
    "locationArea": "498",
    "locationFull": "NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L498",
    "postedDate": "2024-10-22T00:00:00.000Z"
  },
  {
    "_id": "67166fb2b231b4217820e6e6",
    "jobNumber": "1239017",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The Office of Inspector General (OIG) defines the oversight authority, responsibilities, and guidance regarding activities of the OIG at NSA and conducts oversight of the NSA mission.  Within the OIG, the Audit branch performs independent audits and related reviews of Agency programs and operations in accordance with government auditing standards, designed to ensure compliance with applicable laws, regulations, and standards and to improve the Agency's efficiency and effectiveness.",
    "fullDescription": "The Office of Inspector General (OIG) defines the oversight authority, responsibilities, and guidance regarding activities of the OIG at NSA and conducts oversight of the NSA mission.  Within the OIG, the Audit branch performs independent audits and related reviews of Agency programs and operations in accordance with government auditing standards, designed to ensure compliance with applicable laws, regulations, and standards and to improve the Agency's efficiency and effectiveness.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "2",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-08T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Law and Legal Services",
    "jobFamilyId": "100090",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-18T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The Office of Inspector General (OIG) defines the oversight authority, responsibilities, and guidance regarding activities of the OIG at NSA and conducts oversight of the NSA mission.  Within the OIG, the Audit branch performs independent audits and related reviews of Agency programs and operations in accordance with government auditing standards, designed to ensure compliance with applicable laws, regulations, and standards and to improve the Agency's efficiency and effectiveness.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed below are the minimum acceptable to be considered for the position.\n\nEntry is with an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. \n\nDegree must be in Business, Accounting, Information Technology, or a related field (for example, Finance, Economics, Management, Computer Science). \n\nRelevant experience must include one or more of the following: auditing (for example, operational, Information Technology, financial, performance) in the public or private sector, Information Technology systems security, or Information Technology policy.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The Office of the Inspector General (OIG) at NSA conducts independent oversight that promotes wise use of public resources; adherence to laws, rules, and regulations; and respect for Constitutional rights.  The OIG also detects and deters waste, fraud, abuse, and misconduct, and promotes economy, efficiency, and effectiveness in the administration of NSA's programs and operations worldwide. The OIG conducts independent audits and related reviews of NSA/CSS programs and operations in accordance with government auditing standards, designed to assess compliance with applicable laws, regulations, and standards and to improve the NSA/CSS's efficiency and effectiveness. Audits include, but are not limited to, NSA/CSS program performance, financial records and statements, information technology, and cybersecurity.\n\nAs an auditor, you independently perform the full range of assigned non-supervisory duties.  Employees complete required entry-level training or developmental activities, either within the employing organization or prior to joining the organization. \n\nApplicant duties may include:\n\n-\tResearching applicable laws, directives, regulations, manuals, prior studies, and audit reports to gain knowledge and understanding of areas being audited. \n-\tPreparing audit steps for assigned segments of audit guide to meet specified audit objectives. \n-\tAssisting senior auditors in conducting entrance and exit conferences with audit stakeholders to explain audit objectives and conclusions. \n-\tHolding discussions with audit stakeholders to explain audit objectives and audit results and to obtain positions on audit conclusions and supporting data. \n-\tIndependently executing segments of an audit guide or other related audit segments as directed by the Auditor-in-Charge. \n-\tConducting technical testing as necessary to identify potential threats and vulnerabilities. \n-\tIndependently preparing, organizing, and completing comprehensive workpaper files that include complete summaries of evidentiary data to support audit conclusions relevant to audit objectives. \n-\tPreparing outline of potential audit findings to include condition, cause, effect, criteria, and recommendations relevant to audit objectives. \n-\tAssisting the Auditor-in-Charge in writing segments of draft and final reports and developing findings and recommendations. \n-\tMaintaining security and accountability of classified information. \n\nApplicant demonstrates excellent verbal and written communication skills as well as critical thinking skills. Applicant has the ability to apply government auditing standards, discern key issues, and draw appropriate conclusions.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "-Conduct interviews within the context of an inspection, audit, evaluation, or investigation.\n-Gather evidence or information related to on-going audits, inspections, evaluations, or investigations.\n-Perform audits, inspections, evaluations, or investigations in accordance with applicable regulations and/or policies, and make appropriate recommendations for improvement.\n-Report results and findings from assessments, investigations, inspections, audits, or evaluations to appropriate parties.\n-Conduct risk assessments on affiliates, facilities, operations, programs, or systems.\n-Enforce federal and state laws and applicable regulations and/or policies.\n-Conduct assessments of acquisitions (including IT acquisitions) to mitigate risk (for example, foreign influence, fraud, waste, abuse).\n-Conduct evaluations or audits of programs to assess program effectiveness or remediate deficiencies.\n\nEmployees should possess a full understanding of the technical or specialty field;  independently handle situations or assignments with minimal day-to-day instruction or supervision, and receive general guidance and direction on new projects or assignments.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Auditor - Mid Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $128,956\n\nSalary range varies by work level and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-18T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ae",
    "jobNumber": "1235239",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "fullDescription": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "grade": "03/1 to 07/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "P",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-10T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: To be considered for our Co-op positions, you must submit a COMPLETE application package by 31 October. Your application package must include: \n\n1. Unofficial transcript with a traditional grading scale (GPA)\n2. PDF copy of your current resume\nIf your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcripts to CoopHiring@uwe.nsa.gov as an attachment.  Please do not send HTML transcripts accessible via a website or text versions thereof. \n\nDEADLINE: Applications are accepted 1 September - 31 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "jobQualifications": null,
    "jobQualificationsExt": "Only applicants that meet the following qualifications will be considered:\n  \n'\tMust be a U.S. Citizen\n'\tMust be pursuing the following majors: Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track), Data Science, or Mathematics. \n'\tMust be a second semester college freshman or a college sophomore\n'\tPreferred cumulative GPA of 3.0 or higher for all college work completed\n'\tMust be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n'\tMust be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and March 2025",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA's Cooperative Education (Co-op) Program at Fort Meade, MD offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure. These Co-op opportunities are open to students who are majoring in Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track), Data Science, or Mathematics. Right from the start, you will be involved in real life projects and will have full use of NSA labs, equipment, and advanced technologies. These areas will offer you increasing challenges and satisfying learning experiences, since our mission demands that we work on the cutting edge of technology. The full listing of each Co-op description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.\n\nProgram Details: \n'\t52 weeks of alternating semesters of school and work at NSA \n'\tSubsidized student housing and travel entitlements during work tours if over 75 miles from Fort Meade, MD \n'\tTuition reimbursement for one technical course per semester (up to $2,500)\n'\tAlthough not guaranteed, potential full time employment following successful completion of the program\n\n***PLEASE NOTE:  As this program requires students to rotate between semesters of work and study, applicants are encouraged to discuss the possibility of participating in this type of program with their school (Academic Advisor, Co-Op Advisor, Registrar and/or Financial Aid Office, etc.) to determine the effect it may have on their full time student status during scheduled work tours as well as any effects it may have on scholarships and financial aid.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cooperative Education Program (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salaries are determined by the percentage of credits completed toward a degree. Each 20% block of credits completed with at least a 3.0 GPA will allow you to be promoted to the next grade. Grades range from GGD-03/05 to GGD-07/01, which equates to $40,739-$55,924 annually. Due to the rotational nature of the Co-op program, students are paid proportionate to the number of weeks worked in a year and are authorized Leave without Pay during scheduled school rotations. The salaries aforementioned include a locality based comparability payment.\n\nStudents will receive annual leave, sick leave and paid federal holidays.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  }
]
