[
  {
    "_id": "66df0e08b231b42178598d29",
    "jobNumber": "1237591",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "fullDescription": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "grade": "04/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "R",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the `Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the `Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.\n\n***PLEASE NOTE: To be considered for our Summer Internships, you must submit a COMPLETE application package by 1 October for all Summer Internship Programs. Your application package MUST include:\n\n1. Official transcript (unofficial will be accepted if legible) - file name = LAST_FIRST_TRANSCRIPT\n2. At least 1 letter of recommendation from a faculty member or supervisor who can speak directly to your educational background - file name = LAST_FIRST_LOR\n3. PDF copy of your current resume - file name = LAST_FIRST_RESUME\nOptional: Cover Letter listing your interest in NSA's Summer Internships - file name = LAST_FIRST_COVER\n\nIMPORTANT: Your application is not considered complete until the 3 items listed above have been emailed to SummerInterns@uwe.nsa.gov in addition to your online application.  Any incomplete package will NOT be considered.\n\nREMINDER: You could be contacted and/or considered for more than one specific internship.\n\nDEADLINE: Applications are accepted 1 September - 1 October; however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nCONTACT INFORMATION: If you have any questions about NSA Summer Internships, please contact us at SummerInterns@uwe.nsa.gov or call us at 410-854-4726.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-06T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "jobQualifications": null,
    "jobQualificationsExt": "To be accepted into a NSA Summer Internship - candidates must:\n\n- Must be a U.S. Citizen\n- Must be enrolled in a degree-seeking program (undergraduate, graduate, doctorate) at time of application\n- Specific education requirements vary by program\n- Preferred cumulative GPA of 3.0 or higher\n- Must be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n- Must be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and\nMarch 2025\n\nPLEASE NOTE: You may be required to complete an Unproctored Internet Testing (UIT) requirement measuring cognitive ability, motivation, and English proficiency.\n\nFor NSAs Summer Language Program, no specific major is required, but the following language proficiencies are recommended:\n- Arabic\n- Mandarin Chinese\n- Persian Farsi\n- African Languages",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The NSA Summer Internship Program at our Draper, Utah location offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.  These summer internship opportunities are open to students who are pursuing education in a variety of degree programs.\n\nNSA currently offers more than 30 Summer Intern Programs in a variety of fields to include: Computer Science, Mathematics Cybersecurity, Engineering, Intelligence Analysis, Language, Business, Human Resources, Security & Counterintelligence, Strategic Communications, Psychology and Signals Intelligence. When applying to this ad you will be considered for all Summer Internship Programs and may be selected to process for more than one for Summer 2025. The full listing of each internship description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Summer Internship - Utah",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "- Students are paid a competitive salary commensurate with their education level.\n- All internships are 10 - 12 weeks during the summer.\n- Receive annual leave, sick leave and paid federal holidays.\n- Students who attend school in excess of 75 miles from Draper, Utah are eligible for travel entitlements of a round trip airfare ticket to and from school or mileage reimbursement up to the cost of a government-issued airline ticket.\n- Daily transportation to and from work is NOT provided. Students participating in the program are highly encouraged to bring a vehicle. Carpooling with other students MAY be available, but is NOT guaranteed.\n- Participation in agency-wide extracurricular programs.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD || Draper, Utah, UT",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-06T00:00:00.000Z"
  },
  {
    "_id": "66cf3d3ab231b42178df1ba4",
    "jobNumber": "1236492",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Have you worked in the IC/NSA as a civilian employee or military member with a TS/SI clearance?  If so, NSA wants you! NSA has exciting opportunities for former federal civilian/military service members to be part of an expert workforce. To be considered for our openings, you simply build a quality resume following the profile building directions, and then click \"apply\". We will review your experience and interest, assess our openings against your qualifications and contact you directly.",
    "fullDescription": "Have you worked in the IC/NSA as a civilian employee or military member with a TS/SI clearance?  If so, NSA wants you! NSA has exciting opportunities for former federal civilian/military service members to be part of an expert workforce. To be considered for our openings, you simply build a quality resume following the profile building directions, and then click \"apply\". We will review your experience and interest, assess our openings against your qualifications and contact you directly.",
    "grade": "07/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "O",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-09-14T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900000",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-05T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Have you worked in the IC/NSA as a civilian employee or military member with a TS/SI clearance?  If so, NSA wants you! NSA has exciting opportunities for former federal civilian/military service members to be part of an expert workforce. To be considered for our openings, you simply build a quality resume following the profile building directions, and then click \"apply\". We will review your experience and interest, assess our openings against your qualifications and contact you directly.",
    "jobQualifications": null,
    "jobQualificationsExt": "The minimum qualifications against which the applicant will be evaluated derive from the skill area to which they are matched. In addition, the applicant must have previous experience working as a civilian employee or military affiliate in an Intelligence Community Agency.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency employs a diverse workforce that plays a critical role in protecting our nation's security every day. The NSA is seeking individuals with relevant Intelligence Community (IC) experience to support our mission. Previous NSA employees are highly encouraged to apply to this job posting. Applicants to this advertisement will be considered against the two skill areas that they chose in the screening questions and will be required to meet all applicable minimum qualifications. To determine the minimum qualifications associated with a particular vacancy, please review the relevant vacancy announcement.\n\nRetired Federal government employees are encouraged to apply directly to the \"Retired Federal Government Employees\" job posting so that we can consider your application as a reemployed annuitant. In addition, we suggest you contact the Office of Personnel Management should you have any questions regarding the impact of reemployment on your current benefits as a federal retiree.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "NSA corporately hires for many areas of consideration. Your responses to screening questions attached to this job posting will help us to guide you toward the area(s) that best fit your background/experience:\n\no\tComputer Science\no\tCybersecurity & Analysis\no      Data Science\no\tEngineering and Physical Science\no\tLanguage Analysis\no\tMathematics\no\tNetworking and Telecommunications\no\tSecurity",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Former Intelligence Community (IC) Professionals",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule: Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-05T00:00:00.000Z"
  },
  {
    "_id": "66b238d9b231b42178188697",
    "jobNumber": "1235795",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working in NSA spaces.",
    "fullDescription": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working in NSA spaces.",
    "grade": "04/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "R",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the `Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the `Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.\n\n***PLEASE NOTE: To be considered for our Summer Internships, you must submit a COMPLETE application package by 1 October for all Summer Internship Programs. Your application package MUST include: \n\n1. Official transcript (unofficial will be accepted if legible) - file name = LAST_FIRST_TRANSCRIPT\n2. At least 1 letter of recommendation from a faculty member or supervisor who can speak directly to your educational background - file name = LAST_FIRST_LOR\n3. PDF copy of your current resume - file name = LAST_FIRST_RESUME\nOptional: Cover Letter listing your interest in NSA's Summer Internships - file name = LAST_FIRST_COVER\n\nIMPORTANT: Your application is not considered complete until the 3 items listed above have been emailed to SummerInterns@uwe.nsa.gov in addition to your online application.  Any incomplete package will NOT be considered. \n\nREMINDER: You could be contacted and/or considered for more than one specific internship.\n\nDEADLINE: Applications are accepted 1 September - 1 October; however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nCONTACT INFORMATION: If you have any questions about NSA Summer Internships, please contact us at SummerInterns@uwe.nsa.gov or call us at 410-854-4726.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working in NSA spaces.",
    "jobQualifications": null,
    "jobQualificationsExt": "To be accepted into a NSA Summer Internship - candidates must:\n\n-\tMust be a U.S. Citizen\n-\tMust be enrolled in a degree-seeking program (undergraduate, graduate, doctorate) at time of application \n-\tSpecific education requirements vary by program\n-\tPreferred cumulative GPA of 3.0 or higher\n-\tMust be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n-\tMust be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and March 2025\n\nPLEASE NOTE: You may be required to complete an Unproctored Internet Testing (UIT) requirement measuring cognitive ability, motivation, and English proficiency.\n\nFor NSAs Summer Language Program, no specific major is required, but the following language proficiencies are recommended:\n- Arabic\n- Mandarin Chinese\n- Persian Farsi\n- African Languages",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The NSA Summer Internship Program at our Fort Meade, MD location offers students exciting, impactful professional work opportunities (with pay and limited benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.  These summer internship opportunities are open to students who are pursuing education in a variety of degree programs.\n\nNSA currently offers more than 30 Summer Intern Programs in a variety of fields to include: Computer Science, Mathematics, Cybersecurity, Engineering, Intelligence Analysis, Language, Business, Human Resources, Security & Counterintelligence, Strategic Communications, Psychology and Signals Intelligence. When applying to this ad you will be considered for all Summer Internship Programs and may be selected to process for more than one for Summer 2025. The full listing of each internship description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Summer 2025 Internship Program - Maryland",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "-\tStudents are paid a competitive salary commensurate with their education level.\n- All internships are 10 - 12 weeks during the summer.\n-\tReceive annual leave, sick leave and paid federal holidays.\n-\tStudents who attend school in excess of 75 miles from Fort Meade, MD are eligible for housing accommodations and travel entitlements of a round trip airfare ticket to and from school or mileage reimbursement up to the cost of a government-issued airline ticket. \n-\tDaily transportation to and from work is NOT provided. Students participating in the program are highly encouraged to bring a vehicle. Carpooling with other students MAY be available, but is NOT guaranteed.\n-\tParticipation in agency-wide extracurricular programs.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0a3",
    "jobNumber": "1235779",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business, computer, engineering, manufacturing, construction, graphic arts, intelligence analysis aide, and Chinese language. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "fullDescription": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business, computer, engineering, manufacturing, construction, graphic arts, intelligence analysis aide, and Chinese language. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "grade": "01/1 to 01/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "H",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Part-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Online applications must be submitted by 1 October 2024. Applications received after the deadline, as well as incomplete packets, will not be considered. \n\nStudents must also submit the following material via email to HSWS@uwe.nsa.gov by 1 October 2024:\n(1) One Student Evaluation form, please send an email to HSWS@uwe.nsa.gov to request form. \n(2) Official transcript from High School, which MUST include their junior year work in progress courses for both first and second semester. \n(3) Resume- Must include the relevant courses completed or in progress as well as the position (Office Assistant, Computer Aide, Vo-Tech/Printing/Graphic Arts, Model Shop, Facilities and Logistics, Chinese Language, or Intelligence Analysis Aide) to which you are applying. \n\nStudents must submit all required documents (resume, official transcript, student evaluation) in one email to HSWS@uwe.nsa.gov.  Please do not submit as Google doc links. \n\nEarly Acceptance Incentive\nApplications are accepted 1 September - 1 October 2024, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as practical to allow sufficient time for review and security clearance processing.\n\nYou may call NSA Washington's HSWS Office at (410) 854-4592 for specific questions regarding the program. \n\nTo apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing. \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information. \n\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business, computer, engineering, manufacturing, construction, graphic arts, intelligence analysis aide, and Chinese language. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "jobQualifications": null,
    "jobQualificationsExt": "- Must be 16 years of age by 31 December 2024.\n- Must be eligible to be granted a Security Clearance.\n- Must be a U.S Citizen \n- Unweighted GPA of 2.5 or higher is preferred \n- Must be a High School Junior \n- Must have reliable transportation \n- Must complete at least two course in desired field of study prior to the completion of the junior year. \n- Students interested in the HSWS Program at Fort Meade, Maryland must reside within commuting distance of this location. \n\nAvailable Positions within the HSWS Program (Fort Meade, MD Only):\n\nOffice Assistant- Type, file, maintain records, answer phones and operate business equipment such as word processors and personal computers. Applicant must complete a minimum of one business or non-technical computer course (such as Microsoft Applications, Keyboarding, Software Applications, Advanced Applications, Computer Skills for Academic Success, etc.) prior to the completion of their junior year of high school, or they will not be considered for a position in the HSWS Program.  This will be verified on the transcript at the end of the junior year.\n\nComputer Aide - Operate our data processing equipment, often the most sophisticated equipment on the market.  These positions are geared towards those students who are in STEM focused courses or have completed a minimum of two technical computer courses (such as Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++, etc.) by the end of their junior year of high school.  This will be verified on the transcript at the end of the junior year.\n\nVo-Tech - Printing/Graphic Arts - Use software to create agency brochures, pamphlets, etc.  Manufacturing - Use industrial assembly machine.  Designed for high school students who are enrolled in either Printing/Graphic Arts or Manufacturing classes at a technical high school.\n\nFacilities and Logistics - Looking for students that are mechanically inclined. Install and maintain building architectural systems by building standard and executive style systems and repairing, altering or constructing replacement items from materials such as wood, plastic, or metal. Apply surface finish treatments such as painting or staining. They could also perform sanitization, declassification, excess or destruction. Sanitize, declassify or destroy the material using common hand tools or devices such as hammermills, pulverizers, incinerators, degaussers, or paper pulping equipment. Dispose of material through donation, recycling, reutilization, or resale. Designed for high school students who are enrolled in Construction, Engineering, Project Management or Manufacturing at a technical high school.\n\nModel Shop - Machining, sheet metal, fabrication, welding, woodworking, injection molding, and painting and plating.  Designed for high school students who are enrolled in either Printing/Graphic Arts or Manufacturing classes at a technical high school.\n\nChinese - Students who are currently enrolled in advanced Chinese courses (Chinese 5 or higher). They will be required to use their Chinese language skills to perform daily duties. Students need to be excelling in their Chinese reading, writing and listening skills. In addition, students should be recommended by the school's lead Chinese language instructors. \n\nIntelligence Analysis (IA) Aide - This work role uses your writing and critical thinking skills to transform foreign intelligence and cybersecurity information into critical reports that will be used to understand high priority intelligence issues. Must be enrolled in at least one advanced English course and at least one advanced humanities course (Government, History, etc.), and completed at least two business or technical computer courses.\n\n**ATTENTION**: Applicants are not guaranteed to be placed in the position/area they select.  The HSWS Program Manager will review the application materials (to include resume and transcript) and will make the final determination as to which position best utilizes the applicant's skills.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "HIGH SCHOOL WORK STUDY PROGRAM \n\nThe National Security Agency's (NSA) High School Work Study (HSWS) Program application is open only to high school juniors who are enrolled in Business, Computers, Engineering, Manufacturing, Graphic Arts, Construction, and Chinese courses, and who plan to participate in a school-sponsored Work Experience Program during their senior year.  \n\n**Program is subject to change**\n\nAPPLICATION INFORMATION: \n\nTo apply, students must check with their High School Work Experience Coordinator to determine the school's application process as well as specific course requirements for their school.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High School Work Study Program - Baltimore/Washington",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Students will be on a Grade and Step Scale. All work studies are a Grade 01 Step 01. High School Work Study students are on a part-time schedule and make approximately $15.00 per hour (in Maryland). \n\nStudents will earn Annual Leave and Sick Leave at a rate of one hour of Annual Leave and one hour of Sick Leave for every twenty hours worked. \n\nStudents are to work a Monday - Friday work schedule.  All students must work a minimum of 4 hours each day, 5 days a week, Monday through Friday.  Report times are between the hours of 10:30 am and 12:30 pm with core work hours from 12:30 pm to 2:30 pm.  The maximum number of hours a student may work per week is 32 hours.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0a4",
    "jobNumber": "1235785",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computers. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "fullDescription": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computers. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "grade": "01/1 to 01/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "H",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Part-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Online applications must be submitted by 11:59PM on October 1st 2024. Applications received after the deadline, as well as incomplete packets, will not be considered.\n\nStudents must also submit the following material via email to NSAC_HSWS@uwe.nsa.gov by 11:59PM on October 1st 2024.\n\n(1) One Student Evaluation form, please send an email to NSAC_HSWS@uwe.nsa.gov to request form.\n(2) Official transcript from High School, which MUST include their junior year work in progress courses for both first and second semester.\n(3) Resume- Must include the relevant courses completed or in progress as well as the position (Office Assistant or Computer Aide) to which you are applying.\n\nEarly Acceptance Incentive\nApplications are accepted 1 September - 1 October 2024, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as practical to allow sufficient time for review and security clearance processing.\n\nNSA Colorado's HR Office can be contacted at 303-677-1721. \n\nTo apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing. \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information. \n\nThe NSA is committed to cultural diversity in its workplace. \n\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computers. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "jobQualifications": null,
    "jobQualificationsExt": "- Must be 16 years of age by 31 December 2024.\n- Must be eligible to be granted a Security Clearance.\n- Must be a U.S Citizen \n- Unweighted GPA of 2.5 or higher is preferred \n- Must be a High School Junior \n- Must have reliable transportation \n- Must complete at least two Business or Technical Computer course prior to the completion of the junior year (preferred Business courses are Microsoft Applications, Keyboarding, Software Applications, Advanced Applications and Computer Skills for Academic Success/preferred Technical Computer courses are Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++.) Applicants who have not completed two of these courses will not be considered for a position in the program.\n- Office Assistant/Computer Aide positions are available in Colorado. Students interested in this program must reside within commuting distance of Colorado locations.\n\nAvailable Positions within the HSWS Program (Buckley Space Force Base, CO Only):\n\nOffice Assistant- Type, file, maintain records, answer phones and operate business equipment such as word processors and personal computers. Applicant must complete a minimum of two business or non-technical computer course (such as Microsoft Applications, Keyboarding, Software Applications, Advanced Applications, Computer Skills for Academic Success, etc.) prior to the completion of their junior year of high school, or they will not be considered for a position in the HSWS Program.  This will be verified on the transcript at the end of the junior year.\n\nComputer Aide - Operate our data processing equipment, often the most sophisticated equipment on the market.  These positions are geared towards those students who are in STEM focused courses or have completed a minimum of two technical computer courses (such as Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++, etc.) by the end of their junior year of high school.  This will be verified on the transcript at the end of the junior year.\n\n**ATTENTION**: Applicants are not guaranteed to be placed in the position/area they select.  The HSWS Program Manager will review the application materials (to include resume and transcript) and will make the final determination as to which position best utilizes the applicant's skills.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "HIGH SCHOOL WORK STUDY PROGRAM \n\nThe National Security Agency's (NSA) High School Work Study (HSWS) Program application is open only to high school juniors who are enrolled in either Business or Technical Computer courses, and who plan to participate in a school-sponsored Work Experience Program during their senior year.  \n\n**Program is subject to change**\n\nAPPLICATION INFORMATION: \n\nTo apply, students must check with their High School Work Experience Coordinator to determine the school's application process as well as specific course requirements for their school.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High School Work Study Program - Colorado",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Students will be on a Grade and Step Scale.  All work studies are a Grade 01 Step 01. High School Work Study students are on a part-time schedule and make approximately $15.00 per hour (in Colorado). \n\nStudents will earn Annual Leave and Sick Leave at a rate of one hour of Annual Leave and one hour of Sick Leave for every twenty hours worked. \n\nStudents are to work a Monday - Friday work schedule.  Students must work a minimum of 4 hours each day, 5 days a week, Monday through Friday.  Report times are between the hours of 8 a.m. and 12:30 pm with core work hours from 11:00 a.m. to 2:30 pm.  The maximum number of hours a student may work per week is 32 hours, the minimum is 20 hours.",
    "location": "Denver, CO",
    "locationArea": "169",
    "locationFull": "Denver/Aurora, CO",
    "locationSpecificId": "L169",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0a7",
    "jobNumber": "1235693",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The National Security Agency (NSA) is currently accepting applications from across the country for the Stokes Educational Scholarship Program-Language. This tuition assistance program is looking for high school seniors, minorities, who are planning to pursue studies in Chinese language as a part of their college degree program. \nThis program provides a tremendous opportunity to gain valuable experience in Foreign Language opportunities around the agency and an annual salary. Selected participants will also receive up to $30,000 for tuition and mandatory educational fees per academic year. Eligible students that is traveling over 75 miles from school to NSA, will receive housing and travel benefits while working at NSA during the summer.\n\nA position in the Stokes Educational Scholarship Program-Language means you will attend classes full-time at the college of your choice in the U.S., and then work during the summer at NSA for a minimum of 12 weeks in areas that are related to your course of study (Chinese Language).",
    "fullDescription": "The National Security Agency (NSA) is currently accepting applications from across the country for the Stokes Educational Scholarship Program-Language. This tuition assistance program is looking for high school seniors, minorities, who are planning to pursue studies in Chinese language as a part of their college degree program. \nThis program provides a tremendous opportunity to gain valuable experience in Foreign Language opportunities around the agency and an annual salary. Selected participants will also receive up to $30,000 for tuition and mandatory educational fees per academic year. Eligible students that is traveling over 75 miles from school to NSA, will receive housing and travel benefits while working at NSA during the summer.\n\nA position in the Stokes Educational Scholarship Program-Language means you will attend classes full-time at the college of your choice in the U.S., and then work during the summer at NSA for a minimum of 12 weeks in areas that are related to your course of study (Chinese Language).",
    "grade": "02/1 to 02/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "U",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Stokes Program applications will be accepted 1 September through 1 October. Please read and follow all application instructions to ensure that your application packet is complete. \n\n** PLEASE NOTE: This is a two-part application, you must apply to this job posting AND email required documents.  Incomplete applications will not be considered. The deadline for online applications is 1 October and all information submitted by email must be sent by 1 October to be eligible for consideration. \n\nWe are accepting applications from high school seniors planning to pursue studies in Chinese language as part of their college degree program.\nTo apply for the Stokes Educational Scholarship Program-Language, applicants must first: \nClick the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\nUnder Applicant personal information: \n-\tFull Name \n-\tStreet Address \n-\tCity, State & Zip Code \n-\tE-mail Address \n-\tPhone Number \n-\tDate of Birth \n\nUnder Resume Objective: \n-\tPlanned Language of Study (Chinese) \n-\tOther College Major (Acceptable majors include: Chinese, Linguistics, Regional/Area Studies, International Relations, Finance/Economics, Journalism, Political Science, History, Data Science, Topical Studies (counter-proliferation, counterterrorism, international crime, etc.)\n-\tHighest SAT score for Math, Verbal and Writing (if taken) \n-\tAP or 3rd level or higher World Language coursework\nHigh school Transcripts must show a minimum of 3 years of coursework in a world language. If available, students may also submit evidence of achieving Seal of Illiteracy as set by the American Council for the Teaching of Foreign Language (ACTFL) or results from ACTFL, National Examination for World Language (NEWL), or other relevant language examinations.*** \n-\tSAT/ACT scores (if taken) \n     \nUnder Work Experience: \n-\tPast and current employment \n-\tVolunteer work \n-\tExtracurricular activities \n-\tSchool activities \n\nUnder Education:\n-\tHigh school name, un-weighted GPA, expected graduation date \n\nUnder Other Professional Details: \n-\tAP and/or IB courses taken/taking \n-\tAny college courses taken/taking \n-\tLeadership positions held \n-\tOther technical skills \nOnce your application has been submitted online, please submit the following via email to Stokeshiring@uwe.nsa.gov (Please send all of these items in one packet): \n-\tResume\n-\tTwo Letters of Recommendation:\n\t       Language: Teacher that can attest to proficiency\n-\tOfficial Transcript from High School and College if college courses show language coursework\n-\tVerification of AP/IB test scores and/or Seal of Bi-literacy (If granted)\n-\tOne-page essay entitled, \"I want a career using my world language skills because...\"\n-\tOPTIONAL three (3) pages of supplemental information. This information can be anything that would enhance your application, such as an original essay, another letter of recommendation, etc... \n\n1-844-424-4737 or 410/854-4725 \n(For the phone menu options, please select Student Programs and then Stokes)\n\n\nAll positions in the National Security Agency are in the excepted service. \n\nU.S. Citizenship is required for all applicants. A security clearance must be granted prior to employment and you will be required to undergo extensive pre-employment processing. This includes: aptitude testing; an interview with a psychologist and a security interview conducted with the aid of a polygraph; and a personnel interview. The final stage of processing will be successful completion of a background investigation. \nReasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. \nThe NSA is committed to cultural diversity in its workplace. \nWe are an Equal Opportunity Employer.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility. '",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The National Security Agency (NSA) is currently accepting applications from across the country for the Stokes Educational Scholarship Program-Language. This tuition assistance program is looking for high school seniors, minorities, who are planning to pursue studies in Chinese language as a part of their college degree program. \nThis program provides a tremendous opportunity to gain valuable experience in Foreign Language opportunities around the agency and an annual salary. Selected participants will also receive up to $30,000 for tuition and mandatory educational fees per academic year. Eligible students that is traveling over 75 miles from school to NSA, will receive housing and travel benefits while working at NSA during the summer.\n\nA position in the Stokes Educational Scholarship Program-Language means you will attend classes full-time at the college of your choice in the U.S., and then work during the summer at NSA for a minimum of 12 weeks in areas that are related to your course of study (Chinese Language).",
    "jobQualifications": null,
    "jobQualificationsExt": "While the eligibility requirements for our Stokes Program-Language are subject to change from year to year, below you will find our basic prerequisites. **Please Note: If you have a full scholarship for college, you are ineligible to apply for the Stokes Program. **\nHigh School Seniors (planning to study Chinese Language in college):\n-\tU.S. Citizenship \n-\tPreferred GPA of 3.0 or above on a 4.0 scale \n-\tDemonstrated aptitude in learning foreign language(s) High school Transcripts must reflect a minimum of 3 years of coursework in a world language.\n-\tIf available, students may also submit evidence of achieving Seal of Biliteracy as set by the American Council for the Teaching of Foreign Language (ACTFL) or results from ACTFL, National Examination for World Language (NEWL), or other relevant language examinations. ***",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "If you are selected as a program participant, you are required to work in a foreign language program majoring in Chinese at NSA after college graduation for at least one-and-a-half times your length of study. If you should leave NSA employment earlier, we'll make arrangements for you to pay back the government for your tuition and mandatory educational fees.  Also, students accepted into the program must maintain at least a 2.75 GPA on a 4.0 scale each semester/quarter of their freshman year and a 3.0 GPA on a 4.0 scale each semester/quarter after their freshman year.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Stokes Educational Scholarship Program - Language (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salary: $34,803 annually (GG 2 Step 1)",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0a8",
    "jobNumber": "1235242",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "fullDescription": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "grade": "03/1 to 07/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "P",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-31T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: To be considered for our Co-op positions, you must submit a COMPLETE application package by 31 October. Your application package must include: \n\n1. Unofficial transcript with a traditional grading scale (GPA)\n2. PDF copy of your current resume\nIf your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcripts to CoopHiring@uwe.nsa.gov as an attachment.  Please do not send HTML transcripts accessible via a website or text versions thereof. \n\nDEADLINE: Applications are accepted 1 September - 31 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "jobQualifications": null,
    "jobQualificationsExt": "Only applicants that meet the following qualifications will be considered:\n  \n'\tMust be a U.S. Citizen\n'\tMust be a second semester college freshman or a college sophomore\n'\tMust be pursuing the following majors: Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track) or Chinese Language focused major\n'\tPreferred cumulative GPA of 3.0 or higher for all college work completed\n'\tMust be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA's Cooperative Education (Co-op) Program at Hawaii offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure. These Co-op opportunities are open to students who are majoring in Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track) or pursuing a Chinese language focused major. \n\nRight from the start, you will be involved in real life projects and will have full use of NSA labs, equipment, and advanced technologies. These areas will offer you increasing challenges and satisfying learning experiences, since our mission demands that we work on the cutting edge of technology. The full listing of each Co-op description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.\n\nProgram Details: \n'\t52 weeks of alternating semesters of school and work at NSA \n'\tDuring work tours, students work a 40-hour week\n'\tTuition reimbursement for one technical course per semester (up to $2,500)\n'\tEligible for full time employment following successful completion of the program\n\n***PLEASE NOTE:  As this program requires students to rotate between semesters of work and study, applicants are encouraged to discuss the possibility of participating in this type of program with their school (Academic Advisor, Co-Op Advisor, Registrar and/or Financial Aid Office, etc.) to determine the effect it may have on their full time student status during scheduled work tours as well as any effects it may have on scholarships and financial aid. \n \nTravel, housing, or transportation to/from work is not provided.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cooperative Education Program - Hawaii",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salaries are determined by the percentage of credits completed toward a degree. Each 20% block of credits completed with at least a 3.0 GPA will allow you to be promoted to the next grade. Grades range from GGD-03/05 to GGD-07/01, which equates to $39,095- $51,110 annually. Due to the rotational nature of the Co-op program, students are paid proportionate to the number of weeks worked in a year and are authorized Leave without Pay during scheduled school rotations. The salaries aforementioned include a locality based comparability payment.\n\nStudents will receive annual leave, sick leave and paid federal holidays.\n\n \nSPECIAL INCENTIVES/BENEFITS: \n\nHawaii enjoys several tangible and intangible quality of life benefits. All assignees currently receive a Cost of Living Allowance (COLA), taxed by the State of Hawaii and exempt from Federal taxation. For calendar year 2024 this percentage is 8.9% and is subject to change an annual basis.",
    "location": "Honolulu, HI",
    "locationArea": "282",
    "locationFull": "NSA/CSS Hawaii Kunia, HI",
    "locationSpecificId": "L282",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0a9",
    "jobNumber": "1235786",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computers. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "fullDescription": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computers. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "grade": "01/1 to 01/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "H",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Part-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Online applications must be submitted by 1 October 2024. Applications received after the deadline, as well as incomplete packets, will not be considered. \n\nStudents must also submit the following material via email to NSAT_recruitment@uwe.nsa.gov by 1 October 2024:\n\n(1) One Student Evaluation form, please send an email to NSAT_recruitment@uwe.nsa.gov to request form.\n(2) Official transcript from High School, which MUST include their junior year work in progress courses for both first and second semester.\n(3) Resume- Must include the relevant courses completed or in progress as well as the position (Office Assistant or Computer Aide) to which you are applying.\n\n\nEarly Acceptance Incentive\nApplications are accepted 1 September - 1 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as practical to allow sufficient time for review and security clearance processing.\n\nFor questions specific to NSAT please call NSAT HR at 210-346-4562.\n\nTo apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing. \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information. \n\nThe NSA is committed to cultural diversity in its workplace. \n\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computers. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "jobQualifications": null,
    "jobQualificationsExt": "- Must be 16 years of age by 31 December 2024.\n- Must be eligible to be granted a Security Clearance.\n- Must be a U.S Citizen \n- Unweighted GPA of 2.5 or higher is preferred \n- Must be a High School Junior \n- Must have reliable transportation \n- Must complete at least two Business or Technical Computer course prior to the completion of the junior year (preferred Business courses are Microsoft Applications, Keyboarding, Software Applications, Advanced Applications and Computer Skills for Academic Success/preferred Technical Computer courses are Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++. Applicants who have not completed one of these courses will not be considered for a position in the program.\n\n- Office Assistant/Computer Aide positions are available in Texas. Students interested in this program must reside within commuting distance of this location.\n\nAvailable Positions within the HSWS Program (San Antonio, TX Only):\n\nOffice Assistant- Type, file, maintain records, answer phones and operate business equipment such as word processors and personal computers. Applicant must complete a minimum of one business or non-technical computer course (such as Microsoft Applications, Keyboarding, Software Applications, Advanced Applications, Computer Skills for Academic Success, etc.) prior to the completion of their junior year of high school, or they will not be considered for a position in the HSWS Program.  This will be verified on the transcript at the end of the junior year.\n\nComputer Aide - Operate our data processing equipment, often the most sophisticated equipment on the market.  These positions are geared towards those students who are in STEM focused courses or have completed a minimum of two technical computer courses (such as Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++, etc.) by the end of their junior year of high school.  This will be verified on the transcript at the end of the junior year.\n\n**ATTENTION**: Applicants are not guaranteed to be placed in the position/area they select. The HSWS Program Manager will review the application materials (to include resume and transcript) and will make the final determination as to which position best utilizes the applicant's skills.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "HIGH SCHOOL WORK STUDY PROGRAM \n\nThe National Security Agency's (NSA) High School Work Study (HSWS) Program application is open only to high school juniors who are enrolled in either Business or Technical Computer courses, and who plan to participate in a school-sponsored Work Experience Program during their senior year.  \n\n**Program is subject to change**\n\nAPPLICATION INFORMATION: \n\nTo apply, students must check with their High School Career Preparation Department (formerly CO-OP department) to determine the school's application process as well as specific course requirements for their school.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High School Work Study Program - Texas",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Students will be on a Grade and Step Scale.  All work studies are a Grade 01 Step 01. High School Work Study students are on a part-time schedule and make approximately $15.00 per hour (in Texas). \n\nStudents will earn Annual Leave and Sick Leave at a rate of one hour of Annual Leave and one hour of Sick Leave for every twenty hours worked. \n\nStudents are to work a Monday - Friday work schedule.  All students must work a minimum of 4 hours each day, 5 days a week, Monday through Friday.  Report times is 1:00 pm and students are expected to work from 1:00pm to 5:00pm.  The maximum number of hours a student may work per week is 20 hours.",
    "location": "San Antonio, TX",
    "locationArea": "498",
    "locationFull": "San Antonio, TX",
    "locationSpecificId": "L498",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0aa",
    "jobNumber": "1235782",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business, computer, Chinese language, and intelligence analysis. The program provides hands-on work experience from August-July with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "fullDescription": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business, computer, Chinese language, and intelligence analysis. The program provides hands-on work experience from August-July with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "grade": "01/1 to 01/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "H",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Part-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Online applications must be submitted by 1 October 2024. Applications received after the deadline, as well as incomplete packets, will not be considered. \n\nStudents must also submit the following material via email to NSAH-Recruitment@uwe.nsa.gov by 1 October 2024: \n\n(1) One Student Evaluation form, please send an email to NSAH-Recruitment@uwe.nsa.gov to request form.\n(2) Official transcript from High School, which MUST include their junior year work in progress courses for both first and second semester (unofficial transcripts are also allowed).\n(3) Resume- Must include the relevant courses completed or in progress as well as the position (Office Assistant, Computer Aide, Chinese Language, Intelligence Analysis Aide) to which you are applying.\n\nEarly Acceptance Incentive\nApplications are accepted 1 September - 1 October 2024, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as practical to allow sufficient time for review and security clearance processing.\n\nYou may call NSA Hawaii Recruitment at (808) 364-3898 for specific questions regarding the program. \n\nTo apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing. \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information. \n\nThe NSA is committed to cultural diversity in its workplace. \n\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business, computer, Chinese language, and intelligence analysis. The program provides hands-on work experience from August-July with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "jobQualifications": null,
    "jobQualificationsExt": "- Must be 16 years of age by 31 December 2024.\n- Must be eligible to be granted a Security Clearance.\n- Must be a U.S Citizen\n- Unweighted GPA of 2.5 or higher is preferred\n- Must be a High School Junior\n- Must have reliable transportation\n- Must complete a minimum of one Business course, one Technical Computer course, two Chinese language courses, or one AP English Course and AP Humanities Course prior to the completion of the junior year (preferred Business courses are Microsoft Applications, Keyboarding, Software Applications, Advanced Applications and Computer Skills for Academic Success/preferred Technical Computer courses are Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++/preferred Language courses are Intermediate Chinese or above.) Applicants who have not completed one of these courses will not be considered for a position in the program.\n- Office Assistant/Computer Aide/Chinese Language/Intelligence Analysis Aide positions are available in Hawaii. \n- Students interested in this program must reside within commuting distance of this location.\n\nAvailable Positions within the HSWS Program (Hawaii Only):\n\nOffice Assistant- Type, file, maintain records, answer phones and operate business equipment such as word processors and personal computers. Applicant must complete a minimum of one business or non-technical computer course (such as Microsoft Applications, Keyboarding, Software Applications, Advanced Applications, Computer Skills for Academic Success, etc.) prior to the completion of their junior year of high school, or they will not be considered for a position in the HSWS Program.  This will be verified on the transcript at the end of the junior year.\n\nComputer Aide - Operate our data processing equipment, often the most sophisticated equipment on the market.  These positions are geared towards those students who are in STEM focused courses or have completed a minimum of two technical computer courses (such as Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++, etc.) by the end of their junior year of high school.  This will be verified on the transcript at the end of the junior year.\n\nChinese Language - Use Chinese language skills to perform daily duties and support mission related activities. Applicant must be currently enrolled in advanced Chinese courses (Chinese 2 or higher). Students need to be excelling in their Chinese reading, writing and listening skills. In addition, students should be recommended by the school's lead Chinese language instructor(s).\n\nIntelligence Analysis Aide ' Use your writing and critical thinking skills to transform foreign intelligence and cybersecurity information into critical reports that will be used to understand high priority intelligence issues. Applicant must be enrolled in at least one advanced English course and at least one advanced humanities course (government, history, etc.). Must have completed at least two business or technical computer courses.\n\n**ATTENTION**: Applicants are not guaranteed to be placed in the position/area they select.  The HSWS Program Manager will review the application materials (to include resume and transcript) and will make the final determination as to which position best utilizes the applicant's skills.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "HIGH SCHOOL WORK STUDY PROGRAM \n\nThe National Security Agency's (NSA) High School Work Study (HSWS) Program application is open only to high school juniors who are enrolled in Business, Technical Computer, Chinese Language, or AP English, and who plan to participate in a school-sponsored Work Experience Program during their senior year.\n \n**Program is Subject to Change**\n\nAPPLICATION INFORMATION: \n\nTo apply, students must check with their High School Work Experience Coordinator to determine the school's application process as well as specific course requirements for their school.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High School Work Study Program - Hawaii",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Students will be on a Grade and Step Scale.  All work studies are a Grade 01 Step 01. High School Work Study students are on a part-time schedule and make approximately $15.00 per hour (in Hawaii). In addition, Hawaii students may earn a Cost of Living Adjustment of approximately 9% of their base pay. This percentage is subject to change each year.\n\nStudents will earn Annual Leave and Sick Leave at a rate of one hour of Annual Leave and one hour of Sick Leave for every twenty hours worked. \n \nStudents are to work a Monday - Friday work schedule.  All students must work a minimum of 40 hours every 2 weeks. Report times are between the hours of 07:00 am and 12:30 pm with core work hours from 12:30 pm to 4:30 pm.  The maximum number of hours a student may work per week is 32 hours.",
    "location": "Honolulu, HI",
    "locationArea": "282",
    "locationFull": "NSA/CSS Hawaii Kunia, HI",
    "locationSpecificId": "L282",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ab",
    "jobNumber": "1235240",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "fullDescription": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "grade": "03/1 to 07/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "P",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-31T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: To be considered for our Co-op positions, you must submit a COMPLETE application package by 31 October. Your application package must include: \n\n1. Unofficial transcript with a traditional grading scale (GPA)\n2. PDF copy of your current resume\nIf your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcripts to CoopHiring@uwe.nsa.gov as an attachment.  Please do not send HTML transcripts accessible via a website or text versions thereof. \n\nDEADLINE: Applications are accepted 1 September - 31 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "jobQualifications": null,
    "jobQualificationsExt": "Only applicants that meet the following qualifications will be considered:\n\n'\tMust be a U.S. Citizen \n'\tMust be pursuing a Chinese language-focused major\n'\tMust be a second semester college freshman or a college sophomore\n'\tPreferred cumulative GPA of 3.0 or higher for all college work completed\n'\tMust be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n'\tMust be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and March 2025",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA's Cooperative Education (Co-op) Program at Fort Meade, MD offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure. These Co-op opportunities are open to students who are pursuing a Chinese language-focused major. \nRight from the start, you will be involved in real life projects and will have full use of NSA labs, equipment, and advanced technologies. These areas will offer you increasing challenges and satisfying learning experiences, since our mission demands that we work on the cutting edge of technology. The full listing of each Co-op description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.\n\nProgram Details: \n'\t52 weeks of alternating semesters of school and work at NSA \n'\tDuring work tours, students work a 40-hour week\n'\tSubsidized student housing and travel entitlements during work tours if over 75 miles from Fort Meade, MD \n'\tTuition reimbursement for one technical course per semester (up to $2,500)\n'\tAlthough not guaranteed, potential for full time employment following successful completion of the program\n\n***PLEASE NOTE:  As this program requires students to rotate between semesters of work and study, applicants are encouraged to discuss the possibility of participating in this type of program with their school (Academic Advisor, Co-Op Advisor, Registrar and/or Financial Aid Office, etc.) to determine the effect it may have on their full time student status during scheduled work tours as well as any effects it may have on scholarships and financial aid.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cooperative Education Program - Language (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salaries are determined by the percentage of credits completed toward a degree. Each 20% block of credits completed with at least a 3.0 GPA will allow you to be promoted to the next grade. Grades range from GGD-03/05 to GGD-07/01, which equates to $40,739-$55,924 annually. Due to the rotational nature of the Co-op program, students are paid proportionate to the number of weeks worked in a year and are authorized Leave without Pay during scheduled school rotations. The salaries aforementioned include a locality based comparability payment.\n\nStudents will receive annual leave, sick leave and paid federal holidays.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ac",
    "jobNumber": "1235712",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in  Morse Code. The program provides hands-on work experience from August 2025 to July 2026 for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "fullDescription": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in  Morse Code. The program provides hands-on work experience from August 2025 to July 2026 for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "grade": "01/1 to 01/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "H",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Part-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Online applications must be submitted by 1 October 2024. Applications received after the deadline, as well as incomplete packets, will not be considered. \n\nStudents must also submit the following material via email to 373isrg.hr.recruitment@us.af.mil by 1 October 2024:\n\n(1) One Student Evaluation form (please request form from 373isrg.hr.recruitment@us.af.mil or contact your guidance counselor) \n(2) Official transcript from High School, which MUST include their junior year work in progress courses for both first and second semester. \n(3) Resume- Must include the relevant courses completed or in progress as well as the position (Morse Code) to which you are applying. \n\nYou may call NSAA HSWS point of contact for specific questions regarding the program:  NSAA HR Department: 907-552-3284, or, NSA Alaska Chief of Staff: 907-551-3812.\n\nTo apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: U.S. Citizenship is required for all applicants. Additionally, the Federal Government requires all personnel to be fully vaccinated at the time of employment, subject to exceptions as required by law. \n\nReasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. \n\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\n\nYou may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in  Morse Code. The program provides hands-on work experience from August 2025 to July 2026 for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "jobQualifications": null,
    "jobQualificationsExt": "- Must be 16 years of age by 31 December 2024\n- Must be eligible to be granted a Security Clearance.\n- Must be a U.S Citizen \n- Unweighted GPA of 2.5 or higher is preferred \n- Must be a High School Junior \n- Must have reliable transportation \n- Must complete or be enrolled in a higher level Computer Science course prior to the completion of the junior year.\n- Students interested in the HSWS Program at the NSA Alaska (NSAA) must reside within commuting distance of Joint Base Elmendorf-Richardson, Anchorage, Alaska.\n\nAvailable Positions within the HSWS Program (Anchorage, AK Only):\n\nMorse Code - Students who are currently enrolled in Computer Science courses. They will use their technical knowledge to perform daily duties to include operations from the Signals Analysis discipline with a primary focus on international Morse code communications and using a wide range of systems and equipment to execute operations.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "HIGH SCHOOL WORK STUDY PROGRAM \n\nThe National Security Agency's (NSA) High School Work Study (HSWS) Morse Code Program application is open only to high school juniors who plan to participate in a school-sponsored Work Experience Program during their senior year.  \n\n**Program is subject to change**\n\nAPPLICATION INFORMATION: \n\nTo apply, students must check with their High School Work Experience Coordinator to determine the school's application process as well as specific course requirements for their school.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High School Work Study Program - Alaska",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Students will be on a Grade and Step Scale.  All work studies are a Grade 01 Step 01. High School Work Study students are on a part-time schedule and make approximately $15.00 per hour in Alaska.\n\nStudents will earn Annual Leave and Sick Leave at a rate of one hour of Annual Leave and one hour of Sick Leave for every twenty hours worked. \n\nStudents are to work a Monday - Friday work schedule.  All students must work a minimum of 4 hours each day, 5 days a week, Monday through Friday.  Report times are between the hours of 10:30 am and 12:30 pm with core work hours from 12:30 pm to 2:30 pm.  The maximum number of hours a student may work per week is 32 hours.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Anchorage, AK",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ad",
    "jobNumber": "1235680",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The National Security Agency (NSA) is currently accepting applications from across the country for the Stokes Educational Scholarship Program. This tuition assistance program is looking for high school seniors who are interested in pursuing degrees in Computer Science, Mathematics, Cybersecurity, and Computer or Electrical Engineering.\n\nThis program provides a tremendous opportunity to gain valuable experience in STEM opportunities around the agency and an annual salary. Selected participants will also receive up to $30,000 for tuition and mandatory educational fees per academic year. Eligible students that is traveling over 75 miles from school to NSA, will receive housing and travel benefits while working at NSA during the summer.\n\nA position in the Stokes Educational Scholarship Program means you will attend classes full-time at the college of your choice in the U.S., and then work during the summer at NSA for a minimum of 12 weeks in areas that are related to your course of study.",
    "fullDescription": "The National Security Agency (NSA) is currently accepting applications from across the country for the Stokes Educational Scholarship Program. This tuition assistance program is looking for high school seniors who are interested in pursuing degrees in Computer Science, Mathematics, Cybersecurity, and Computer or Electrical Engineering.\n\nThis program provides a tremendous opportunity to gain valuable experience in STEM opportunities around the agency and an annual salary. Selected participants will also receive up to $30,000 for tuition and mandatory educational fees per academic year. Eligible students that is traveling over 75 miles from school to NSA, will receive housing and travel benefits while working at NSA during the summer.\n\nA position in the Stokes Educational Scholarship Program means you will attend classes full-time at the college of your choice in the U.S., and then work during the summer at NSA for a minimum of 12 weeks in areas that are related to your course of study.",
    "grade": "02/1 to 02/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "U",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Program applications will be accepted 1 September through 1 October. Please read and follow all application instructions to ensure that your application packet is complete. \n\n** PLEASE NOTE: This is a two part application, you must apply to this job posting AND email required documents.  Incomplete applications will not be considered. The deadline for online applications is 1 October and all information submitted by email must be sent by 1 October to be eligible for consideration. \n\nWe are accepting applications from high school seniors planning to major in Computer Science, Mathematics, Cybersecurity, or Computer/Electrical Engineering as part of their college program. \n\nTo apply for the Stokes Educational Scholarship Program-STEM, applicants must first: \n\nClick the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\nUnder Applicant Personal information: \n-\tFull Name \n-\tStreet Address \n-\tCity, State & Zip Code \n-\tE-mail Address \n-\tPhone Number \n-\tDate of Birth \n\nUnder Resume Objective: \n-\tRequired College Major (Computer Science, Mathematics, Cybersecurity, Computer or Electrical Engineering) \n-\tHighest SAT score for Math, Verbal and Writing (if taken)  \n-\tACT scores (if taken) \n\nUnder Work Experience: \n-\tPast and current employment \n-\tVolunteer work \n-\tExtracurricular activities \n-\tSchool activities \n\n\nUnder Education \n-\tHigh School name, un-weighted GPA, expected graduation date \n\nUnder Other Professional Details \n-\tAP and/or IB courses taken/taking \n-\tAny college courses taken/taking \n-\tLeadership positions held \n-\tOther technical skills \n\nOnce your application has been submitted online, please submit the following via email to Stokeshiring@uwe.nsa.gov (Please send all of these items in one packet): \n-\tResume\n-\tTwo Letters of Recommendation (ex: must be teachers from technical courses who can attest to your academic ability)\n-\tOne-page essay entitled, \"I want a career at NSA because...\" \n-\tAn official/unofficial transcript from your high school which indicates your cumulative GPA and class rank (if applicable). \n-\tCopy of your SAT/ACT.\n-\tOPTIONAL three (3) pages of supplemental information. This information can be anything that would enhance your application, such as an original essay, another letter of recommendation, etc... \n\n\n1-844-424-4737 or 410/854-4725 \n(For the phone menu options, please select Student Programs and then Stokes) \n\nAll positions in the National Security Agency are in the excepted service. \n\nU.S. Citizenship is required for all applicants. A security clearance must be granted prior to employment and you will be required to undergo extensive pre-employment processing. This includes: aptitude testing; an interview with a psychologist and a security interview conducted with the aid of a polygraph; and a personnel interview. The final stage of processing will be successful completion of a background investigation. \n\nReasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. \n\nThe NSA is committed to cultural diversity in its workplace. \nWe are an Equal Opportunity Employer.\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility. '",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The National Security Agency (NSA) is currently accepting applications from across the country for the Stokes Educational Scholarship Program. This tuition assistance program is looking for high school seniors who are interested in pursuing degrees in Computer Science, Mathematics, Cybersecurity, and Computer or Electrical Engineering.\n\nThis program provides a tremendous opportunity to gain valuable experience in STEM opportunities around the agency and an annual salary. Selected participants will also receive up to $30,000 for tuition and mandatory educational fees per academic year. Eligible students that is traveling over 75 miles from school to NSA, will receive housing and travel benefits while working at NSA during the summer.\n\nA position in the Stokes Educational Scholarship Program means you will attend classes full-time at the college of your choice in the U.S., and then work during the summer at NSA for a minimum of 12 weeks in areas that are related to your course of study.",
    "jobQualifications": null,
    "jobQualificationsExt": "While the eligibility requirements for our Stokes Program are subject to change from year to year, below you will find our basic prerequisites. **Please Note: If you have a full scholarship for college, you are ineligible to apply for the Stokes Program. **\n\nHigh School Seniors (applying for Computer Science, Mathematics, Cybersecurity, and Computer or Electrical Engineering):\n-\tU.S. Citizenship \n-\tPreferred GPA of 3.0 or above on a 4.0 scale \n-\tDemonstrated leadership abilities\n-\tMinimum SAT score of 1200 (600 Evidence-Based Reading and Writing, 600 Math), or ACT score of 25, or equivalent College Board Score (if taken)\n\nFor Computer Science, Computer Engineering, and Electrical Engineering: High School transcripts must show a minimum of one Physics or Calculus course, and a combination of two courses (minimum) of either Computer Science, Computer Programming or Engineering.\n\nFor Mathematics: High School transcripts must show one Physics AND one Calculus course, and a combination of two courses (minimum) of either Computer Science, Computer Programming or Engineering.\n\nFor Cybersecurity: High School transcripts must show a minimum of three years of coursework in cybersecurity or computer science.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "If you are selected as a program participant, you are required to work in your area of study at NSA after your college graduation for at least one-and-a-half times your length of study. If you resign from the Stokes Educational program prior to satisfying your commitment, you will be required to pay back the government for your tuition and mandatory educational fees.  Students accepted into the program must maintain at least a 2.75 GPA on a 4.0 scale each semester/quarter in the freshman year and a 3.0 GPA on a 4.0 scale each semester/quarter after the freshman year.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Stokes Educational Scholarship Program - STEM (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salary: $34,803 annually (GG 2 Step 1)",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ae",
    "jobNumber": "1235239",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "fullDescription": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "grade": "03/1 to 07/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "P",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-31T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: To be considered for our Co-op positions, you must submit a COMPLETE application package by 31 October. Your application package must include: \n\n1. Unofficial transcript with a traditional grading scale (GPA)\n2. PDF copy of your current resume\nIf your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcripts to CoopHiring@uwe.nsa.gov as an attachment.  Please do not send HTML transcripts accessible via a website or text versions thereof. \n\nDEADLINE: Applications are accepted 1 September - 31 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "jobQualifications": null,
    "jobQualificationsExt": "Only applicants that meet the following qualifications will be considered:\n  \n'\tMust be a U.S. Citizen\n'\tMust be pursuing the following majors: Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track), Data Science, or Mathematics. \n'\tMust be a second semester college freshman or a college sophomore\n'\tPreferred cumulative GPA of 3.0 or higher for all college work completed\n'\tMust be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n'\tMust be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and March 2025",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA's Cooperative Education (Co-op) Program at Fort Meade, MD offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure. These Co-op opportunities are open to students who are majoring in Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track), Data Science, or Mathematics. Right from the start, you will be involved in real life projects and will have full use of NSA labs, equipment, and advanced technologies. These areas will offer you increasing challenges and satisfying learning experiences, since our mission demands that we work on the cutting edge of technology. The full listing of each Co-op description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.\n\nProgram Details: \n'\t52 weeks of alternating semesters of school and work at NSA \n'\tSubsidized student housing and travel entitlements during work tours if over 75 miles from Fort Meade, MD \n'\tTuition reimbursement for one technical course per semester (up to $2,500)\n'\tAlthough not guaranteed, potential full time employment following successful completion of the program\n\n***PLEASE NOTE:  As this program requires students to rotate between semesters of work and study, applicants are encouraged to discuss the possibility of participating in this type of program with their school (Academic Advisor, Co-Op Advisor, Registrar and/or Financial Aid Office, etc.) to determine the effect it may have on their full time student status during scheduled work tours as well as any effects it may have on scholarships and financial aid.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cooperative Education Program (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salaries are determined by the percentage of credits completed toward a degree. Each 20% block of credits completed with at least a 3.0 GPA will allow you to be promoted to the next grade. Grades range from GGD-03/05 to GGD-07/01, which equates to $40,739-$55,924 annually. Due to the rotational nature of the Co-op program, students are paid proportionate to the number of weeks worked in a year and are authorized Leave without Pay during scheduled school rotations. The salaries aforementioned include a locality based comparability payment.\n\nStudents will receive annual leave, sick leave and paid federal holidays.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0bf",
    "jobNumber": "1235787",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computer. The program provides hands-on work experience from August-June for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "fullDescription": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computer. The program provides hands-on work experience from August-June for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "grade": "01/1 to 01/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "H",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Part-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Students must apply online at www.intelligencecareers.gov/NSA from September 1, 2024 ' October 1, 2024. \n\nApplications received after the deadline, as well as incomplete packets, will not be considered. \nStudents must also email the following documents to NSAG_HCO@nsa.gov \n\n-\tOne Student Evaluation form (Can email NSAG_HCO@nsa.gov to request student evaluation form or they can get the form from their High School Work-Based Learning Coordinator)\n-\tOfficial transcript from High School (MUST include their junior year work in progress courses for both first and second semester.)\n-\tResume (Must include the relevant courses completed or in progress and must include the position to which you are applying.)\n\nTo apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing. \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information. \n\nThe NSA is committed to cultural diversity in its workplace. \n\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in business and computer. The program provides hands-on work experience from August-June for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "jobQualifications": null,
    "jobQualificationsExt": "- Must be 16 years of age by 31 December 2024.\n- Must be eligible to be granted a Security Clearance.\n- Must be a U.S Citizen \n- Unweighted GPA of 2.5 on a 4.0 scale\n- Must be a High School Junior \n- Must have reliable transportation \n- Complete at least two of the following course work; business course, technical computer course, computer technology, engineering, graphic arts, manufacturing, construction, Chinese language, or humanities prior to the completion of the junior year. Courses preferred are Microsoft Applications, Keyboarding, Software Applications, Advanced Applications, Advance English, Advance Humanities, Language courses, Computer Skills for Academic Success/preferred Technical Computer courses are Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++). Applicants who have not completed one of these courses will not be considered for a position in the program.\n\nAvailable Positions within the HSWS Program (Fort Eisenhower, GA Only):\n\nOffice Assistant- Type, file, maintain records, answer phones and operate business equipment such as word processors and personal computers. Applicant must complete a minimum of one business or non-technical computer course (such as Microsoft Applications, Keyboarding, Software Applications, Advanced Applications, Computer Skills for Academic Success, etc.) prior to the completion of their junior year of high school, or they will not be considered for a position in the HSWS Program.  This will be verified on the transcript at the end of the junior year.\n\nComputer Aide - Operate our data processing equipment, often the most sophisticated equipment on the market.  These positions are geared towards those students who are in STEM focused courses or have completed a minimum of two technical computer courses (such as Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++, etc.) by the end of their junior year of high school.  This will be verified on the transcript at the end of the junior year.\n\n-\tEngineering Specialist/Tech\n-\tPrinting/Graphic Arts & Model Shop\n-\tFacilities/Logistics\n-\tChinese Language\n-\tIntelligence Analysis Aide\n\nATTENTION - Applicants are not guaranteed to be placed in the position/area they select.  The HSWS Program Manager will review the application materials and will make the final determination as to which position best utilizes the applicant's skills.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "HIGH SCHOOL WORK STUDY PROGRAM \n\nThe National Security Agency's (NSA) High School Work Study (HSWS) Program application is open only to high school juniors who are enrolled in the areas of business, computer technology, engineering, graphic arts, manufacturing, construction, Chinese language or humanities, and who plan to participate in a school-sponsored Work Experience Program during their senior year.   \n\n**Program is subject to change**\n\nAPPLICATION INFORMATION: \n\nTo apply, students must apply online at www.intelligencecareers.gov/NSA. Student must also email their resume, student evaluation, and office high school transcripts showing their junior year work in progress classes to NSAG_HCO@nsa.gov. Students also need to check with their High School Work-Based Learning Coordinator to determine the school's application process.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High School Work Study Program - Georgia",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Students will be on a Grade and Step Scale.  All work studies are a Grade 01 Step 01. High School Work Study students are on a part-time schedule and make approximately $15.00 per hour (in Georgia). \n\nStudents will earn Annual Leave and Sick Leave at a rate of one hour of Annual Leave and one hour of Sick Leave for every twenty hours worked. \n\nStudents are to work Monday ' Friday, minimum of 4 hours a day, 5 days a week. Report times are between the hours of 10:00 am and 1:00 pm with core work hours from 12:30 pm to 2:30 pm.  The maximum number of hours a student may work per week is 32 hours.",
    "location": "Fort Gordon, GA",
    "locationArea": "215",
    "locationFull": "Fort Eisenhower, GA",
    "locationSpecificId": "L215",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0c0",
    "jobNumber": "1235793",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in computer and Chinese language. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "fullDescription": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in computer and Chinese language. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "grade": "01/1 to 01/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "H",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Part-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Online applications must be submitted by 1 October. Applications received after the deadline, as well as incomplete packets, will not be considered. \n\nStudents must also submit the following material via email to HSWS_Utah@uwe.nsa.gov by 1 October:\n\n(1) One Student Evaluation form, please send an email to HSWS_Utah@uwe.nsa.gov to request form.\n(2) Official transcript from High School, which MUST include their junior year work in progress courses for both first and second semester. \n(3) Resume- Must include the relevant courses completed or in progress as well as the position (Chinese Language or Computer Aide) to which you are applying. \n\nEarly Acceptance Incentive\nApplications are accepted 1 September - 1 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as practical to allow sufficient time for review and security clearance processing.\n\nYou may call the Utah HSWS point of contact on 801-445-0605 for questions regarding the program.\n\nTo apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\nPlease note that you may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing. \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information. \n\nThe NSA is committed to cultural diversity in its workplace. \n\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in computer and Chinese language. The program provides hands-on work experience from September-August for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "jobQualifications": null,
    "jobQualificationsExt": "- Must be 16 years of age by 31 December 2024\n- Must be eligible to be granted a Security Clearance.\n- Must be a U.S Citizen \n- Unweighted GPA of 2.5 or higher is preferred \n- Must be a High School Junior \n- Must have reliable transportation \n- Must complete or be enrolled in a minimum of one Technical Computer course or two Chinese language courses prior to the completion of the junior year (preferred Technical Computer courses are Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++/preferred Language courses are Intermediate Chinese or above).\n\nChinese - Students who are currently enrolled in advanced Chinese courses (Chinese 5 or higher). They will be required to use their Chinese language skills to perform daily duties. Students need to be excelling in their Chinese reading, writing and listening skills.\n\nComputer Aide - Operate our data processing equipment, often the most sophisticated equipment on the market.  These positions are geared towards those students who are in STEM focused courses or have completed a minimum of two technical computer courses (such as Computer Science, Visual Basic, Java, Web Page Design, Intro to Engineering and Programming C++, etc.) by the end of their junior year of high school.  This will be verified on the transcript at the end of the junior year.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "HIGH SCHOOL WORK STUDY PROGRAM \n\nThe National Security Agency's (NSA) High School Work Study (HSWS) Program application is open only to high school juniors who are enrolled in Technical Computer or Chinese Language courses, and who plan to participate in a school-sponsored Work Experience Program during their senior year.  \n\n**Program is subject to change**\n\nAPPLICATION INFORMATION: \n\nTo apply, students must check with their High School Work Experience Coordinator to determine the school's application process as well as specific course requirements for their school.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High School Work Study Program - Utah",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Students will be on a Grade and Step Scale.  All work studies are a Grade 01 Step 01. High School Work Study students are on a part-time schedule and make approximately $15.00 per hour in Utah.\n\nStudents will earn Annual Leave and Sick Leave at a rate of one hour of Annual Leave and one hour of Sick Leave for every twenty hours worked. \n\nStudents are to work a Monday - Friday work schedule.  All students must work a minimum of 4 hours each day, 5 days a week, Monday through Friday.  Report times are between the hours of 10:30 am and 12:30 pm with core work hours from 12:30 pm to 2:30 pm.  The maximum number of hours a student may work per week is 32 hours.",
    "location": null,
    "locationArea": "1257",
    "locationFull": "Hill AFB, UT || Draper, Utah, UT || Utah Data Center (UDC), UT",
    "locationSpecificId": "49A",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0c5",
    "jobNumber": "1235797",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "fullDescription": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "grade": "04/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "R",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the `Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the `Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.\n\n***PLEASE NOTE: To be considered for our Summer Internships, you must submit a COMPLETE application package by 1 October for all Summer Internship Programs. Your application package MUST include:\n\n1. Official transcript (unofficial will be accepted if legible) - file name = LAST_FIRST_TRANSCRIPT\n2. At least 1 letter of recommendation from a faculty member or supervisor who can speak directly to your educational background - file name = LAST_FIRST_LOR\n3. PDF copy of your current resume - file name = LAST_FIRST_RESUME\nOptional: Cover Letter listing your interest in NSA's Summer Internships - file name = LAST_FIRST_COVER\n\nIMPORTANT: Your application is not considered complete until the 3 items listed above have been emailed to SummerInterns@uwe.nsa.gov in addition to your online application.  Any incomplete package will NOT be considered.\n\nREMINDER: You could be contacted and/or considered for more than one specific internship.\n\nDEADLINE: Applications are accepted 1 September - 1 October; however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nCONTACT INFORMATION: If you have any questions about NSA Summer Internships, please contact us at SummerInterns@uwe.nsa.gov or call us at 410-854-4726.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "jobQualifications": null,
    "jobQualificationsExt": "To be accepted into a NSA Summer Internship - candidates must:\n\n- Must be a U.S. Citizen\n- Must be enrolled in a degree-seeking program (undergraduate, graduate, doctorate) at time of application\n- Specific education requirements vary by program\n- Preferred cumulative GPA of 3.0 or higher\n- Must be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n- Must be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and\nMarch 2025\n\nPLEASE NOTE: You may be required to complete an Unproctored Internet Testing (UIT) requirement measuring cognitive ability, motivation, and English proficiency.\n\nFor NSAs Summer Language Program, no specific major is required, but the following language proficiencies are recommended:\n- Arabic\n- Mandarin Chinese\n- Persian Farsi\n- African Languages",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The NSA Summer Internship Program at our San Antonio, TX location offers students exciting, impactful professional work opportunities (with pay and limited benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.  These summer internship opportunities are open to students who are pursuing education in a variety of degree programs.\n\nNSA currently offers more than 30 Summer Intern Programs in a variety of fields to include: Computer Science, Mathematics, Cybersecurity, Engineering, Intelligence Analysis, Language, Business, Human Resources, Security & Counterintelligence, Strategic Communications, Psychology and Signals Intelligence. When applying to this ad you will be considered for all Summer Internship Programs and may be selected to process for more than one for Summer 2025. The full listing of each internship description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Summer 2025 Internship Program - Texas",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "- Students are paid a competitive salary commensurate with their education level.\n- All internships are 10 - 12 weeks during the summer.\n- Receive annual leave, sick leave and paid federal holidays.\n- Students who attend school in excess of 75 miles from San Antonio, TX are eligible for travel entitlements of a round trip airfare ticket to and from school or mileage reimbursement up to the cost of a government-issued airline ticket.\n- Daily transportation to and from work is NOT provided. Students participating in the program are highly encouraged to bring a vehicle. Carpooling with other students MAY be available, but is NOT guaranteed.\n- Participation in agency-wide extracurricular programs.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD || San Antonio, TX",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ca",
    "jobNumber": "1235819",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "fullDescription": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "grade": "04/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "R",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the `Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the `Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.\n\n***PLEASE NOTE: To be considered for our Summer Internships, you must submit a COMPLETE application package by 1 October for all Summer Internship Programs. Your application package MUST include:\n\n1. Official transcript (unofficial will be accepted if legible) - file name = LAST_FIRST_TRANSCRIPT\n2. At least 1 letter of recommendation from a faculty member or supervisor who can speak directly to your educational background - file name = LAST_FIRST_LOR\n3. PDF copy of your current resume - file name = LAST_FIRST_RESUME\nOptional: Cover Letter listing your interest in NSA's Summer Internships - file name = LAST_FIRST_COVER\n\nIMPORTANT: Your application is not considered complete until the 3 items listed above have been emailed to SummerInterns@uwe.nsa.gov in addition to your online application.  Any incomplete package will NOT be considered.\n\nREMINDER: You could be contacted and/or considered for more than one specific internship.\n\nDEADLINE: Applications are accepted 1 September - 1 October; however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nCONTACT INFORMATION: If you have any questions about NSA Summer Internships, please contact us at SummerInterns@uwe.nsa.gov or call us at 410-854-4726.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "jobQualifications": null,
    "jobQualificationsExt": "To be accepted into a NSA Summer Internship - candidates must:\n\n- Must be a U.S. Citizen\n- Must be enrolled in a degree-seeking program (undergraduate, graduate, doctorate) at time of application\n- Specific education requirements vary by program\n- Preferred cumulative GPA of 3.0 or higher\n- Must be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n- Must be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and\nMarch 2025\n\nPLEASE NOTE: You may be required to complete an Unproctored Internet Testing (UIT) requirement measuring cognitive ability, motivation, and English proficiency.\n\nFor NSAs Summer Language Program, no specific major is required, but the following language proficiencies are recommended:\n- Arabic\n- Mandarin Chinese\n- Persian Farsi\n- African Languages",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The NSA Summer Internship Program at our Denver, CO location offers students exciting, impactful professional work opportunities (with pay and limited benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.  These summer internship opportunities are open to students who are pursuing education in a variety of degree programs.\n\nNSA currently offers more than 30 Summer Intern Programs in a variety of fields to include: Computer Science, Mathematics, Cybersecurity, Engineering, Intelligence Analysis, Language, Business, Human Resources, Security & Counterintelligence, Strategic Communications, Psychology and Signals Intelligence. When applying to this ad you will be considered for all Summer Internship Programs and may be selected to process for more than one for Summer 2025. The full listing of each internship description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Summer 2025 Internship Program - Colorado",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "- Students are paid a competitive salary commensurate with their education level.\n- All internships are 10 - 12 weeks during the summer.\n- Receive annual leave, sick leave and paid federal holidays.\n- Students who attend school in excess of 75 miles from Denver, CO are eligible for travel entitlements of a round trip airfare ticket to and from school or mileage reimbursement up to the cost of a government-issued airline ticket.\n- Daily transportation to and from work is NOT provided. Students participating in the program are highly encouraged to bring a vehicle. Carpooling with other students MAY be available, but is NOT guaranteed.\n- Participation in agency-wide extracurricular programs.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Denver/Aurora, CO || Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0cb",
    "jobNumber": "1235821",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "fullDescription": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "grade": "04/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "R",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the `Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the `Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.\n\n***PLEASE NOTE: To be considered for our Summer Internships, you must submit a COMPLETE application package by 1 October for all Summer Internship Programs. Your application package MUST include:\n\n1. Official transcript (unofficial will be accepted if legible) - file name = LAST_FIRST_TRANSCRIPT\n2. At least 1 letter of recommendation from a faculty member or supervisor who can speak directly to your educational background - file name = LAST_FIRST_LOR\n3. PDF copy of your current resume - file name = LAST_FIRST_RESUME\nOptional: Cover Letter listing your interest in NSA's Summer Internships - file name = LAST_FIRST_COVER\n\nIMPORTANT: Your application is not considered complete until the 3 items listed above have been emailed to SummerInterns@uwe.nsa.gov in addition to your online application.  Any incomplete package will NOT be considered.\n\nREMINDER: You could be contacted and/or considered for more than one specific internship.\n\nDEADLINE: Applications are accepted 1 September - 1 October; however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nCONTACT INFORMATION: If you have any questions about NSA Summer Internships, please contact us at SummerInterns@uwe.nsa.gov or call us at 410-854-4726.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "jobQualifications": null,
    "jobQualificationsExt": "To be accepted into a NSA Summer Internship - candidates must:\n\n- Must be a U.S. Citizen\n- Must be enrolled in a degree-seeking program (undergraduate, graduate, doctorate) at time of application\n- Specific education requirements vary by program\n- Preferred cumulative GPA of 3.0 or higher\n- Must be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n- Must be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and\nMarch 2025\n\nPLEASE NOTE: You may be required to complete an Unproctored Internet Testing (UIT) requirement measuring cognitive ability, motivation, and English proficiency.\n\nFor NSAs Summer Language Program, no specific major is required, but the following language proficiencies are recommended:\n- Arabic\n- Mandarin Chinese\n- Persian Farsi\n- African Languages",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The NSA Summer Internship Program at our Oahu, HI location offers students exciting, impactful professional work opportunities (with pay and limited benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.  These summer internship opportunities are open to students who are pursuing education in a variety of degree programs.\n\nNSA currently offers more than 30 Summer Intern Programs in a variety of fields to include: Computer Science, Mathematics, Cybersecurity, Engineering, Intelligence Analysis, Language, Business, Human Resources, Security & Counterintelligence, Strategic Communications, Psychology and Signals Intelligence. When applying to this ad you will be considered for all Summer Internship Programs and may be selected to process for more than one for Summer 2025. The full listing of each internship description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Summer 2025 Internship Program - Hawaii",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "- Students are paid a competitive salary commensurate with their education level.\n- All internships are 10 - 12 weeks during the summer.\n- Receive annual leave, sick leave and paid federal holidays.\n- Daily transportation to and from work is NOT provided. Carpooling with other students MAY be available, but is NOT guaranteed.\n- Participation in agency-wide extracurricular programs.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "NSA/CSS Hawaii Kunia, HI || Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0d0",
    "jobNumber": "1235820",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "fullDescription": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "grade": "04/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "R",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-01T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the `Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the `Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov.\n\n***PLEASE NOTE: To be considered for our Summer Internships, you must submit a COMPLETE application package by 1 October for all Summer Internship Programs. Your application package MUST include:\n\n1. Official transcript (unofficial will be accepted if legible) - file name = LAST_FIRST_TRANSCRIPT\n2. At least 1 letter of recommendation from a faculty member or supervisor who can speak directly to your educational background - file name = LAST_FIRST_LOR\n3. PDF copy of your current resume - file name = LAST_FIRST_RESUME\nOptional: Cover Letter listing your interest in NSA's Summer Internships - file name = LAST_FIRST_COVER\n\n\nIMPORTANT: Your application is not considered complete until the 3 items listed above have been emailed to SummerInterns@uwe.nsa.gov in addition to your online application.  Any incomplete package will NOT be considered.\n\nREMINDER: You could be contacted and/or considered for more than one specific internship.\n\nDEADLINE: Applications are accepted 1 September - 1 October; however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nCONTACT INFORMATION: If you have any questions about NSA Summer Internships, please contact us at SummerInterns@uwe.nsa.gov or call us at 410-854-4726.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Join students from across the country and lend your knowledge to national security in one of NSA's over 30 summer internship programs. These 12 week paid programs run from mid-May to mid-August and are open to undergraduate freshman up to Ph.D. students depending on internship requirements. These internships are open to a wide variety of majors and give students the opportunity to work directly with mission-critical problems and experience the excitement of working directly in NSA spaces.",
    "jobQualifications": null,
    "jobQualificationsExt": "To be accepted into a NSA Summer Internship - candidates must:\n\n- Must be a U.S. Citizen\n- Must be enrolled in a degree-seeking program (undergraduate, graduate, doctorate) at time of application\n- Specific education requirements vary by program\n- Preferred cumulative GPA of 3.0 or higher\n- Must be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n- Must be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and\nMarch 2025\n\nPLEASE NOTE: You may be required to complete an Unproctored Internet Testing (UIT) requirement measuring cognitive ability, motivation, and English proficiency.\n\nFor NSAs Summer Language Program, no specific major is required, but the following language proficiencies are recommended:\n- Arabic\n- Mandarin Chinese\n- Persian Farsi\n- African Languages",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The NSA Summer Internship Program at our Augusta, GA location offers students exciting, impactful professional work opportunities (with pay and limited benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.  These summer internship opportunities are open to students who are pursuing education in a variety of degree programs.\n\nNSA currently offers more than 30 Summer Intern Programs in a variety of fields to include: Computer Science, Mathematics, Cybersecurity, Engineering, Intelligence Analysis, Language, Business, Human Resources, Security & Counterintelligence, Strategic Communications, Psychology and Signals Intelligence. When applying to this ad you will be considered for all Summer Internship Programs and may be selected to process for more than one for Summer 2025. The full listing of each internship description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Summer 2025 Internship Program - Georgia",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "- Students are paid a competitive salary commensurate with their education level.\n- All internships are 10 - 12 weeks during the summer.\n- Receive annual leave, sick leave and paid federal holidays.\n- Students who attend school in excess of 75 miles from Augusta, GA are eligible for travel entitlements of a round trip airfare ticket to and from school or mileage reimbursement up to the cost of a government-issued airline ticket.\n- Daily transportation to and from work is NOT provided. Students participating in the program are highly encouraged to bring a vehicle. Carpooling with other students MAY be available, but is NOT guaranteed.\n- Participation in agency-wide extracurricular programs.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort Eisenhower, GA || Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66d1dd9ab231b42178f1066d",
    "jobNumber": "1236975",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Leaders at the National Security Agency motivate, support, and cultivate employees at all levels. Leaders at the NSA, where people are a priority, are responsible for leveraging the diversity of their workforce to create innovative solutions that support the Agency's mission.",
    "fullDescription": "Leaders at the National Security Agency motivate, support, and cultivate employees at all levels. Leaders at the NSA, where people are a priority, are responsible for leveraging the diversity of their workforce to create innovative solutions that support the Agency's mission.",
    "grade": "01/1 to 02/6",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "G",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-09-29T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900002",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.\n\nThe selectee is subject to random drug and polygraph testing. This position requires a TOP SECRET clearance and SPECIAL BACKGROUND INVESTIGATION (SBI).\n\nApplicants who are already a Defense Intelligence Senior Level (DISL) leader must submit a copy of their most recent SF-50 and may also submit a copy of their certification as a DISL. Applicants who are already a Senior Leader (SL/ST/SP) must submit a 1-page write up of the 5th Technical Qualification (Leading the Intelligence Community) along with their most recent SF-50. All other applicants must submit a 3-page maximum write up addressing all five Technical Qualifications listed in the \"Qualifications\" Section of this advertisement. Failure to submit the documents described herein will result in your application being rejected.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-08-30T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "ES",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Leaders at the National Security Agency motivate, support, and cultivate employees at all levels. Leaders at the NSA, where people are a priority, are responsible for leveraging the diversity of their workforce to create innovative solutions that support the Agency's mission.",
    "jobQualifications": null,
    "jobQualificationsExt": "QUALIFICATIONS/EXPERIENCE:\n\nIn addition to the criteria below, the ideal candidate for this position will have demonstrated high standards of personal integrity, as well as independence and objectivity.  The leader should possess excellent judgement and be able to communicate effectively with senior military and civilian officials internal and external to the Agency.  The ability to convey critical, candidly, accurate and constructively to the highest levels of the Agency are essential.  Applicants should demonstrate most, if not all, of the following:\n\n-\tA current or prior Federal Unlimited Contracting Officer Warrant.\n-\tDefense Acquisition University (DAU) or Federal Acquisition Institute (FAI) certification in Contracting.   \n-\tExpert knowledge of principles of Federal contract law and contract formation, source selection procedures, government contract administration, and talent management.\n-\tSubstantive (>10 years) contracting experience and expertise, as well as knowledge of the entire acquisition process. \n-\tA proven, effective, highly motivated leader, with excellent interpersonal skills, professional judgment, business acumen, and a proven ability to work well across organizational boundaries. \n-\tStrong oral and written communication and interpersonal skills.\n-\tComfortable working in a high-tempo, dynamic organization, while managing a myriad of tasks with challenging deadlines.  \n-\tExperience in motivating a highly technical workforce and building high performing, innovative teams.\n\nWEIGHTED SELECTION CRITERIA (must be submitted in a separate document - no more than 3 total pages):\n\nSpecific Technical/Professional Achievements - 40 Points \n\nCandidates should have a strong record of personal technical and professional achievements.  Factor to be taken into consideration include but are not limited to:\n\n-\tCreating, developing, analyzing options, and applying the appropriate contracting solution.  Expertise and depth and/or breadth in the contracting field \n-\tDemonstrating expertise, competency, problem solving ability, and depth in relative contracting areas; \n-\tExperience in translating high-level vision into achievable strategies and results\n\nTechnical/Professional Development of Others - 25 Points \n\nCandidate should have a strong record of developing the skills and abilities of others, to include:\n-\tEncouraging participation in career development program and opportunities\n-\tEvidence of mentoring and providing career guidance\n-\tEvidence of initiating and supporting efforts to ensure the workforce has the knowledge, skills and abilities required to meet future challenges;\n-\tActively sharing technical knowledge through teaching and/or participating in various contracting forums; and\n-\tEffectively advocating for the workforce \n \nTechnical/Professional Leadership/Decision Making - 15 Points \n\nCandidate must be a creative, innovative thinker, and be able to effectively organize and plan, set priorities, lead strategy and process development, and successfully implement.  Factors to be taken into consideration include but are not limited to: \n-\tEvidence of personal contributions to planning, execution, decision-making, and/or resolution of issues.\n-\tEvidence of ability to initiate and sustain successful partnerships, alliances, and/or teaming activities; \n-\tEvidence of successful organizational representation and partnering/teaming with internal and external entities\n-\tEvidence of fostering and leveraging diversity as well as contributing to a culture that promotes collaboration and productivity.  \n\nContinued Technical/Professional Development - 10 Points \n\nCandidate should have a strong record of continuous enhancement of technical (e.g. contracting) and leadership skills and knowledge to include formal training, stretch assignments, researching and writing projects, and interaction with other contracting experts.  Factors to be taken into consideration include but not limited to: \n\n-\tSeeking opportunities to increase understanding of complex and highly technical subjects \n-\tBroadening of vision by acquiring expertise in other disciplines and seeking out diverse ideas, opinions and insights \n-\tOngoing education through participation in specific efforts to deepen technical expertise\n\nLeading the Intelligence Enterprise - 10 Points \n\nCandidates should be able to develop a broad viewpoint of the intelligence mission and an understanding of individual and organizational responsibilities in relation to the larger IC and DoD strategic priorities.  The perspective is shaped by experience and education and characterized by a strategic top-level focus on broad requirements, joint experiences, fusion of information, collaboration, and vertical and horizontal integration of information. Factors taken into consideration include but are not limited to:\n\n-\tEvidence of ability to collaborate and integrate by sharing information and knowledge, building collaborative networks, and integrating joint/multi-organization activities.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Serves in an official position of Defense Senior Executive Level Leader regardless of his/her organizational level.  Assures that the Agency achieves its mission by developing its major programs, goals, and plans.  Responsible for the overall success or failure of Agency programs and initiatives, and delegates program implementation tasks--the day-to-day or functional work activities--to mid-level managers.  Considers Agency goals and performance strategically, by setting the Agency's overall direction via its strategic plans.  As a result, often works with people and organizations outside his/her immediate organization--to include the Intelligence Community and the Department of Defense at large--to defend controversial or critical long-range NSA plans.  Provides authoritative advice, serves as NSA spokesperson, and is ultimately accountable for effective and efficient Agency operations and its compliance with policy (to include approving out-year budget documents).  Exhibits leadership competencies and behaviors for all to follow, as well as offers mentoring opportunities to subordinates to ensure the development of a cadre of future Senior Leaders.\n\nDUTIES AND RESPONSIBILITIES \n \n*Note this is a Senior Technical Leader/Defense Senior Intelligence Leader position.  All applicants must provide demonstrated evidence of the criteria during the interview process.\n\nThe Director, Business Management & Acquisition (BM&A) is seeking an experienced, innovative and business-savvy senior leader with extensive federal contracting experience and broad accomplishments, proven organizational leadership and outstanding problem solving and teaming skills to serve as the Deputy Chief of Contracting /Deputy Head of the Contracting Activity.\n \nAs a key member of the BM&A leadership team, the selectee will have substantial responsibilities related to acquiring and procuring goods and services for the Agency, in addition to the full range of the Office of Contracting management and planning functions.  Providing direct leadership to a multi-disciplined staff of professionals, the selectee will play a critical role in establishing a culture focused on innovation and inclusion by capitalizing on the strengths of the workforce to achieve mission outcomes.  Strategic thinking, strong business acumen, superior technical contracting knowledge, and exceptional inter-personal skills are essential in this role.\n\nSpecific responsibilities include, but are not limited to:\n\n-\tPartner with the Head of the Contracting Activity to lead the planning, execution and administration of contracts and agreements to enable the Agency's mission. \n-\tLead Contracting professionals working around the globe to ensure consistency in   acquisition practices/strategies, training, compliance with federal and state regulations, policies, etc.\n-\tContribute to strategy development and implementation for all NSA procurements. \n-\tApprove procurement decisions and documentation as necessary, in accordance with applicable laws and regulations to enable successful mission execution. \n-\tWork closely with partners throughout NSA, the Intelligence Community, DoD, and Industry to facilitate NSA's success.\n-\tServe as the Source Selection Authority (SSA) for significant competitive procurements.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Additional Desired Skills:\n\nLeading Change\nThe ability to bring about strategic change, both within and outside the organization, to meet the organizational goals. The ability to establish an organizational vision and to implement it in a constantly changing environment. Experience in fostering and leveraging diversity as well as contributing to a culture that promotes collaboration and productivity. \n\nLeading People\nThe ability to lead people toward meeting the organization's vision, mission, and goals. The ability to provide an inclusive workplace that fosters the development of others, facilitates cooperation and teamwork, and supports constructive resolution of conflicts. Candidate should have a strong record in developing the skills and abilities of others, actively sharing technical knowledge through teaching and/or participating in various contracting forums. \n\nResults Driven\nThe ability to meet organizational goals and customer expectations. The ability to make decisions that produce high-quality results by applying technical knowledge, analyzing problems, and calculating risk. Experience in creating, developing, analyzing options, and applying the appropriate contracting solution. Expertise and depth and/or breadth in the contracting field. \n\nBusiness Acumen\nThe ability to manage human, financial, and information resources strategically. \n\nBuilding Coalitions\nThe ability to build coalitions internally and with other Federal agencies, State and local governments, and nonprofit and private sector organizations to achieve common goals. The perspective is shaped by experience and education and characterized by a strategic top-level focus on broad requirements, joint experiences, fusion of information, collaboration, and vertical and horizontal integration of information.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Deputy Chief, Office of Contracting / Deputy Head of the Contracting Activity (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: DISL, Tier 2 (Up to $213,000)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible). Operational tempo may require extended hours and/or weekend duty. The selectee should be prepared to travel occasionally to meetings in the greater Washington, DC area.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-08-30T00:00:00.000Z"
  },
  {
    "_id": "66cf3d3ab231b42178df1ba3",
    "jobNumber": "1237048",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The Office of Occupational Health and Well-Being (OHWB), formally known as (OHESS) is the NSA Medical Center, which supports the mission by applying professional knowledge in Occupational Health, Environmental, Industrial Hygiene and Safety operating in accordance with all governing body regulations. OHWB personnel will provide clinical services, including emergency response, physical exams, immunizations, vision and preventative health screenings. Personnel will also provide technical, managerial, and administrative services to the entire workforce. Promoting, assessing and optimizing the health and safety of the NSA workforce and workplace is always priority.",
    "fullDescription": "The Office of Occupational Health and Well-Being (OHWB), formally known as (OHESS) is the NSA Medical Center, which supports the mission by applying professional knowledge in Occupational Health, Environmental, Industrial Hygiene and Safety operating in accordance with all governing body regulations. OHWB personnel will provide clinical services, including emergency response, physical exams, immunizations, vision and preventative health screenings. Personnel will also provide technical, managerial, and administrative services to the entire workforce. Promoting, assessing and optimizing the health and safety of the NSA workforce and workplace is always priority.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "D",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-09-12T23:59:59.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Medicl and Occupatnal Hlth",
    "jobFamilyId": "100100",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-08-29T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The Office of Occupational Health and Well-Being (OHWB), formally known as (OHESS) is the NSA Medical Center, which supports the mission by applying professional knowledge in Occupational Health, Environmental, Industrial Hygiene and Safety operating in accordance with all governing body regulations. OHWB personnel will provide clinical services, including emergency response, physical exams, immunizations, vision and preventative health screenings. Personnel will also provide technical, managerial, and administrative services to the entire workforce. Promoting, assessing and optimizing the health and safety of the NSA workforce and workplace is always priority.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Medical Technology, Life Sciences, Chemistry, or a related Biological Sciences field.\n\nEntry is with a Bachelor's Degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nRelevant experience must be in a clinical laboratory science area and include American Society for Clinical Pathology (ASCP) certification.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency Office of Occupational Health & Well-Being (OHWB) has an immediate opening for a Medical Technologist to support the mission by applying professional knowledge in the field of medical technology to advise on, supervise and/or perform phlebotomy, specimen processing, and/or clinical laboratory tests and examinations. Provide laboratory results to clients (both internal and external) as appropriate and maintain those records in accordance with laboratory governing body regulation.\n\nMedical Technologist's at the NSA responsibilities include:\n     - Performing laboratory testing (pre-analytical, analytical and post-analytical phases) in accordance with regulatory and accrediting agency requirements, to include phlebotomy.  \n     - Maintaining accreditations, performing quality control, quality assessment and laboratory safety functions.\n     - Performing administrative and operational support duties such as : coordinating or monitoring contract services such as for supplies and referred testing; assessing needs, planning for and implementing improvement programs in the laboratory; coordinating laboratory activities to ensure judicious utilization of total laboratory resources available; recommend equipment to purchase; creating and updating written standard operating procedures.  \n     - Properly identifying and processing specimens, evaluating specimen suitability, controlling the physical conditions of specimens, performing appropriate laboratory testing and/or specimen storage based on professional knowledge of specimen types, quality and resources available in the laboratory.\n     - Participating in training activities.\n     - Performing maintenance, calibration, reviewing of quality control and repairing of laboratory instrumentation, functioning as a key instrument operator independent of direct supervision. \n     - Recognizing and defining testing problems and reacting to indicators of malfunction, locating and implementing appropriate corrections.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal Medical Technologist candidate will possess a knowledge of the principles, theories and accepted practices of clinical laboratory sciences as they relate to the testing of human blood and bodily fluids.  \n     - American Society for Clinical Pathology (ASCP) certification required.\n     - Apply professional knowledge in the field of medical technology to advise on, supervise and/or perform phlebotomy, specimen processing and/or clinical laboratory tests and examinations.  \n     - Provide laboratory results to clients (both internal and external) as appropriate and maintain those records in accordance with laboratory governing body regulations.\n     - Must demonstrate full technical competence and independence; must have excellent organizational and communication skills as well as quality driven work ethics.  The ideal candidate is someone with a desire for continuous learning and strong problem-solving, communication (both oral and written) and interpersonal skills who is: \n     - Able to work effectively across several different functional areas in a collaborative environment\n     - Well-organized and able to handle multiple assignments\n     - Willing to take the initiative and embrace non-routine assignments\n     - Customer service skills\n     - Interpersonal skills\n     - Communications skills (written and oral)\n     - Able to utilize Word, Excel and PowerPoint to create, access and modify documents",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "ASCP Medical Technologist - Mid Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $128,956\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 7:00 a.m. and 3:30 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-08-29T00:00:00.000Z"
  },
  {
    "_id": "668e9fe9b231b421782201c3",
    "jobNumber": "1234272",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protects NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operates.",
    "fullDescription": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protects NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operates.",
    "grade": "12/1 to 13/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "2",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-09-13T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Law and Legal Services",
    "jobFamilyId": "100090",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the application and after any future updates to submitted applications. **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.\n\nEven if you have applied through your school's career services portal, you must also apply on www.intelligencecareers.gov/nsa. \n\nAFTER SUBMITTING YOUR ELECTRONIC APPLICATION, you will receive an email with instructions on how to submit the following supplemental information:\n\n-Cover letter/Statement of Interest\n-Professional resume\n-Legal writing sample (>10 pages)\n-Unofficial law school transcript \n-Past professional/academic references (up to three; include name, title, phone number, and email). \n\nThis email will come from a member of the OGC Hiring Team from an @uwe.nsa.gov account. If you do not receive this email within one week of submitting your application, contact \nOGC-Hiring_LHA@nsa.gov.\n\nYour application will NOT be considered if these supplemental documents are not received by the date noted in the email instructions.\n\nKey Dates\n\nWe anticipate reviewing applications and scheduling interviews on a rolling basis beginning in mid-August 2024.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-07-11T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The Office of General Counsel (OGC) is the exclusive NSA component responsible for providing legal services to all NSA elements. The Office of General Counsel protects NSA's interests concerning the legal and regulatory authorities, requirements, entitlements, obligations and oversight requirements under which the Agency operates.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed below are the minimum acceptable to be considered for the position. \n\nFULL PERFORMANCE\n\nGrade 12:\nEntry is with a Professional Law Degree - Bachelor of Laws or Juris Doctor (LL.B or J.D.).\n\nDegree must be a Professional Law Degree (LL.B. or J.D.). As a condition of their employment, Attorney Fellows must pass the bar exam within 1 year and establish active membership in the bar of the highest court of a State, U.S. commonwealth, U.S. territory, or the District of Columbia.\n\nSENIOR\n\nGrade 13:\nEntry is with a Professional Law Degree (LL.B. or J.D.) and active membership in the bar of the highest court of a State, U.S. commonwealth, U.S. territory, or the District of Columbia. \n\nTo be eligible for entry as a Grade 13, the attorney fellow shall have professional legal experience in excess of 2 years that is commensurate with the duties and responsibilities of the position, which can include completion of a 2-year judicial clerkship, or completion of a 1-year judicial clerkship and an LL.M. following law school, or completion of a 1-year judicial clerkship and LL.M and 1 year experience within the program.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency (NSA) Office of General Counsel (OGC) is looking for highly motivated entry-level attorneys with a commitment to public service to join its Legal Honors Program in the Fall of 2025. The Legal Honors Program is NSA OGC's exclusive entry-level attorney hiring program. The three-year program includes rotations in both operational and support practice areas. NSA OGC has eight legal practice groups, which provide legal advice on the full breadth of legal issues confronting NSA, including legislation, intelligence operations, cybersecurity, ethics, procurement, research and development, litigation, environmental law, patents, personnel security, and employment issues. \n\nNSA OGC is seeking superior Honors Program applicants who are interested in joining its exceptional team of lawyers who provide legal advice to the Agency as it carries out its critical national security missions. Attorneys working in NSA OGC apply their expertise, skills, and education to solve a variety of challenges not found in the private sector or at any other government agency. You will have the opportunity to make a global impact on a daily basis as you work with other top caliber professionals at the highest levels of the Agency and across the U.S. Government. This critical work ensures that Agency operations comply with the law while also protecting both our national security and our civil liberties. With appropriate training and supervision, NSA Honors Program attorneys are entrusted with immediate responsibility, working directly with clients and Agency leadership. Attorneys selected for the Legal Honors Program will also have special opportunities to attend high-level briefings, meetings, and congressional hearings on national security issues, liaise directly with intelligence community partners and other federal agencies, and tour facilities throughout the intelligence community, all while working under the guidance and mentorship of a senior attorney assigned to them from among the leadership of NSA OGC.\n\nThe twin missions of NSA - signals intelligence and cybersecurity - are two of the most important and dynamic challenges our Government faces today; therefore, there is rarely a typical day for an NSA attorney. At NSA OGC, you will analyze cutting-edge technical and intelligence issues and will frequently provide legal advice that relates to high-profile current events affecting our national security. In tackling these challenges, our attorneys work directly with senior officials at the Department of Justice's National Security Division, the Federal Bureau of Investigation, the Central Intelligence Agency, the National Security Council at the White House, the Office of the Director of National Intelligence, and the Department of Defense, as well as other agencies in the Executive Branch and relevant committees of Congress.\n\nNSA attorneys work in a highly classified setting and are entrusted with tremendous responsibility as they advise the Director and other senior leaders at the Agency on a diverse and complex spectrum of issues related to gathering the foreign intelligence information needed to fight international terrorism, espionage, transnational crime, and narcotics; defeating foreign cyber adversaries trying to steal national secrets; and providing intelligence support to critical military overseas tactical operations, all while protecting our civil liberties and ensuring strict compliance with the Constitution and our laws. Because the NSA is a Department of Defense agency, our attorneys have a unique opportunity to be directly involved in national security operations working alongside military and civilian colleagues, as well as to interact with the private sector in cybersecurity and other matters.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Applicants must be graduates of a law school accredited by the American Bar Association. New law school graduates must, within 14 months of the commencement of their employment, pass a bar examination and become duly licensed to practice as an attorney in a U.S. state, territory, or the District of Columbia. Applicants who are currently in a judicial clerkship or graduate law program must, prior to commencement of employment, be members in good standing of the bar of a U.S. state, territory, or the District of Columbia.\n\nSelections are made based on many elements of a candidate's background, including: strong academic achievement; law review or moot court experience; superior writing and communication skills; past employment; a demonstrated commitment to government service, leadership, legal aid, and clinical experience; and extracurricular activities.\n\nEligibility is limited to:\n-\tLaw students graduating at the end of 2024 (i.e., December 2024) or in the Spring of 2025 with no prior legal experience (other than summer associate or intern positions); or\n-\tLaw school graduates from 2023 or 2024 who are seeking their first legal position following a judicial clerkship or graduate law program that commenced immediately after law school graduation.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Attorney Fellow (Legal Honors Program) - Mid/Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salary offers are based on the candidate's education level and years of experience relevant to the position and also take into account information by the hiring manager/organization regarding the work role for the position. \n\nSalary ranges vary by work performance level.\n\nSalary Range: $99,200 - $153,354 (Full Performance/Senior)\n\nThis is a full-time position, Monday through Friday.\n\nOn-the-job training, internal NSA courses and external training will be made available based on the need and experience of the selectee.\n\nWork Schedule: Monday through Friday, with basic 8 hr/day work requirement between 0700 and 1800 (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-07-11T00:00:00.000Z"
  },
  {
    "_id": "667ece32b231b42178b4d79e",
    "jobNumber": "1233908",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "fullDescription": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "grade": "12/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "Q",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-09-30T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900001",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-06-28T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "jobQualifications": null,
    "jobQualificationsExt": "Applicants will be evaluated by hiring managers and assessed according to the position requirements. Qualified applicants must be either current Federal civilian retirees or be within 6 months of retirement from civilian Federal service.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Retired Federal civilian employees employed at the National Security Agency (NSA) provide expertise and corporate knowledge to temporarily support mission requirements, augment the existing work force, and/or mentor the next generation of Agency employees.\n\nPlease respond to the screening questions attached to this job posting. Your responses enable our hiring team to match your skills and experience to mission needs.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Retired Federal civilian employees are encouraged to apply so that your skills and experience can be reviewed according to current needs and requirements.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Retired Federal Government Civilian Employees (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary range varies by location, work level, and relevant experience to the position. \n\nWork Schedule: Part-time, flexible according to the mission needs and hiring organization.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-06-28T00:00:00.000Z"
  }
]
