[
  {
    "_id": "672e366db231b42178d7bcd1",
    "jobNumber": "1240755",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The Network Manager will play a unique role in enabling NSA to effectively execute its mission, supplying customers with advanced computing resources, and global networking.  The Network Manager assists in the planning, designing, managing the configuration, identifying network faults, restoring service after faults occur, and the performance and security of operational networks.",
    "fullDescription": "The Network Manager will play a unique role in enabling NSA to effectively execute its mission, supplying customers with advanced computing resources, and global networking.  The Network Manager assists in the planning, designing, managing the configuration, identifying network faults, restoring service after faults occur, and the performance and security of operational networks.",
    "grade": "13/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "N",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-24T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Cyber",
    "jobFamilyId": "100040",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-12T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The Network Manager will play a unique role in enabling NSA to effectively execute its mission, supplying customers with advanced computing resources, and global networking.  The Network Manager assists in the planning, designing, managing the configuration, identifying network faults, restoring service after faults occur, and the performance and security of operational networks.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Network Engineering, Systems Engineering, Information Technology or related field (e.g., General Engineering, Computer Engineering, Electrical Engineering, Computer Science, Computer Forensics, Cyber Security, Software Engineering, Information Assurance, or Computer Security).\n\nRelevant experience must be in using specialized test equipment and network analysis tools (e.g., ping trace-route, network management software, and loopbacks). Other experience can include network engineering (i.e., design/analysis of networks, routers, switches, firewalls, protocol), network system administration, or installing and configuring networks, routers, and firewalls.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 8 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 8 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The NSA is seeking highly competent Network Managers to oversee the design and maintenance of its network of specialized hardware, which includes high-performance computers (HPCs) and Graphics Processing Unit (GPU) servers. The selectee will be expected to provide a high level of service to a demanding workforce with specialized hardware and software needs (to potentially include large network storage hardware and networking infrastructure). Duties will include:\n\n- Collaborate with team members and help prioritize requests from researchers and mission organizations\n- Assist in the planning, design, and documentation of the compute, network, and storage environment\n- Oversee the installation, configuration, and maintenance of hardware and software, fault diagnosis, and restoration after faults.\n- Establish and maintain professional relationships with partnering network managers and system administrators, customers, and professional colleagues both internal and external to the Agency.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate will be comfortable working with network switches and firewalls, HPC and GPU systems, and customization of hardware and/or software components; recommending and scheduling security-related patches and ensuring compliance, at all times, with NSA's IT security, compliance, and oversight requirements; alerting system owners and Information Systems Security Officers to any security incidents or violations; and, examining network vulnerabilities and determining actions to mitigate them. Additional duties could include writing, editing, and maintaining network management documentation.\n\nHolding any network and security certifications is desired (i.e. Linux, CompTIA, CISSP, CCIE, CCDE, etc.).\n\nSpecific technical responsibilities and competencies include:\n\n-  Knowledge of computer operating systems, hardware, software, server and desktop visualization (to include HPC, GPU, Linux, and Windows)\n-  Troubleshooting networks (including network storage systems), computers, and peripheral devices to isolate causes of failures or problems\n-  Expertise with network communications and network security\n-  Proficiency in routers, switches, firewalls, and VPNs\n-  Serving as the primary contact for network and system performance, availability, and security\n-  Managing, monitoring, and controlling networks (to include security, fault management, configuration, performance, and accounting of computer systems, processes, and networks)\n-  Coordinating and directing recovery and restoration activities for IT services\n-  Consulting, tasking, and coordinating with external organizations to resolve network, system, server, or other problems\n-  Monitoring and maintaining integrity of data, reports, and interfaces in Information Technology (IT) systems\n-  Providing timely and accurate responses to requests for assistance, information, products, or services\n-  Working in a help desk environment.\n\nThe ideal candidate is a customer oriented individual with a networking background and experience with project and configuration management. The NSA is looking for a candidate that has excellent problem-solving, communication, and interpersonal skills.\n\nNon-Technical Competencies\n-  Complex problem solving \n-  Critical and analytical thinking\n-  Time management\n-  Customer service \n-  Initiative\n-  Organization\n-  Flexibility\n-  Balancing competing demands and multiple assignments.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Network Manager - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $129,239 - $187,662 (Senior)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-12T00:00:00.000Z"
  },
  {
    "_id": "672e366db231b42178d7bcd0",
    "jobNumber": "1240757",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The National Security Agency is seeking for results driven individuals that strive for excellence, enjoy the challenges of a fast paced environment and the desire to make a difference. We are looking for talented networking professionals to design, develop, deploy, sustain and monitor state-of-the-art network solutions (WAN, CAN, LAN, DCN and Satellite communications networks) that are deployed across NSA worldwide.",
    "fullDescription": "The National Security Agency is seeking for results driven individuals that strive for excellence, enjoy the challenges of a fast paced environment and the desire to make a difference. We are looking for talented networking professionals to design, develop, deploy, sustain and monitor state-of-the-art network solutions (WAN, CAN, LAN, DCN and Satellite communications networks) that are deployed across NSA worldwide.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "N",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-24T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Cyber",
    "jobFamilyId": "100040",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-12T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The National Security Agency is seeking for results driven individuals that strive for excellence, enjoy the challenges of a fast paced environment and the desire to make a difference. We are looking for talented networking professionals to design, develop, deploy, sustain and monitor state-of-the-art network solutions (WAN, CAN, LAN, DCN and Satellite communications networks) that are deployed across NSA worldwide.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.  \n\nDegree must be in Network Engineering, Systems Engineering, Information Technology or related field (e.g., General Engineering, Computer Engineering, Electrical Engineering, Computer Science, Computer Forensics, Cyber Security, Software Engineering, Information Assurance, or Computer Security).\n\nRelevant experience must be in network or system administration. Additional experience may be in one or more of the following: computer or information systems design/development, programming, information/cyber/network security, vulnerability analysis, penetration testing, computer forensics, information assurance or systems engineering. If not credited toward education requirement, completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course), Undergraduate Cyber Training (UCT), Network Warfare Bridge Course (NWBC)/Intermediate Network Warfare Training (INWT), Cyber Defense Operations will be considered towards the relevant experience requirement (i.e., 20-24 weeks course will count as 6 months of experience, 10-14 weeks will count as 3 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 5 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 5 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Network Professionals are hired into positions directly supporting a technical mission office.\n\nWe are hiring mid-level/experienced networking professionals with education and/or experience in several of the following areas:\n\n-\tMulti-vendor infrastructure platforms (i.e., Cisco, Brocade, Juniper, Arista)\n-\tNetwork encryption devices and WAN accelerators \n-\tMulti-vendor Layer 3 routing protocols (i.e., BGP, OSFP, EIGRP, IGRP, HSRP, VRRP) \n-\tVirtual Private Networking (i.e., MPLS, GRE, L2VPN, EVPN, Pseudowire, IPsec, MACSEC)\n-\tData center architectures and converged networks \n-\tCurrent networking trends, including commercial implementations of Software Defined Networks (SDN) for both Data Center Network and WAN applications\n-\tLoad balancing and Application Delivery Controller technologies and implementations \n-\tWAN architectures (i.e., Carrier Ethernet, Optical Fabrics (OTN), SONET)\n-\tNetwork monitoring tools (i.e., NetFlow Tracker, HP Network Node Manager, Cisco LMS, Cisco Call Manager, Wireshark, and Splunk)\n-\tNetwork Modeling (RiverBed/OPNet, NetSim)\n-\tNetwork Boundary (Next Generation Firewalls (Palo Alto, Cisco FIREPOWER), IPSEC/SSL VPN Concentrators)\n-\tCross Domain Solutions (SafeNet MDeX System, OWL Cyber Defense Cross Domain Solutions)\n-\tTechnical certifications (e.g., CCNA, CCNP, SEC+).",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with excellent problem-solving, communication and interpersonal skills who is/can:\n\n- Motivated \n- Flexible\n- Innovative\n- Work effectively in diverse environments \n- Well-organized \n- Handle multiple assignments\n\nOther desired skills and certifications:\n\n- Network Security\n- Network Routing and/or Switching\n- Risk Management Framework (RMF)\n- Certification (CCNA, CCNP, CCNA Security, CISSP, ISSP)\n- Computer Security\n- Threat analysis\n- Cybersecurity",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Network System Engineer - Mid Level (MD, HI, TX)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "NSA/CSS Hawaii Kunia, HI || Fort George G. Meade Complex, MD || NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-12T00:00:00.000Z"
  },
  {
    "_id": "6734cdeeb231b42178071566",
    "jobNumber": "1232721",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence.  You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application. Please do NOT populate the resume tool with 'see resume.' \n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence.  You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application. Please do NOT populate the resume tool with 'see resume.' \n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-26T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-12T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence.  You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application. Please do NOT populate the resume tool with 'see resume.' \n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nFor all listed degrees, if program is not ABET accredited, it must include specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\nFull Performance\n\nWith a degree in Engineering, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nOR\n\nWith a degree in a relevant professional technical field (for example physics, electronics, chemistry, architecture, computer science, mathematics, hydrology, geology), entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience. \n \nRelevant experience must be working in a mechanical design engineering capacity (for example, using 2D or 3D CAD tools, rapid prototyping machines, thermal design, tolerancing, or properties of materials, metallurgy, Industrial Control Systems (ICS)).",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The NSA currently has opportunities for highly motivated Mechanical Design Engineers to support design, analysis and fabrication of mechanical hardware and equipment in response to limited quantity, short-duration, prototype requirements. \n\nThe NSA is seeking Mechanical Design Engineers who have knowledge and experience in modeling or simulation software to evaluate designs and mechanical reverse engineering techniques and metrology.\n\nAs a Mechanical Design Engineer at NSA, responsibilities may include:\n\n-  Design custom parts, mechanisms and equipment.\n-  Perform engineering calculations.\n-  Analyze problems to determine technical solutions.\n-  Decide what procedures will be required to solve technical problems.\n-  Develop conceptual designs or models to address requirements.\n-  Use modeling or simulation software to evaluate designs.\n-  Perform engineering analyses and testing of products/parts/equipment.\n-  Use Computer Aided Design (CAD) software and Computer Aided Engineering (CAE) (thermal/stress/vibration analysis tools) to produce design drawings and to validate and support engineering design activities.\n-  Identify new and existing products, technologies, and/or manufacturing techniques to solve design, development, and operational problems.\n-  Develop engineering test plans to evaluate designs in real-world environment prior to operational use. \n-  Modify or adapt products, services, and support to meet customer needs.\n-  Provide timely and accurate responses to customer requests for assistance, information, products, or services.\n-  Work with customers to clarify their needs and to determine how their needs can be met expeditiously.\n-  Work on teams with engineers and fabricators of various disciplines and levels to meet customer mission needs.\n-  Work is in a very fast paced office which requires employees to work on multiple projects simultaneously with quick turn-around schedules.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application. Please do NOT populate the resume tool with 'see resume.'\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is extremely creative and has a desire for continual learning, along with excellent problem solving, analytic, and interpersonal skills. Customer service skills are a must.\n\nThe ideal candidate will have knowledge and experience in these areas:\n\n- Mechanical Reverse Engineering techniques and Metrology\n- Modeling or simulation software to evaluate designs\n\nAdditional knowledge and experience in one or more of the following areas is desired:\n\n-  Concepts, theories, and methods for designing and analyzing mechanical systems, structural assemblies, components, accessories, mechanisms and tools.\n-  Finite Element Analysis (FEA) and Computational Fluid Dynamics (CFD) tools to analyze designs and provide operational solutions.\n-  Additive Manufacturing, 3D Printing, and Rapid Prototyping technologies\n-  Injection Mold Design and Manufacturing.\n-  Composite Mold Design and Ply Schedule Optimization. \n-  Material identification and selection (plastics, composites and/or metals)\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application. Please do NOT populate the resume tool with 'see resume.' \n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Mechanical Design Engineer - Mid Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\n\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-12T00:00:00.000Z"
  },
  {
    "_id": "6724ee10b231b421788fc597",
    "jobNumber": "1240410",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-22T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-11T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree in any area is acceptable.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. A high school diploma or GED plus 7 years of experience; or an Associate's degree plus 5 years of experience; or at least 18 semester hours of military coursework/training plus 5 years of experience may be considered. Military coursework/training must be in hardware or software lifecycle maintenance or computer/network security.\n\nRelevant experience must include Linux and scripting (for example, Python, Bourneshell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), or computer/network security, or high performance computing.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. A high school diploma or GED plus 10 year of experience; or an Associate's degree plus 8 years of experience; or at least 18 semester hours of military coursework/training plus 8 years of experience may be considered. Military coursework/training must be in hardware or software lifecycle maintenance or computer/network security.\n\nRelevant experience must be in high performance computing, including tuning Linux, and automation through scripting (for example, Python, Bourneshell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), monitoring enhancements, or mitigating computer security vulnerabilities.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "High Performance Computing (HPC) Specialists maintain high performance computing ecosystems including identifying solutions to requirements for complex hardware and software computing infrastructure, data storage, and security.\n\nHPC Specialists play a vital role at NSA by providing life-cycle support for one or more unique computing systems including building, testing, monitoring, maintaining/repairing, security patching, or refreshing systems.\n\nHPC Specialists upgrade and decommission systems, re-configure systems, and optimize performance to meet the computing needs of internal customers and manage relationships with external vendors.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continual learning and who possesses strong interpersonal, communication (oral and written), and problem-solving skills, and is:\n\n- people focused\n- accountable\n- adaptable\n- detail-oriented\n- customer service & requirements oriented\n- able to work effectively in a collaborative environment\n- able to manage multiple tasks with competing timelines and deliverables\n\nRelevant experience must include Linux and scripting (for example, Python, Bourne shell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), or computer/network security, or high performance computing.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High Performance Computing (HPC) Systems Administrator/HPC Specialist - Mid to Experienced Level (Utah)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $72,553 - $158,860 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": null,
    "locationArea": "1257",
    "locationFull": "Draper, Utah, UT",
    "locationSpecificId": "49A",
    "postedDate": "2024-11-11T00:00:00.000Z"
  },
  {
    "_id": "6717c03cb231b421782ae34d",
    "jobNumber": "1239574",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA's Mathematics Research Group conducts world-class mathematical research with the objective of developing new and innovative techniques and technologies to support our Signals Intelligence and Cybersecurity missions, as well as the broader Intelligence Community (IC). We are actively seeking mathematicians to join our Mathematics Research Group. The Group focuses on mathematics research in the applications of a wide range of technical areas, including quantum computing, cryptanalysis, cryptography, vulnerability research, machine learning, statistical analysis, machine learning security, network defense, digital forensics, and graph algorithms.  The nature of NSA mathematics is highly computational; therefore, computer programing/scripting experience in one or more languages will be of great benefit to the ideal candidate.\n\nIn particular, the Mathematics Research Group is seeking candidates with experience in quantum computing research or development. Applicants with degrees in related fields such as Physics, Computer Science, and Data Science with demonstrated experience in quantum computing will be considered.  The ideal candidate will have experience performing research or development in quantum computing, either alone or with a team.\n\nThis vacancy will use a structured selection process.  Candidates will be required to undergo two structured interviews, one covering technical expertise in quantum computing and the other covering soft skills.  Candidates will also be required to present a seminar talk on quantum computing research or development work they have performed.",
    "fullDescription": "NSA's Mathematics Research Group conducts world-class mathematical research with the objective of developing new and innovative techniques and technologies to support our Signals Intelligence and Cybersecurity missions, as well as the broader Intelligence Community (IC). We are actively seeking mathematicians to join our Mathematics Research Group. The Group focuses on mathematics research in the applications of a wide range of technical areas, including quantum computing, cryptanalysis, cryptography, vulnerability research, machine learning, statistical analysis, machine learning security, network defense, digital forensics, and graph algorithms.  The nature of NSA mathematics is highly computational; therefore, computer programing/scripting experience in one or more languages will be of great benefit to the ideal candidate.\n\nIn particular, the Mathematics Research Group is seeking candidates with experience in quantum computing research or development. Applicants with degrees in related fields such as Physics, Computer Science, and Data Science with demonstrated experience in quantum computing will be considered.  The ideal candidate will have experience performing research or development in quantum computing, either alone or with a team.\n\nThis vacancy will use a structured selection process.  Candidates will be required to undergo two structured interviews, one covering technical expertise in quantum computing and the other covering soft skills.  Candidates will also be required to present a seminar talk on quantum computing research or development work they have performed.",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "M",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-23T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Math",
    "jobFamilyId": "100060",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-10T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA's Mathematics Research Group conducts world-class mathematical research with the objective of developing new and innovative techniques and technologies to support our Signals Intelligence and Cybersecurity missions, as well as the broader Intelligence Community (IC). We are actively seeking mathematicians to join our Mathematics Research Group. The Group focuses on mathematics research in the applications of a wide range of technical areas, including quantum computing, cryptanalysis, cryptography, vulnerability research, machine learning, statistical analysis, machine learning security, network defense, digital forensics, and graph algorithms.  The nature of NSA mathematics is highly computational; therefore, computer programing/scripting experience in one or more languages will be of great benefit to the ideal candidate.\n\nIn particular, the Mathematics Research Group is seeking candidates with experience in quantum computing research or development. Applicants with degrees in related fields such as Physics, Computer Science, and Data Science with demonstrated experience in quantum computing will be considered.  The ideal candidate will have experience performing research or development in quantum computing, either alone or with a team.\n\nThis vacancy will use a structured selection process.  Candidates will be required to undergo two structured interviews, one covering technical expertise in quantum computing and the other covering soft skills.  Candidates will also be required to present a seminar talk on quantum computing research or development work they have performed.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Mathematics, Physics, Engineering, Data Science, Computer Science, Statistics, or a related STEM field. Degree must include at least 24 semester credit hours (or 36 credit hours from universities on a quarter system) in advanced mathematics courses.\n\nRelevant experience must be in one or more of the following: the design, development, use, and evaluation of mathematics models, methods, or techniques (for example, algorithm development) to study issues and solve problems. Experience may also include, network engineering, computer science, physics, software engineering, electrical engineering.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree with no experience.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience.\n\nEXPERT\nEntry is with a Bachelor's degree plus 9 years of relevant experience, or a Master's degree plus 7 years of relevant experience, or a Doctoral degree plus 5 years of experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA conducts world-class research with the objective of developing new and innovative techniques and technologies to support our Signals Intelligence and Cybersecurity missions, as well as the broader Intelligence Community (IC). \n\nWe are actively seeking experienced mathematicians or physicists with subject matter expertise in quantum algorithms and/or quantum error correction to support NSA's and the US Government's strategic efforts in quantum computing. If you are interested in joining a dynamic team with a proven track record of developing impactful research results, then please apply for this position. Candidates will be expected to engage with the NSA and US government quantum computing efforts, identify important research problems within this space, and conduct research to support NSA and US government goals in quantum computing.\n\nCandidates must have research and/or development experience (beyond basic coursework) in quantum algorithms and/or quantum error correction.  Demonstrations of this record could include publishing in academic journals or delivering operational solutions to technical problems for customers from government or industry. A PhD is not required, although candidates must have acquired an advanced level of experience and mastery (beyond simply taking a few courses) in some area of quantum computing.  Demonstrated success with effective technical writing and the ability to explain results to a non-technical audience is desirable. Experience with at least one of the following programming languages and/or software packages is desirable: C/C++, Rust, Python, SageMath, MAGMA.\n\nThe ideal candidate will have a grounded background in mathematical tools, techniques, and theory, as well as a drive to apply that knowledge to complex and often ambiguous real-world situations.  The ideal candidate will also have the ability to prototype and implement solutions in computer code/scripting, and a desire to stretch outside their comfort zone in a career that offers lifelong learning opportunities.\n\nWhile the primary research focus for this position is quantum computing, candidates could also have the option to contribute to other mathematics research efforts of interest to NSA. These efforts involve a wide range of areas of mathematics, including linear algebra, number theory, probability, statistics, analysis, graph theory, or other areas of theoretical mathematics.  Other areas of interest include cryptomathematics, algorithm development, computer network security, and vulnerability analysis.  Interest in any of these areas is not required, but will be looked upon favorably.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Candidates must possess:\n\n- Research and/or development experience (beyond basic coursework) in quantum algorithms and/or quantum error correction\n- Strong problem-solving and analytical skills\n- Desire for continual learning\n- Ability to work effectively both independently and within diverse teams\n\nThe ideal candidate has excellent problem solving, communication, and interpersonal skills. The following knowledge and skills would also be useful:\n\n-\tKnowledge of mathematical concepts, principles, and theories and familiarity with other scientific and engineering disciplines \n-\tKnowledge of mathematics and related disciplines to design, develop and adapt scientific methods and technologies.\n-\tKnowledge of analytical techniques to develop, simulate, and analyze data.\n-\tKnowledge of computer operations and standard software applications. \n-\tAbility to conduct research, including studies, experiments, and investigations.\n-\tAbility to analyze data using appropriate tools. \n-\tAbility to analyze problems to determine technical solutions.\n-\tExperience creating computer algorithms, data models, and protocols.\n-\tAbility to identify new applications of known techniques.\n-\tAbility to analyze data using statistical methods. \n-\tAbility to analyze new algorithms and protocols.\n-\tExperience developing and applying mathematical or computational methods.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Applied Research Mathematician / Quantum Computing - Experienced to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $191,900 (Full Performance, Senior, Expert)\n\nSalary range varies by location, work level, and relevant experience to the position. This position is hiring for Maryland.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule: This is a full-time position, Monday ' Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).  Applicants should be aware that some of these jobs support 24/7 operations based on mission requirements and shift schedules may vary to include night shift.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-10T00:00:00.000Z"
  },
  {
    "_id": "672a41f1b231b42178b83d95",
    "jobNumber": "1240350",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence.  You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles.  The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural.  In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering.  Apply your science and engineering skills to protect the nation.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence.  You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles.  The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural.  In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering.  Apply your science and engineering skills to protect the nation.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-19T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-05T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence.  You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles.  The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural.  In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering.  Apply your science and engineering skills to protect the nation.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in either Engineering or a relevant technical field (for example, computer science, mathematics, or physics).\n\nFor all of the above degrees, if program is not ABET accredited, it must include specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i) computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\nRelevant experience must be in engineering systems over their lifecycle (for example, conception, design & development, testing, production, distribution/deployment, operation, maintenance & support, decommissioning).\n\nFULL PERFORMANCE\nWith an Engineering degree, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.  OR with a degree in a relevant technical field (for example, computer science, mathematics, or physics), entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience.\n\nSENIOR\n\nEntry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "With ever-accelerating technological advances and growing system complexity, a diverse and inclusive professional workforce of Systems Engineers builds, integrates, and optimizes complex systems and services. World-class technical professionals solve challenging systems engineering problems with unprecedented speed and scale utilizing innovative solutions. Systems engineers perform trade studies to generate and translate conceptual designs into technical specifications, participate in the evaluation of prototype hardware systems and software solutions, and integrate into the current architecture.  Backgrounds such as Cybersecurity, SIGINT, hybrid-cloud, machine learning (ML), artificial intelligence (AI), integrated network architecture, information technology infrastructure and hybrid-communications all have a place in the spectrum of implementations ranging from commercial/government off-the-shelf solutions to the development of new and unique technologies.\n\nMID-CAREER SYSTEMS ENGINEERS\n\nMid-career systems engineers have experience leading systems engineering efforts, and are ready to apply, or expand that knowledge in the Intelligence Community. These engineers have experience in specific lifecycle phases, as well as an understanding of the full lifecycle. They develop their expertise, grow their breadth of knowledge, and mentor the next generation of systems engineers. Mid-career systems engineers come from a wide variety of experiences such as Cybersecurity, SIGINT, communications, and systems of systems or networking infrastructure. These professionals are adept at communicating with technical teams, and making recommendations to senior leadership that drive mission initiatives.\n\nSENIOR SYSTEMS ENGINEERS\n\nSeasoned professionals drive the Agency's largest and most challenging technical projects to ensure success. These engineers participate in technical decision-making, or function in an advisory role. Working in collaborative teams, these professionals define and manage technical requirements throughout product lifecycle; identify and manage technical program risk; evaluate the architectural design for efficiency improvements; capture, analyze and recommend updates to the enterprise and mission architectures to ensure resiliency; design and enforce configuration management and interoperability standards; and define, manage and perform testing and evaluation. Senior Systems Engineers mentor other systems engineers in their tradecraft, which lays the foundation for future successes.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate demonstrates applicable knowledge or experience in a technical field with a familiarity of systems engineering practices and concepts in areas such as Cybersecurity, SIGINT, communications, telecommunications, data management, data processing, network architecture, or software design, development, and implementation. The ideal candidate has a desire for continual learning as well as excellent problem-solving, communication, and interpersonal skills.  Finally, ideal candidates are innovative and willing to share out-of-the box ideas, motivated to drive projects to completion, and able to work across different functional areas in a collaborative environment.\n\nKnowledge, skills, and experience in one or more of the following is desired: systems engineering principles such as technology/system readiness assessment, modeling and simulation, security design engineering, and developmental test and evaluation; systems architecture, framework, and standards. Systems Engineering Certifications (i.e., DAWIA Certification, INCOSE) are beneficial, but not required.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Systems Engineer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range:  $102,477 - $187,662 (Full Performance, Senior)\n\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-05T00:00:00.000Z"
  },
  {
    "_id": "67239c80b231b42178850636",
    "jobNumber": "1240369",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-18T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-04T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Electrical Engineering, General Engineering or Architectural Engineering. If program is not ABET accredited, it must include specified coursework.*  A degree in Engineering Technology will also be considered if it includes specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nRelevant experience must be working in an electrical engineering capacity (for example, UPS, switchgear, SCADA, transformers, substations, power panels, switchboards, and metering of power). Additionally, must have experience using NEC code and computer aided design and drafting, reading design drawings, and cost estimation. Experience may also include project management.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Be a part of our mission to protect the national security of the United States, and have a direct impact to enable success in Agency operations. As a Facilities Electrical Engineer, you will have the opportunity to work directly with mission customers to validate the requirements and unique needs to provide reliable technical solutions.\n\nWith the ever-changing industry and increase of technology complexities to accommodate our workforce, NSA's Installation & Logistics organization needs motivated Electrical Engineers to provide facilities design expertise, guidance, and support to the development and implementation of facilities solutions that enable capabilities that align with mission driven priorities. \n\nAdditionally, the Installations & Logistics organization is seeking Electrical Engineers with a focus or specialty in control and monitoring of electrical systems. Candidates with this specialty should be knowledgeable about or interested in learning about Supervisory Control and Data Acquisition (SCADA) and electrical control systems, electrical power systems, Schweitzer protective relays, Real-Time Automation Controllers (RTAC) as well as Programmable Logic Controllers (PLCs). Knowledge of the protocols used by these devices including mirrored bits, Modbus, DNP, and SNMP is desired.\n\nAs an Electrical Engineer at NSA, responsibilities may include:\n\n-  Prepare design and construction cost estimates.\n-  Development of designs for new and renovated facilities.\n-  Prepare engineering technical reports, specifications, and drawings.\n-  Provide construction detailing.\n-  Perform engineering analysis and calculations.\n-  Conduct code analysis.\n-  Project management.\n-  Facilities planning.\n-  Drafting of electrical plans and schematics.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate demonstrates the following:\n\n-  Problem Solving\n-  Interpersonal Skills\n-  Partnering\n-  Customer Service\n-  Accountability\n-  Continual Learning\n-  Resilience\n-  Effective Communication\n\nFor the monitoring and control system focus area, knowledge and experience in one or more of the following is desired:\n\n-  Supervisory Control and Data Acquisition (SCADA) and electrical control systems\n-  Implementation of relays and data aggregators\n-  Configuring and supporting Schweitzer Real Time Automation Controllers (RTAC)\n-  Evaluating and documenting PLC programs for electrical power control\n-  Relay protection design\n-  Applying concepts, principles, and methods for network connectivity (e.g. routing, switching, tunneling, and IP addressing)\n\nAdditional knowledge and experience in one or more of the following is desired:\n\n-  Technical software packages (e.g., AutoCAD, ETAP, SKM, CDEGS, ASPEN,  AGI32, Visual Lighting, MEGAMAN)\n-  Relay protection design\n-  Generators and plant control systems\n-  Uninterruptible Power Supply (UPS) systems\n-  Electrical distribution design and equipment (high voltage, medium voltage, low voltage)\n-  Electrical power system grounding and signal grounding\n-  Operation and design of SCADA and electrical control systems\n-  Emergency power systems\n-  Codes and standards (NFPA ' including NEC, UL, IEEE, etc.)\n-  Electrical schematics and blueprints\n-  Cost estimating\n-  Reliability and availability\n-  Startup and commissioning\n-  Electrical operations & maintenance\n-  Generators and plant control systems\n-  Uninterruptible Power Supply (UPS) systems\n-  Electrical distribution design and equipment (high voltage, medium voltage, low voltage)\n-  Emergency power systems\n-  Codes and standards (NFPA ' including NEC, UL, IEEE, etc.)\n-  Technical software packages (e.g., AutoCAD, ETAP, SKM, CDEGS, ASPEN, AGI32, Visual Lighting)\n-  Electrical schematics and blueprints\n-  Cost estimating\n-  Reliability and availability\n-  Startup and commissioning\n-  Electrical operations & maintenance",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Electrical Engineer - Facilities - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.  This position is hiring for Maryland.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-04T00:00:00.000Z"
  },
  {
    "_id": "6724ee10b231b421788fc594",
    "jobNumber": "1240399",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-15T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-04T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Computer Science (CS). Related fields (e.g., Engineering, Mathematics, Information Technology, Information Systems) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). \n\nRelevant experience must be in the design/development of computer or information systems and include engineering hardware and/or software over their lifecycle (i.e., requirements analysis, design, implementation, testing, integration, deployment/installation, and maintenance), programming, computer systems research, reverse engineering, and/or computer/network security. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Computer Systems Architects at NSA use commercial and government developed hardware, software, networking, and security products to:\n\n-\tdrive information technology projects\n-\tproduce compliance results for established project requirements and IT architecture  \n-\tmodernize IT architecture through analysis of research and introducing changes based on evolving project requirements\n-\tintegrate industry trends, emerging technologies and standards, and new vendor features  \n-\tcollaborate with experts in technical and application teams to identify, evaluate, and recommend technical solutions to support project requirements\n-\tdefine and analyze data requirements, mapping legacy data stores and formats to logical and physical data models \n-\tpropose standard ways for information transport between IT systems and stored within corporate knowledge databases\n-\tperform architectural alignment of the enterprise logical data model and physical data models",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is a self-starter with a desire for continual learning and strong problem-solving, analytic, and interpersonal skills who is able to: \n\n-\twork in a team environment \n-\tadapt to change\n-\tprovide innovative solutions\n-\tcommunicate effectively \n-\tmulti-task across multiple projects\n\nThe ideal candidate will also reflect specialized skill and experience in one or more of the following:\n \n-\tSystem administration with Windows, UNIX, and/or Linux\n-\tProgramming and scripting experience (e.g., C, C++, Java, Assembly, Python, Perl, Ruby, Bash, Node.js, Spark, Puppet, SALT, KAFKA, HADOOP)\n-\tDatabase design/development (e.g., NiFi, MongoDB)\n-\tNetwork protocols and hardware \n-\tVirtualization fundamentals\n-\tCloud architecture\n-\tSecurity architectures and appliances\n-\tFirewalls Boundary device solutions/architecture",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Computer Systems Architect - Mid Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-04T00:00:00.000Z"
  },
  {
    "_id": "6724ee10b231b421788fc596",
    "jobNumber": "1240405",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-16T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-04T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of High performance Computing professionals with HPC experience and strong LINUX skills to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree in any area is acceptable.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. A high school diploma or GED plus 7 years of experience; or an Associate's degree plus 5 years of experience; or at least 18 semester hours of military coursework/training plus 5 years of experience may be considered. Military coursework/training must be in hardware or software lifecycle maintenance or computer/network security.\n\nRelevant experience must include Linux and scripting (for example, Python, Bourneshell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), or computer/network security, or high performance computing.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. A high school diploma or GED plus 10 year of experience; or an Associate's degree plus 8 years of experience; or at least 18 semester hours of military coursework/training plus 8 years of experience may be considered. Military coursework/training must be in hardware or software lifecycle maintenance or computer/network security.\n\nRelevant experience must be in high performance computing, including tuning Linux, and automation through scripting (for example, Python, Bourneshell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), monitoring enhancements, or mitigating computer security vulnerabilities.\n\nEXPERT\nEntry is with a Bachelor's degree plus 9 years of relevant experience or a Master's degree plus 7 years of relevant experience or a Doctoral degree plus 5 years of relevant experience. A high school diploma or GED plus 13 years of experience; or an Associate's degree plus 11 years of experience; or at least 18 semester hours of military coursework/training plus 11 years of experience may be considered. Military coursework/training must be in hardware or software lifecycle maintenance or computer/network security. Degree in any area is acceptable.\n \nRelevant experience must be in high performance computing, including tuning Linux, implementing and optimizing system architecture plans, and automation through scripting (for example, Python, Bourneshell, PERL). In addition, it may also include improving hardware or software lifecycle activities (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), monitoring enhancements, or mitigating computer security vulnerabilities",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "High Performance Computing (HPC) Specialists maintain high performance computing ecosystems including identifying solutions to requirements for complex hardware and software computing infrastructure, data storage, and security.\n\nHPC Specialists play a vital role at NSA by providing life-cycle support for one or more unique computing systems including building, testing, monitoring, maintaining/repairing, security patching, or refreshing systems.\n\nHPC Specialists upgrade and decommission systems, re-configure systems, and optimize performance to meet the computing needs of internal customers and manage relationships with external vendors.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continual learning and who possesses strong interpersonal, communication (oral and written), and problem-solving skills, and is:\n\n- people focused\n- accountable\n- adaptable\n- detail-oriented\n- customer service & requirements oriented\n- able to work effectively in a collaborative environment\n- able to manage multiple tasks with competing timelines and deliverables\n\nRelevant experience must include Linux and scripting (for example, Python, Bourne shell, PERL). In addition, it may also include maintaining hardware or software over their lifecycle (i.e., requirements analysis, implementation, testing, integration, deployment/installation, and maintenance), or computer/network security, or high performance computing.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High Performance Computing (HPC) Systems Administrator/HPC Specialist - Mid to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $191,900 (Full Performance, Senior, Expert)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-04T00:00:00.000Z"
  },
  {
    "_id": "67224ae9b231b421787a439b",
    "jobNumber": "1239727",
    "OtherActivities": null,
    "agency": "NSA",
    "description": null,
    "fullDescription": null,
    "grade": "07/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "O",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-13T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900000",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": null,
    "jobQualifications": null,
    "jobQualificationsExt": null,
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency employs a diverse workforce that plays a critical role in protecting our nation's security every day. The NSA is seeking individuals with relevant Intelligence Community (IC) experience to support our mission. Previous NSA employees are highly encouraged to apply to this job posting. Applicants to this advertisement will be considered against the two skill areas that they chose in the screening questions and will be required to meet all applicable minimum qualifications. To determine the minimum qualifications associated with a particular vacancy, please review the relevant vacancy announcement.\n\nRetired Federal government employees are encouraged to apply directly to the \"Retired Federal Government Employees\" job posting so that we can consider your application as a reemployed annuitant. In addition, we suggest you contact the Office of Personnel Management should you have any questions regarding the impact of reemployment on your current benefits as a federal retiree.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "NSA corporately hires for many areas of consideration. Your responses to screening questions attached to this job posting will help us to guide you toward the area(s) that best fit your background/experience:\n\no Computer Science\no Corporate Officer\no Cybersecurity & Analysis\no Data Science\no Engineering and Physical Science\no Human Resources\no Language Analysis\no Mathematics\no Networking and Telecommunications \no Signals Analysis\n\nQualifications\n\nThe minimum qualifications against which the applicant will be evaluated derive from the skill area to which they are matched. In addition, the applicant must have previous experience working as a civilian employee or military affiliate in an Intelligence Community Agency.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Former Intelligence Community (IC) Professionals",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-01T00:00:00.000Z"
  },
  {
    "_id": "67239c80b231b42178850634",
    "jobNumber": "1240070",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-15T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-11-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nFor all 3 types of Microelectronics Engineers, the degree must be in Engineering, Physics, or Materials Science from an accredited college or university, or a relevant professional technical field (for example, microelectronics, semiconductor, chemistry, architecture, computer science, mathematics, hydrology, geology)\n\nFor all of the above degrees, if program is not ABET EAC accredited, it must include specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i) computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\n-------------------------------------------------------------------------------\n\nFOR MICROELECTRONICS PACKAGE DESIGN ENGINEER:\n\nSENIOR\nEntry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience. An Associate's degree plus 8 years of relevant experience may also be considered.  \n\nRelevant experience must be in one or more of the following: developing advanced microelectronics systems through the design of integrated circuits, custom multichip modules (MCMs), printed circuit boards (PCBs), high density redistribution layers, 3D multi-layer integrated technologies, or system enclosures using electronic design automation (EDA) tools.\n\n-------------------------------------------------------------------\n\nFOR MICROELECTRONICS PROCESS ENGINEER:\n\nSENIOR \nEntry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience. An Associate's degree plus 8 years of relevant experience may also be considered. \n\nRelevant experience must be in one or more of the following: assembly or fabrication process improvement of advanced microelectronics systems such as integrated circuit enclosures, custom multichip modules (MCMs), printed circuit boards (PCBs), high density redistribution layers, 3D multi-layer integrated technologies, or system enclosures.\n\n------------------------------------------------------------------------\n\nFOR MICROELECTRONICS TECHNOLOGY ENGINEER:\n\nFULL PERFORMANCE \nWith a degree in professional Engineering, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.  With a degree in either (1) Physics or Materials Science from an accredited college or university or (2) a relevant professional technical field (for example, microelectronics, semiconductor, chemistry, architecture, computer science, mathematics, hydrology, geology), entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience. \n\nRelevant experience must be in one or more of the following: characterization, test, reliability, or failure root cause analysis of advanced microelectronics systems such as integrated circuits, custom multichip modules (MCMs), printed circuit boards (PCBs), high density redistribution layers, 3D multi-layer integrated technologies, or system enclosures.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "With the ever-increasing technological complexities in the world of Microelectronics, we need talented Microelectronics Engineers to be part of our team designing, assembling, testing, and qualifying the next generation of electronics hardware in support of our mission. Our goal is to provide microelectronics services of the highest quality to ensure the success of the Agency's mission. \n\nMicroelectronics Engineers utilize electrical, computer, mechanical, and materials engineering knowledge and skills to design, assemble, test, analyze and qualify the next generation of electronics hardware in support of the NSA mission. \n\nThe National Security Agency (NSA) currently has opportunities for three types of Microelectronics positions: Microelectronics Package Design Engineer, Microelectronics Process Engineer, and Microelectronics Technology Engineer. \n\n1. A Microelectronics Package Design Engineer is focused on developing advanced microelectronics systems through the design of custom multichip modules (MCM), printed circuit board (PCB), high density redistribution layers, 3D multi-layer integrated technologies and/or system enclosures. Areas of responsibility can also include: \n\n-  Knowledge of Application Specific Integrated Circuit (ASIC) and Field Programmable Gate Array (FPGA) design \n-  Knowledge of Register Transfer Level (RTL) design including Verilog and VHDL \n-  Knowledge of Digital/Analog Logic design/simulation, functional verification, Design For Test (DFT), testability analysis \n-  Understanding and development of assembly specifications in accordance with industry standards \n-  Understanding and application of Signal Integrity (SI)/Power Integrity (PI)/Electro-Magnetic Integrity (EMI) Analysis methodologies for design \n-  Conduct research including studies, experiments, and investigations on new or alternate methodologies \n-  Enhance process design and development to support advanced assembly techniques such as Three Dimensional Interconnect (3DI) and Printed Electronics\n\n2. A Microelectronics Process Engineer is focused on assembly and fabrication of advanced microelectronics systems such as custom multichip modules (MCM), printed circuit board (PCB), high density redistribution layers, 3D multi-layer integrated technologies and/or system enclosures. Areas of responsibility can also include: \n\n-  Participate in assembly and fabrication process improvement efforts \n-  Conduct research including studies, experiments, and investigations on new or alternate methodologies, fabrication, and/or assembly equipment\n-  Enhance process and mature development of advanced assembly techniques such as Three Dimensional Interconnect (3DI) and Printed Electronics \n\n3. A Microelectronics Technology Engineer is focused on the test, failure, and physical analysis of advanced microelectronics systems such as integrated circuits, custom multichip modules (MCM), printed circuit board (PCB), high density redistribution layers, 3D multi-layer integrated technologies, and/or system enclosures. Areas of responsibility can also include: \n\n-  Conduct environmental and reliability tests \n-  High-pin-count Integrated Circuit (IC) design and operation validation \n-  Parametric testing - Accelerated testing / qualification / screening \n-  Develop test plans according to industry and military specifications \n-  Design and develop test platforms\n-  Support quality assurance efforts for developed and fielded systems\n-  Disassembly and sample preparation for physical analysis of ICs for failure analysis\n-  Perform scanning electron microscopy (SEM), low energy electrons microscopy (LEEM), and/or atomic force microscopy (AFM)\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Microelectronics Package Design Engineer Specialized Skills: \n\n-  Concepts, theories, and methods for designing, analyzing, testing, and integrating electrical and communications systems \n-  Designing analog and digital circuits (e.g., FPGAs, ASICs, PCBs) \n-  Use modeling/simulation to evaluate designs \n-  Experience using Electronic Design Automation (EDA) tools for ASIC and/or PCB design is required \n-  Applying engineering principles to perform printed circuit board layout \n-  Applying engineering principles to perform redistribution layer design and layout \n-  Applying engineering principles to perform 3D integration design and layout \n-  Application of the scientific principles, methods, and processes used to conduct research studies (e.g., study design, data collection and analysis, and reporting results) \n\nMicroelectronics Process Engineer Specialized Skills: \n\n-  Concepts, theories, and methods for designing, analyzing, testing, and integrating electrical and communications systems is desired \n-  Understanding of circuit design is desired (e.g., FPGAs, ASICs, PCBs) \n-  Understanding of modeling/simulation to evaluate designs is desired \n-  Experience using Electronic Design Automation (EDA) tools is desired \n-  Applying engineering principles to perform printed circuit board layout is desired \n-  Application of the scientific principles, methods, and processes used to conduct research studies (e.g., study design, data collection and analysis, and reporting results) \n-  Semiconductor or integrated circuit quality assurance and materials science/fabrication experience is preferred \n\nMicroelectronics Technology Engineer Specialized Skills: \n\n-  Concepts, theories, and methods for designing, analyzing, testing, and integrating electrical and communications systems \n-  Understanding of digital circuits designs and schematics (e.g., FPGAs, ASICs) \n-  Understanding of packaging and/or assembling processes for custom microelectronics (ASICs, FPGAs, PCBs) test and evaluation \n-  Use modeling/simulation to evaluate microelectronics designs for test \n-  Testing of integrated circuit devices, FPGAs and complex microelectronics systems \n-  Microelectronics design engineering including analog or digital logic design is desired. \n-  Experience using Electronic Design Automation (EDA) tools is desired \n-  Application of the scientific principles, methods, and processes used to conduct research studies (e.g., study design, data collection and analysis, and reporting results) \n-  Semiconductor or integrated circuit quality assurance and materials science/fabrication experience is desired \n-  Develop test plans for environmental and reliability evaluations \n-  Understanding of industry and military test and reliability standards is desired \n\nTechnical competencies for all three positions may include: \n\n-  Create and maintain documentation on technical information \n-  Operate specialized scientific and technical equipment \n-  Attend conferences and communicate with people in a particular technical field to keep abreast of new technologies and information \n-  Serve as a subject matter expert to support research and development efforts - Collaborate extensively with customers and develop requirements, project milestones, deliverables and reports \n-  Research emerging technologies for application(s) within the Agency \n-  Concepts, theories, and methods related to the composition, structure, and properties of materials, and the identification/processing of optimal materials for various uses \n-  Solving technical problems \n-  Translate conceptual designs into technical specifications \n-  Evaluate information in technical documents to understand its importance and significance \n-  Work with customers to clarify their needs and to determine how their needs can be met - Semiconductor or integrated circuit quality assurance \n-  Operate specialized scientific and technical equipment\n-  Conduct research including studies, experiments, and investigations on new or alternate methodologies\n-  Conduct research including studies, experiments, and investigations on new or alternate fabrication and assembly/disassembly equipment and analysis tools\n-  Participate in disassembly and/or physical analysis of microelectronics systems or integrated circuits and contribute to process improvement efforts\n-  Develop and apply new processes and techniques for the full die imaging and analysis of ICs\n-  Develop and apply new processes and techniques for full die processing and sample preparation of ICs through the use of polishing/lapping, wet chemistry, plasma etching, thin film coating, and optical metrology tools\n-  Use microscopy techniques such as scanning electron microscopy (SEM), low energy electron microscopy (LEEM), and/or atomic force microscopy (AFM)\n-  Develop new techniques and advanced processes for circuit edit, cross sectioning, and imaging for IC's using state of the art focused ion beam tools\n-  Develop IC failure analysis techniques\n\nThe ideal candidate is someone with excellent problem-solving, communication, and interpersonal skills who is: \n\n-  Motivated \n-  Creative \n-  Able to work effectively across several different functional areas in a collaborative environment \n-  Well-organized and able to handle multiple assignments \n-  Customer service and requirements focused \n-  Detail oriented",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Microelectronics Engineer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-11-01T00:00:00.000Z"
  },
  {
    "_id": "6721009fb231b42178702dd3",
    "jobNumber": "1240119",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Occupational Health and Well-Being Services (OHWB), Advocacy Services is seeking the ideal candidate to serve as a Sexual Assault Response Coordinator (SARC) within the NSA Sexual Assault Prevention and Response (SAPR) Program.  This position is focused on providing an immediate response and ongoing support for victims of sexual assault, and comprehensive education and training for the NSA at large on sexual assault awareness, prevention, and response.",
    "fullDescription": "Occupational Health and Well-Being Services (OHWB), Advocacy Services is seeking the ideal candidate to serve as a Sexual Assault Response Coordinator (SARC) within the NSA Sexual Assault Prevention and Response (SAPR) Program.  This position is focused on providing an immediate response and ongoing support for victims of sexual assault, and comprehensive education and training for the NSA at large on sexual assault awareness, prevention, and response.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "D",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-14T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Medicl and Occupatnal Hlth",
    "jobFamilyId": "100100",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-31T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Occupational Health and Well-Being Services (OHWB), Advocacy Services is seeking the ideal candidate to serve as a Sexual Assault Response Coordinator (SARC) within the NSA Sexual Assault Prevention and Response (SAPR) Program.  This position is focused on providing an immediate response and ongoing support for victims of sexual assault, and comprehensive education and training for the NSA at large on sexual assault awareness, prevention, and response.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nA degree in any field is acceptable.\n\nRelevant experience must include one or more of the following: work-life services, medical records, human resources, safety, industrial hygiene, or other occupational health-related environments (for example, drug deterrence, blood donor, wellness, smoking cessation, sexual assault victim advocacy). Experience must also include managing programs (any type).\n\nFULL PERFORMANCE\nEntry is with an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience.\n\nSENIOR\nEntry is with an Associate's degree plus 8 years of relevant experience, or a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "-\tDevelop and implement local policies and procedures in line with NSA and Department of Defense (DoD) directives, ensuring victim access to medical, mental health, and counseling services.\n -\tProvide 24/7 availability for victim advocacy services, ensuring coordination with medical, legal, and law enforcement personnel. Guide and support assigned Victim Advocates (VAs) for cohesive program accountability.\n -\tEnsure the prompt handling of reports, maintaining oversight throughout the process while ensuring confidentiality.\n-\tOversee Memorandums of Understanding (MOUs), Standard Operating Procedures (SOPs), and Memorandums of Agreement (MOAs) to meet victims' needs and compliance with organizational standards.\n-\tProvide immediate crisis intervention, emotional support, and safety planning for victims, guiding them through medical, investigative, and legal processes.\n-\tLead the development of training programs for SARCs, VAs, and other stakeholders. Coordinate outreach activities, including awareness programs during Sexual Assault Awareness and Prevention Month (SAAPM).\n-\tEnsure accurate and confidential data entry into the Defense Sexual Assault Incident Database (DSAID) and maintain compliance with regulatory requirements.\n-\tDevelop and implement strategic goals for the SAPR program, ensuring effective integration with installation objectives. Evaluate program effectiveness, recommending improvements for continued growth and success.\n -\tManage program budgets, ensuring alignment with goals\n-\tServe as a representative for the SAPR program in high-level engagements, advising leadership on policy implementation and programmatic objectives.\n-\tEmployee will be required to travel for TDYs or conferences relevant to sexual assault.\n-\tThis position requires a high degree of discretion in relation to sensitive information of which the incumbent is aware.\n-\tAble to serve in an \"on call\" duty status outside of normal work hours that includes remaining ready to perform work, manning enterprise cellphone, and remaining in a reasonable call back radius, staffing the 24/7 support helpline, as needed; regularly checking emails to respond to crises; and/or reporting to a designated place of duty to perform work.\n-\tEmployee may also be required to work other than normal duty hours, to include evenings, weekends, and holidays.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continuous learning and strong problem-solving who is (has):\n\n-\tNational Advocate Credentialing Program (NACP) with Intermediate or Advanced level of experience or DoD Sexual Assault Advocate Certification Program (D-SAACP) Level III or level IV Certification  \n-\tAbility to obtain and maintain DoD Sexual Assault Advocate Certification and recertification from the National Organization of Victim Assistance (NOVA), as specified by DoD.\n-\tCurrent state driver's license or the ability to obtain and maintain one.\n-\tComprehensive knowledge of a wide range of sexual assault laws, precedent decisions, policies, principles, and methods to carry out a program which fulfills these requirements.\n-\tKnowledge of DoD SAPR Policy to ensure compliance with DoD requirements.\n-\tTechnical knowledge of equal opportunity policies, sexual assault prevention and response, and skills to plan, organize, and carry out the SAPR program\n-\tAbility to plan, organize, and identify Agency problems and recommend courses of action.\n-\tSkilled in fact-finding, analysis of a wide range of programs to study broad topics related to sexual assault, problem solving and training needed assessment and skill in evaluating programs and study findings to develop policy and guidelines which will impact the Agency.\n-\tAbility to use moderate degree of discretion, independent judgment, initiative, tact and confidentiality.\n-\tSkill in oral and written communication that would assist in conveying to clients, peers, and team members issues encountered by victims, the appropriate methods and plans for managing the issues while placing clients at ease and obtaining information relating to cause of the issues.\n-\tAbility to communicate effectively, both written and verbal, with internal and external stakeholders, leaders and peers.\n-\tExcellent judgment, objectivity, and expertise in addressing employee issues and concerns\n-\tAbility to develop and effectively deliver presentations and training\n-\tAbility to collect and monitor data used to compose written reports and to assist with an end resolution\n-\tProject management skills to implement crisis intervention and situational assessment techniques, analyze the needs of the victim, and provide support and/or assistance to them in the resolution of complex problems\n-\tAbility to effectively communicate with all levels of management, staff, intervening agencies, and families from diverse racial, ethnic, religious, and socioeconomic backgrounds, both verbally and in writing\n-\tPossess strong interpersonal skills\n-\tAbility to build trust and develop supportive relationships\n-\tStrong analytical ability to intervene in crisis situations, using sound professional judgment and ethical practice",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Sexual Assault Response Coordinator (SARC) - Occupational Health Officer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $82,764 - $181,216 (Full Performance - Senior)\nSalary range varies by work level and relevant experience to the position.\n\nOn-the-job training, internal NSA courses, and external training will be made available based up the need and the experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and Federal retirement plan.\n\nWork Schedule: This is a full-time position, Monday - Friday with basic 8 hr/day work requirement between 6:00 a.m and 6 p.m. (flexible). \n\nCandidates should have the ability to serve in an \"on call\" duty status outside of normal work hours that includes remaining ready to perform work, manning enterprise cell phone, and remaining in a reasonable call back radius, staffing the 24/7 support helpline, as needed; regularly checking emails to respond to crises; and/or reporting to a designated place of duty to perform work.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-31T00:00:00.000Z"
  },
  {
    "_id": "67224ae9b231b421787a439a",
    "jobNumber": "1240069",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you an Engineering, Computer Science or Applied Mathematics professional who enjoys working with hardware to understand its basic operation?  Would you like to apply these skills in support of the Intelligence Community mission? NSA is seeking experienced professionals in computer design, microelectronics, radio frequency design, and systems engineering to solve emerging challenges. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "fullDescription": "Are you an Engineering, Computer Science or Applied Mathematics professional who enjoys working with hardware to understand its basic operation?  Would you like to apply these skills in support of the Intelligence Community mission? NSA is seeking experienced professionals in computer design, microelectronics, radio frequency design, and systems engineering to solve emerging challenges. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-14T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-31T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you an Engineering, Computer Science or Applied Mathematics professional who enjoys working with hardware to understand its basic operation?  Would you like to apply these skills in support of the Intelligence Community mission? NSA is seeking experienced professionals in computer design, microelectronics, radio frequency design, and systems engineering to solve emerging challenges. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nFor both HARDWARE/SOFTWARE DESIGN ENGINEER and HARDWARE/SOFTWARE ANALYSIS ENGINEER:\n\nFor engineering degrees, if program is not ABET-EAC accredited, it must include specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\n---------\n\nHARDWARE/SOFTWARE DESIGN ENGINEER\n\nDegree must be in Engineering, Computer Science, or Mathematics.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nRelevant experience must be designing, developing, or constructing electronic hardware and software processing components.\n\n-----------\n\nHARDWARE/SOFTWARE ANALYSIS ENGINEER\n\nFULL PERFORMANCE\nWith a professional Engineering, Computer Science, or Mathematics degree, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nWith a degree in either (1) Physics or Astronomy from an accredited college or university or (2) a relevant professional technical field (e.g. chemistry, architecture,  hydrology, geology), entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience. \n\nRelevant experience must be in one or more of the following: designing and verifying integrated and digital circuit devices, designing and integrating electrical and communication systems, or reverse engineering.\n\nSENIOR\nWith a professional Engineering, Computer Science, or Mathematics degree, entry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience.\n\nDegree must be in either (1) professional Engineering, (2) Physics or Astronomy from an accredited college or (3) a relevant professional technical field (e.g. chemistry, architecture, hydrology, geology).\n\nRelevant experience must be in one or more of the following:  designing and verifying integrated and digital circuit devices, designing and integrating electrical and communication systems, or reverse engineering.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "With the ever-accelerating technological advances and growing system complexity, NSA needs Hardware/Software Engineers to design, develop, construct and evaluate electronic hardware and software processing components. These components are typically subsystems of communication, collection, processing or analysis systems. \n\nHardware Software Engineers utilize electrical, computer, mechanical, and materials engineering knowledge and skills to design, assemble, test, analyze and reverse engineer electronics hardware in support of the NSA mission.\n\nThe National Security Agency (NSA) currently has opportunities for two types of Hardware/Software Engineers positions: Hardware/Software Design Engineers, and Hardware/Software Analysis Engineers. \n\n1.  HARDWARE/SOFTWARE DESIGN ENGINEERS are hired into positions supporting a broad range of specialized skills including Computer Engineering, Computer Programming, Computer Software Engineering, Electrical Engineering, and Communications Engineering. Positions will be in an office directly supporting a technical mission. \n\nThe responsibilities of a Hardware/Software Design Engineer may include: \n-  Designing, developing, testing, and/or evaluating computer or computer-related equipment. \n-  Designing, developing, testing and evaluation of programmable hardware devices or digital circuits.\n-  Programming, modifying and/or configuring system software that manages the computer hardware and provides services to the applications.\n-  Applying software engineering principles to design, develop, test, and evaluate/modify software applications.\n\n2.  HARDWARE/SOFTWARE ANALYSIS ENGINEERS are hired into positions supporting a broad range of specialized skills including Computer Science, Software Engineering, Electrical Engineering, Telecommunications Engineering and Applied Mathematics. Positions will be in an office directly supporting a technical mission.\n\nThe responsibilities of a Hardware/Software Analysis Engineer may include: \n-  Design, develop, construct, test, or analyze firmware, hardware or software components.\n-  Develop new or utilize existing methods and tools to analyze or protect specific hardware, software or firmware. \n-  Develop/recommend mitigation strategies and techniques.\n-  Develop and implement hardware forensic methodologies and applications.\n-  Test, evaluate and/or reverse engineer microelectronic components (FPGA, ASICs, PCB, Microcontrollers, etc.), technology and equipment. \n-  Program, modify and analyze system software/tools that control microelectronics hardware.\n-  Apply hardware and software engineering principles to design, develop, test, and evaluate/modify applications and systems.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Knowledge, skills, and experience in one or more of the following is desired: \n\n-  Experience with Agile Software Development. \n-  Experience in one or more of the following programming languages: C, C++, Java, Java Script, VHDL, Verilog, SystemVerilog, etc. \n-  Experience reverse engineering firmware or software.\n-  Experience in Information Assurance analysis or implementation.\n-  Experience organizing and managing their own projects or the projects of small teams.\n-  Understanding of the basic concepts of cryptography and cryptographic systems.\n-  Understanding of the basics of computer networking and low level protocols.\n-  Familiarity with basic electronic components such as ASICs, PCBs, microcontrollers, FPGAs, etc.\n-  Familiarity with electronics debugging equipment such as multi-meters and oscilloscopes. \n-  Experience with application of 2D/3D imaging for hardware analysis.\n-  Experience with embedded or operating system level programming.\n\nThe ideal candidate has a desire for continual learning along with excellent problem-solving, analytic, and interpersonal skills, who is: \n\n-  Innovative \n-  Well-organized \n-  Able to handle and prioritize multiple assignments \n-  Able to communicate effectively both orally and written \n-  Able to work effectively across several different functional areas in a collaborative environment.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Hardware/Software Design & Analysis Engineer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-31T00:00:00.000Z"
  },
  {
    "_id": "6721009fb231b42178702dd2",
    "jobNumber": "1240059",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-20T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-29T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Engineering, Computer Science, Mathematics, Physics, or a relevant professional technical field.   \n-  For Engineering degrees, the program must be ABET accredited or include specified coursework.*  \n-  For Computer Science, Mathematics, Physics, or other relevant degrees, the program must include the specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\nRelevant experience must be in the design and engineering of communication systems and/or radio frequency (RF) systems, and/or experience with test equipment.\n\nFULL PERFORMANCE\nWith a degree in Engineering, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.  With a degree in Computer Science, Mathematics, Physics, or a relevant professional technical field, entry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's or Doctoral degree plus 1 year of relevant experience. \n\nSENIOR\nEntry is with a Bachelor's degree plus 7 years of relevant experience, or a Master's degree plus 5 years of relevant experience, or a Doctoral degree plus 3 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Every day, NSA solves unique intelligence problems for scenarios not found anywhere else in the defense of our nation. Are you interested in applying your knowledge to cutting-edge technologies having far-reaching applications and global implications? Do you want the opportunity gain new skills that support fulfilling our country's most critical intelligence needs? If so, RF Engineering, a core component capability development activity within NSA, may be for you!\n\nThe communications of our foreign adversaries are accelerating and gaining in complexity. NSA's Signals Intelligence (SIGINT) and Cybersecurity missions must keep pace with advances in the high speed, multi-functional technologies of communications in order to guard against possible harm to our Nation and stay ahead of potential threats. From short wave radio to sophisticated satellites, transmissions in the RF spectrum crowd the airwaves. NSA's goal is to intercept those signals and collect the ones most likely to produce timely and valuable foreign intelligence needed by US military and national policymakers.\n\nOur highly technical RF workforce is dedicated to keeping pace with advances to address threats to our Nation and our Allies. NSA is responsible for designing, developing, building, and deploying small form factor, mobile systems as well as larger sustained systems. We also build the underlying framework to run systems for data collection and processing to meet national intelligence mission requirements.\n\nNSA is seeking talented colleagues to join world class team of analysts, engineers, researchers and developers who create RF technologies, communications, and capabilities to acquire target signals, condition them for follow-on processing, and deliver end-to-end solutions for survey, collection and emitter location and follow on analysis for advancing global advantage in both information gathering and national defense. RF Engineers work on projects using antenna and receiver design, signals analysis, digital signal processing (software defined radio), end-to-end system design, and emitter location and direction finding techniques in order to design, develop and deploy advanced survey and collection capabilities to propel our mission.\n\nAs an RF Engineer, your responsibilities can include:\n\n-  Design, build, test and deploy end-to-end RF systems, from the antenna through follow-on processors.\n-  Design, build, test and deploy communications systems using commercial off the shelf (COTS)/government off the shelf (GOTS) radios, software-defined radios (SDR) and SDR frameworks, as well as field programmable gate array (FPGA) technologies.\n-  Design, develop, construct, test and maintain hardware and software processing components; typically subsystems of communication, collection, processing or analysis systems.\n-  Conduct RF site surveys and include results in the design and performance assessments of RF systems.\n-  Work with and/or lead project teams to satisfy operational requirements for RF systems.\n-  Analyze results of RF collection in support of national mission requirements\n-  Lead new advances in RF engineering and push the leading edge of RF communications technologies:\n-  Antenna theory, design, and fabrication techniques with particular focus on beam-forming technologies - Modulation (BPSK, QPSK, spread spectrum, etc.), demodulation and signal separation techniques\n-  Low power, space and cooling environments (including embedded systems)\n-  Commercial telecommunication standards, protocols and topologies\n-  Compression and other bandwidth optimization techniques\n-  RF interference detection and mitigation approaches\n-  Active RF techniques\n-  Low probability intercept (LPI) and low probability of detection (LPD) techniques\n-  Service-oriented architectures\n\nWhen submitting your application, please ensure that you fully populate all sections of the resume tool with all relevant skills, experience, and education, as the resume entered into the tool will be the primary resume used to evaluate your application.Please do NOT populate the resume tool with - see resume.\n\nPlease attach an unofficial copy of your transcripts from all schools attended when applying for this position. Providing a copy of your transcripts is especially critical to ensure the position's coursework obligations have been met.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with excellent problem-solving, communication, and interpersonal skills who is able to:\n\n-  Work equally well independently and in a team environment\n-  Effectively address multiple concurrent projects\n-  Synthesize information to solve complex problems\n-  Apply knowledge of communications theory to RF engineering problems\n-  Develop, diagnose, and operate survey and collection systems\n-  Identify customer needs and validate system design\n-  Operate in a fast-paced environment\n\nKnowledge and experience in one or more of the following is desired:\n\n-  Applying principles, methods, analysis, and applications of radio frequency theory such as radio wave propagation, antenna theory, antenna usage\n-  Applying principles, methods, and applications of communication theory such as signal processing, decision theory, estimation theory and modulation-demodulation\n-  Applying concepts, theories, and methods for designing, analyzing, testing, and integrating electrical and communications systems; includes aspects of energy conversion, electrical power generation, and energy transmission, control, distribution, or use\n-  Applying principles of math, physics, electronics theory, electrical network theory, and control systems to the design, fabrication, and testing of devices that are designed to operate in the radio frequency spectrum\n-  Hardware design; includes analog (A/D, amplifiers, power supplies, switches), board-level (board layout, circuit analysis, firmware), chip technologies (ASIC, CMOS, VHDL, VLSI), and digital (control logic, control systems, DSP, serial communications)\n-  Programming (e.g. Assembly Language; high level languages such as JAVA, Matlab, Python, Ruby, Shell Script; and hardware description languages VHDL, and SystemVerilog)\n-  Computer networking (e.g., communication protocols, distributed systems, Internet of Things, real-time systems, routing and switching)\n-  Lab equipment (e.g. spectrum analyzers, oscilloscopes, network analyzers, etc.)\n-  Amateur or HAM Radio clubs\n-  Open-source Wi-Fi tools",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Radio Frequency (RF) Design Engineer - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-29T00:00:00.000Z"
  },
  {
    "_id": "671911a8b231b4217834c466",
    "jobNumber": "1239639",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Candidate will develop and implement both short-term and long-term strategic plans and operational concepts contributing to National Security/Emergency Preparedness, \nThis position will require operational and/or training deployments to include nights, holidays and weekends; both short term and potentially extended. Travel is required, often without sufficient notification. Employee may be subject to 24-hour on-call duty. In an emergency, this service may require irregular working hours, work at locations other than the official duty station, and may include duties other than those specified in the incumbent's official position description. Employee must be able to relocate to emergency sites with little advance notice and function under increased mental and physical stress. Employee must physically be able to move and assemble equipment relating to communications and operations centers.\n\nThe incumbent is designated as an Essential Employee for purposes of weather-related events or other short term, isolated emergencies.\n\nThis position requires a TOP SECRET clearance and SPECIAL BACKGROUND INVESTIGATION (SBI). Subject to random drug testing. Subject to random polygraph testing.",
    "fullDescription": "Candidate will develop and implement both short-term and long-term strategic plans and operational concepts contributing to National Security/Emergency Preparedness, \nThis position will require operational and/or training deployments to include nights, holidays and weekends; both short term and potentially extended. Travel is required, often without sufficient notification. Employee may be subject to 24-hour on-call duty. In an emergency, this service may require irregular working hours, work at locations other than the official duty station, and may include duties other than those specified in the incumbent's official position description. Employee must be able to relocate to emergency sites with little advance notice and function under increased mental and physical stress. Employee must physically be able to move and assemble equipment relating to communications and operations centers.\n\nThe incumbent is designated as an Essential Employee for purposes of weather-related events or other short term, isolated emergencies.\n\nThis position requires a TOP SECRET clearance and SPECIAL BACKGROUND INVESTIGATION (SBI). Subject to random drug testing. Subject to random polygraph testing.",
    "grade": "01/0 to 01/0",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "G",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-11-20T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900002",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements. It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process. Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position.\n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications. **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov. \n\nU.S. Citizenship is required for all applicants. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564.  Employment is contingent upon successful completion of a security background investigation and polygraph.  Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate. Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.\n\nFor current DISLs, you must submit a copy of your most recent SF-50 in addition to your resume. For all non-DISL applicants, in addition to your resume, you must submit a 3-page document (no less than 11-point font, 1-inch margins) showing evidence that you meet the Technical Qualifications described in this Posting. Failure to submit either an SF-50 or your 3-page Technical Qualification write-up will disqualify you from consideration.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-23T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "SL",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Candidate will develop and implement both short-term and long-term strategic plans and operational concepts contributing to National Security/Emergency Preparedness, \nThis position will require operational and/or training deployments to include nights, holidays and weekends; both short term and potentially extended. Travel is required, often without sufficient notification. Employee may be subject to 24-hour on-call duty. In an emergency, this service may require irregular working hours, work at locations other than the official duty station, and may include duties other than those specified in the incumbent's official position description. Employee must be able to relocate to emergency sites with little advance notice and function under increased mental and physical stress. Employee must physically be able to move and assemble equipment relating to communications and operations centers.\n\nThe incumbent is designated as an Essential Employee for purposes of weather-related events or other short term, isolated emergencies.\n\nThis position requires a TOP SECRET clearance and SPECIAL BACKGROUND INVESTIGATION (SBI). Subject to random drug testing. Subject to random polygraph testing.",
    "jobQualifications": null,
    "jobQualificationsExt": "Must be a U.S. Citizen; background investigation is required. Top Secret with Special Background Investigation\n\nQualifications Required:\n-\tOne or more professional certifications, such as a Certified Board Continuity Professional (CBCP), Certified Information Systems Security Professional (CISSP); Program Management Professional (PMP), etc.\n\nEDUCATION:\n\nEntry is with a Bachelor's degree plus 15 years of relevant experience, or a Master's degree plus 5 year's experience.\nDegree must be in a technical field (computer science, information technology, information systems management, etc.)\n\n\nFor Non-DISL applicants:\n\nThe applicant selected must meet all the Technical Qualifications (TQ) listed below. Applicants should provide a brief narrative (no more than one-half page) to support each TQ. In addition, each applicant must submit a resume.\n\nHow You Will Be Evaluated:\n\nThe applicant selected must meet all the Technical Qualifications (TQ) listed below.  Applicants should provide a brief narrative (no more than one-half page) to support each TQ.  In addition, each applicant must submit a resume.  \n\nTQ 1: Professional Achievements \nSpecific Technical/Professional Achievement focuses on personal technical achievement which demonstrates innovative research and/or breakthrough successes. While achievement may take the form of participation in group efforts, the candidate under review should be distinguished from the accomplishments of the team as a whole and evaluated in terms of the impact of individual skills and knowledge on the team effort.\nCompetencies: \n- Expertise and Depth - Demonstrates recognized expertise and depth and/or breadth in the aspirant's field. Consistently demonstrates specific technical achievements and accomplishments (i.e. developed techniques and methods, inventions, or legal, fiscal, and/or other major contributions) that evidence mission impact that can be directly tied to an articulated mission need. \n- Problem Solving - Identifies and solves critical and/or sensitive problems by finding opportunities for improvement and addressing them through practical, sustainable responses resulting in significant Agency and/or IC-wide impact. Adapts to changing situations/priorities by modifying plans, programs and/or policies as appropriate, positively affecting major organizations and/or customers/stakeholders and/or redirecting activities towards new strategic thrusts.\n- Flexibility - Is open to change and new information; rapidly adapts to new information, changing conditions, or unexpected obstacles. \n- Innovative Research - Demonstrates innovative research and/or breakthrough successes by applying knowledge of the scientific principles, methods and processes used; develops new insights into situations; questions conventional approaches; encourages new ideas and innovations; designs and implements new or cutting-edge programs/processes.\n- Applied Expertise to Multiple Domains -Demonstrates understanding of various disciplines and concepts; utilizes that knowledge to approach increasingly complex problems from multiple directions\n\nTQ 2: Technical/Professional Development of Others\nTechnical/Professional Development of Others focuses on the transfer of skills to others, especially to the next generation of experts. Covered in this category are not only concrete skills and knowledge, but such intangibles as how to approach problems, how to balance risk against the chance of success, factors in building problem-solving teams, how to communicate effectively, and the like. Developing skills in others can be accomplished in a multitude of ways beyond mentoring, including but not limited to, building curriculum, teaching, or transferring knowledge through papers and talks.\nCompetencies: \n- Developing Others - Establishes mentoring relationships with one or more individuals by providing guidance, direction, and advice through formal or informal mentoring. Ensures their skills are transferred to others in support of the development of the next generation of experts in their domain. Actively supports hiring, promotion processes, retention and other agency wide initiatives to support building and sustaining an expert workforce. \n- Leveraging Diversity - Fosters a diverse, equitable, and inclusive workplace where individual differences are valued and leveraged in support of a culture that promotes collaboration and productivity to achieve the vision and mission of the organization. Contributes to a culture that promotes collaboration and productivity. \n- Participation in the Community - Leads and influences boards, committees, panels, etc. of significance to the growth of a technical community of significance to NSA; actively participates in efforts aimed at conveying knowledge, such as seminars and conferences, teaching at the NCS, conducting on-the-job training, etc.\n- Ability to Communicate - Demonstrates executive level writing and oral communication skills; demonstrates effective listening and grounds communication in language and framing that exhibits understanding of the audience and allows the relaying of complex topics.. \n\nTQ 3: Technical/Professional Leadership/Decision Making \nTechnical/Professional Decision Making focuses on the extent to which the employee is developing as a technical leader. At the highest levels this leadership should be unquestioned. In this area also fall such intangible components of leadership as perseverance and dependability\nCompetencies: \n- Standing in Field - Demonstrates experience as a strong and credible technical leader. Provides high-impact expert advice to top management, peers and/or customers, partners or national leaders.\n- Ability to Influence - Provides high-impact expert advice to top management, peers and/or customers, partners or national leaders. Persuades others; builds consensus through give and take; gains cooperation from others to obtain information; displays persistence to find solutions and accomplish goals. Communicates confidently and skillfully with internal and external audiences.\n- Role in Decision Making - Makes sound and timely decisions to carry out ideas, develop systems or execute programs.\n\nTQ 4: Continued Technical/Professional Development\nContinued Technical/Professional Development focuses on the continuous enhancement of technical/professional skills and knowledge. Formal training, \"stretch\" assignments, research and writing projects, interaction with other experts, and other activities appropriate to the particular discipline should be evaluated as part of the appraisal process.\nCompetencies: \n- Complexity - Seeks opportunities to increase understanding of complex and highly technical subjects, including participating in specific areas to deepen area of expertise. \n- Broadening of Vision - Acquires expertise in other disciplines, leading to additional opportunities and impacts. Examines biases and seeks insights to avoid stereotypical responses and behavior.\n- Ongoing Education - Demonstrates continual learning through formal training, 'stretch' assignments, research and writing projects, interaction with other experts, and other activities appropriate to the particular discipline.\n\nTQ 5: LEADING THE INTELLIGENCE ENTERPRISE \nThis core qualification is comprised of the Intelligence Community (IC)-specific \"joint\" competencies of Collaboration and Integration, Enterprise Focus, and Value-Centered Leadership. \nCompetencies: \n- Collaboration and Integration - Share information and knowledge to achieve results by creating an environment that promotes employee engagement, collaboration, integration, information and knowledge sharing, and the candid, open exchange of diverse points of view. \n- Enterprise Focus - Demonstrate a deep understanding of how the mission, structures, leaders, and cultures of the various DoD and IC components interact and connect. \n- Value-Centered Leadership - Advance and reinforce DoD and IC core values: A Commitment to selfless service and excellence in support of the IC's mission, as well as to preserving, protecting, and defending the Nation's laws and liberties; the integrity and Courage (moral, intellectual, and physical) to seek and speak the truth, to innovate, and to change things for the better, regardless of personal or professional risk; and Collaboration as members of a single IC-wide team, respecting and leveraging the diversity of all members of the IC, their background, their sources and methods, and their points of view.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The Chief, Communications & IT Division oversees and directs activities for one of five major organizational elements of the TF. The role is a blend of traditional Chief Information Officer and Chief Technology Officer functions supporting unique and customized TF requirements. The incumbent is responsible for the program management of a highly complex network and involves application of advanced state-of-the-art technology.\n\nAdditionally, the Chief is responsible for:\n-\tProviding guidance to TF and partner Information Technology (IT) managers and staff involved in the design, development, implementation, modification, maintenance and integration of intra-and inter- agency systems;\n\n-\tResearching, proposing, and implementing complex communications infrastructure (such as emerging satellite communications systems, cellular transport, voice, video, and data networks) to meet stakeholder requirements while ensuring continuity of communications regardless of the interruption;\n\n- Directing the strategy for planning, architecture, design and configuration management of all TF hardware, software, database management systems, telecommunications, data and local area network, and related equipment and approves methodologies and configurations changes to infrastructure;\n\n-\tEffectively supporting, developing and managing a workforce that is capable of anticipating and responding to stakeholder requirements;\n\t\n\t\n-\tServing as principal advisor to senior-level program stakeholders for areas assigned;\n\n-\tManaging the division's budget and workload, establishing performance requirements for subordinate staff and ensuring appropriate performance standards are applied; ensuring accountability and transparency in financial planning, decision-making and reporting, and ensuring sound investment of government financial resources and integrity of the Federal contracting process;\n\n-\tDemonstrating the ability to bring about strategic change, both within and outside the organization, to meet organizational goals. Establishes and implements an organizational vision in a continuously changing environment;\n\n-\tProviding executive leadership and direction in concert with the TF leadership and stakeholders for mission assurance, critical infrastructure protection, cybersecurity, risk management, emergency preparedness, and records management programs;\n\n-\tDetermining the optimal organizational structure and utilization of resources to accomplish mission and objectives in an efficient, economical, and effective manner;\n\n-\tLeading a team of System Engineers, Emergency Management, Information Technology, and Cybersecurity Professionals toward meeting the organization's vision, mission and goals; \n\n-\tLeading the preparation and delivery of communications and briefings of senior stakeholders, as well as all internal and external customers and partners of the TF. Interfacing with customers and representing the TF Director at meetings, briefings, conferences, etc. Establishing and maintaining partnerships with key customers and stakeholders;\n\n-\tDirecting the implementation of approved plans. Tasking organizations and/or contractors to carry out technology initiatives. Evaluating technical progress to assess performance, conducting risk assessments, and coordinating technical modifications to accommodate requirements.\n\n-\tLeading efforts to fully understand and meet stakeholder needs and requirements in the areas of risk mitigation and response readiness;\n\n-\tPerforming other duties as assigned.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Senior Technical Leader/ Chief, Communications and IT Division",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay, Benefits, & Work Schedule\n\nPay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: DISL Tier 1 - $191,900 - $204,000\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule: This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).\n\nTravel may be required.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Washington DC, DC",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-23T00:00:00.000Z"
  }
]
