[
  {
    "_id": "67054601b231b421789f7c2e",
    "jobNumber": "1239029",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Start a career where you learn to become an acquisition professional supporting the protection of our warfighters around the world, enabling and assisting operations on land, in air, at sea, in space, and within the cyber domain. Contracting Specialists at NSA acquire commercial goods and services as part of a team that handles a wide range of acquisition tasks to effectively manage the total acquisition requirements of an organization, department, or program in support of NSA's mission.",
    "fullDescription": "Start a career where you learn to become an acquisition professional supporting the protection of our warfighters around the world, enabling and assisting operations on land, in air, at sea, in space, and within the cyber domain. Contracting Specialists at NSA acquire commercial goods and services as part of a team that handles a wide range of acquisition tasks to effectively manage the total acquisition requirements of an organization, department, or program in support of NSA's mission.",
    "grade": "07/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "B",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-16T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Bus., Accntng and Bdgt",
    "jobFamilyId": "100070",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-09T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Start a career where you learn to become an acquisition professional supporting the protection of our warfighters around the world, enabling and assisting operations on land, in air, at sea, in space, and within the cyber domain. Contracting Specialists at NSA acquire commercial goods and services as part of a team that handles a wide range of acquisition tasks to effectively manage the total acquisition requirements of an organization, department, or program in support of NSA's mission.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nEntry is with a high school diploma or GED plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience, or a Bachelor's degree and no experience. \n\nA degree in any field is acceptable.\n \nRelevant experience must be in business management or contracting (for example, acquisition, procurement, program management, finance, accounting, and logistics) and must also include using email, spreadsheets, and word processing.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Contracting Specialists at NSA both administer and manage contracts. \n\nThis position is specifically looking for Contracting Specialists whose principal function is supporting the management of contracts post award (Contract Manager), acting as the Primary Contracting Officer Representative (P-COR). This position does not manage people.   \n\nAs a Contracting Specialist/Contract Manager at NSA, responsibilities may include:\n\n- Serving as the Primary Contracting Officer Representative (P-COR) who leads and oversees execution responsibilities associated with contract performance and delivery outcomes. CORs are individuals designated and authorized in writing by the Contracting Officer (CO) to perform specific technical and/or administrative functions that are critical to the success of NSA's mission.\n- Monitoring contractor performance and ensuring services are delivered in accordance with contract terms.\n- Meeting frequently with vendors and government technical experts to discuss contract cost, schedule, and performance.\n- Collaborating with technical experts to establish clearly defined contract tasks; validating those tasks are within the contract scope and cost parameters.\n- Generating cost estimates using historical data and future projections in an effort to build accurate and reliable spend plans.\n- Serving as part of a Source Selection Team and often times serving as the Source Selection Evaluation Lead.\n- Presenting status updates on expenditures, delivery timelines, and contractor performance to senior executive leadership.\n- Partnering with contracting, finance, and mission experts to ensure long-term contracts are properly funded and contract modifications are approved in a timely manner.\n- Preparing contract supporting documents in advance for award of Contracts and Contract Modifications by the Contracting Officer (CO).\n- Forecasting requirements for future contracts and meeting with mission to draft pre-solicitation documents.\n- Reviewing contract invoices and collaborating with vendors to resolve any errors or issues prior to payment authorization.\n- Identifying opportunities to improve contract performance and reduce contract cost.\n- Utilizing Microsoft Excel on a daily basis to provide analytic support on assigned contracts.\n\nAlthough not required, preferred attributes for this position include a Degree in Business and a cumulative GPA of 3.2 or higher.  Additionally, if using relevant experience as part of the minimum qualifications, preferred relevant experience is in managing or overseeing contracts or procurements.\n\nAdditionally, this position requires a DAWIA (Defense Acquisition Workforce Improvement Acct) professional certification in Contracting. A training plan will be put in place to allow the required certification to be achieved within 36 months of employment.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate demonstrates the following:\n\n-Effective Communication\n-Problem Solving\n-Interpersonal Skills\n-Partnering\n-Customer Service\n-Accountability\n-Continual Learning\n-Resilience",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Contracting Specialist - Entry Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $55,924 - $88,926 \n\nSalary range is based on work level and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-09T00:00:00.000Z"
  },
  {
    "_id": "66fd5d10b231b4217861432b",
    "jobNumber": "1238878",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-21T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-07T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to engineering standards and principles. The NSA offers multiple areas of focus for facilities engineers, including architectural, civil, electrical, fire protection, mechanical, and structural. In addition, we are seeking skills that include facilities system control and visualization, and infrastructure systems integration and engineering.  Apply your engineering skills to protect the nation.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Electrical Engineering, General Engineering or Architectural Engineering. If program is not ABET accredited, it must include specified coursework.*  A degree in Engineering Technology will also be considered if it includes specified coursework.*\n\n*Specified coursework includes courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience.\n\nRelevant experience must be working in an electrical engineering capacity (for example, UPS, switchgear, SCADA, transformers, substations, power panels, switchboards, and metering of power). Additionally, must have experience using NEC code and computer aided design and drafting, reading design drawings, and cost estimation. Experience may also include project management.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Be a part of our mission to protect the national security of the United States, and have a direct impact to enable success in Agency operations. As a Facilities Electrical Engineer, you will have the opportunity to work directly with mission customers to validate the requirements and unique needs to provide reliable technical solutions.\n\nWith the ever-changing industry and increase of technology complexities to accommodate our workforce, NSA's Installation & Logistics organization needs motivated Electrical Engineers to provide facilities design expertise, guidance, and support to the development and implementation of facilities solutions that enable capabilities that align with mission driven priorities. \n\nAdditionally, the Installations & Logistics organization is seeking Electrical Engineers with a focus or specialty in control and monitoring of electrical systems. Candidates with this specialty should be knowledgeable about or interested in learning about Supervisory Control and Data Acquisition (SCADA) and electrical control systems, electrical power systems, Schweitzer protective relays, Real-Time Automation Controllers (RTAC) as well as Programmable Logic Controllers (PLCs). Knowledge of the protocols used by these devices including mirrored bits, Modbus, DNP, and SNMP is desired.\n\nAs an Electrical Engineer at NSA, responsibilities may include:\n\n-  Prepare design and construction cost estimates.\n-  Development of designs for new and renovated facilities.\n-  Prepare engineering technical reports, specifications, and drawings.\n-  Provide construction detailing.\n-  Perform engineering analysis and calculations.\n-  Conduct code analysis.\n-  Project management.\n-  Facilities planning.\n-  Drafting of electrical plans and schematics.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate demonstrates the following:\n\n-  Problem Solving\n-  Interpersonal Skills\n-  Partnering\n-  Customer Service\n-  Accountability\n-  Continual Learning\n-  Resilience\n-  Effective Communication\n\nFor the monitoring and control system focus area, knowledge and experience in one or more of the following is desired:\n\n-  Supervisory Control and Data Acquisition (SCADA) and electrical control systems\n-  Implementation of relays and data aggregators\n-  Configuring and supporting Schweitzer Real Time Automation Controllers (RTAC)\n-  Evaluating and documenting PLC programs for electrical power control\n-  Relay protection design\n-  Applying concepts, principles, and methods for network connectivity (e.g. routing, switching, tunneling, and IP addressing)\n\nAdditional knowledge and experience in one or more of the following is desired:\n\n-  Technical software packages (e.g., AutoCAD, ETAP, SKM, CDEGS, ASPEN,  AGI32, Visual Lighting, MEGAMAN)\n-  Relay protection design\n-  Generators and plant control systems\n-  Uninterruptible Power Supply (UPS) systems\n-  Electrical distribution design and equipment (high voltage, medium voltage, low voltage)\n-  Electrical power system grounding and signal grounding\n-  Operation and design of SCADA and electrical control systems\n-  Emergency power systems\n-  Codes and standards (NFPA ' including NEC, UL, IEEE, etc.)\n-  Electrical schematics and blueprints\n-  Cost estimating\n-  Reliability and availability\n-  Startup and commissioning\n-  Electrical operations & maintenance\n-  Generators and plant control systems\n-  Uninterruptible Power Supply (UPS) systems\n-  Electrical distribution design and equipment (high voltage, medium voltage, low voltage)\n-  Emergency power systems\n-  Codes and standards (NFPA ' including NEC, UL, IEEE, etc.)\n-  Technical software packages (e.g., AutoCAD, ETAP, SKM, CDEGS, ASPEN, AGI32, Visual Lighting)\n-  Electrical schematics and blueprints\n-  Cost estimating\n-  Reliability and availability\n-  Startup and commissioning\n-  Electrical operations & maintenance",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Electrical Engineer - Facilities - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.  This position is hiring for Maryland.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-07T00:00:00.000Z"
  },
  {
    "_id": "66fffffab231b4217876a92b",
    "jobNumber": "1238900",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Provide cryptographic products and physical security of communications security (COMSEC) material for the protection of information processed in National Security Systems. Identify, control, process, secure, distribute and assure accountability of COMSEC assets. Crypto Material Controllers are responsible for the management and control of documents, policies, directives, and instructions.",
    "fullDescription": "Provide cryptographic products and physical security of communications security (COMSEC) material for the protection of information processed in National Security Systems. Identify, control, process, secure, distribute and assure accountability of COMSEC assets. Crypto Material Controllers are responsible for the management and control of documents, policies, directives, and instructions.",
    "grade": "09/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "Y",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-13T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Infrastructure and Logistics",
    "jobFamilyId": "100160",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position.  This ad will run for seven days or until a sufficient number of applications have been received. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-07T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Provide cryptographic products and physical security of communications security (COMSEC) material for the protection of information processed in National Security Systems. Identify, control, process, secure, distribute and assure accountability of COMSEC assets. Crypto Material Controllers are responsible for the management and control of documents, policies, directives, and instructions.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nA degree in any field is acceptable.\n\nRelevant experience must include one or more of the following: working in a COMSEC environment, working in a warehouse, a manufacturing or logistics field, administrative activities, data entry, customer service, or project planning.\n\nFULL PERFORMANCE\nEntry is with a high school diploma or GED plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "GENERAL TASKS:\nUse Basic Comp Sys/Office Tech\n- Use basic office resources, such as e-mail, Web browsers, word processors, and presentation graphics.\n- Use office computers and printers.\n- Use office equipment other than computers and printers, such as copiers, scanners, and telecommunications equipment.\n\nWORKING WITH OTHERS:\n- Help or assist coworkers, subordinates, or other employees when needed.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "SPECIALIZED TASKS AND SKILLS:\n- Experience with COMSEC processes and equipment.\n- Critical thinking, well organized, meticulous, and communicate well verbally and written.\n\nCOMSEC Accounting\n- Maintain accountability and security for all COMSEC keys, equipment, and semiannual inventories.\n- Point of contact for all COMSEC related matters \n\nClassification Management\n- Applying the requirements for handling, couriering, transporting, and safeguarding protected (e.g., FOIA/Privacy Act) and/or classified information.\n\nComputer Operations\n- Using computers and computer systems to accomplish work activities. Includes navigating the internet and common file systems within a computer network.\n\nNSA/CSS Miss/Policies/Directs\n- Applying NSA/CSS policies and directives.\n\nSecurity Awareness\n- Using policies, regulations, and procedures for securing facilities and protecting the security of personnel\nand information.\n\nGENERAL KNOWLEDGE AND SKILLS:\nInterpersonal Skills\n- Treating others with courtesy, sensitivity, and respect.\n\nOral Communication\n- Listening, being receptive to others, attending to non-verbal cues, and responding appropriately.\n\nPartnering\n- Collaborating with colleagues, counterparts, management, and others to achieve common goals.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Crypto Material Controller - Mid Level (Texas)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $60,823 - $79,070 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "San Antonio, TX",
    "locationArea": "498",
    "locationFull": "NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L498",
    "postedDate": "2024-10-07T00:00:00.000Z"
  },
  {
    "_id": "66feae82b231b421786ba4fc",
    "jobNumber": "1238915",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. Apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations, join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. Apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations, join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "11/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-18T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-04T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. Apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations, join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Computer Science (CS). Related fields (e.g., Engineering, Mathematics, Information Technology or Systems, Cybersecurity, Information Assurance or Security, Networking and Telecommunications) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following: algorithms; computer architecture or network architecture; data structures; logic and computation; and mathematics (for example, algebra, calculus, or discrete mathematics). \n\nRelevant experience must be in computer or information systems design/development/analysis. In addition, relevant experience may also include engineering hardware and/or software, programming, computer/network security, vulnerability analysis, penetration testing, computer forensics, information assurance, cybersecurity, systems engineering and/or network and system administration. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The need to maintain our core Computer Science group is vital to provide the technical capabilities necessary to successfully execute NSA's mission. The increased complexity of supporting NSA's mission requires world class researchers, programmers, and developers who operate in teams in areas such as software engineering, information technology infrastructure, high performance computing, data science, architectures, computer security, and networking in order to design and develop advanced tools, techniques, and systems.\n\nDigital Network Exploitation Analysts employ computer science skills to perform discovery and target technology analysis of digital network and mobile communications. \n\nDigital Network Exploitation Analysts are hired into positions directly supporting a technical mission office or an Agency Development Program. Both the Digital Network Exploitation Analyst (DNEA) Development Program (DDP) and the Intrusion Analyst Skill Development Program (IASDP) are 3 year programs that combine formal training (i.e., SIGINT, discovery/analysis, and advanced cyber security) and diverse work assignments.\n\nAs a Digital Network Exploitation Analyst at the NSA, responsibilities may include:\n\n-     conducting analysis of metadata\n-     conducting target analysis and research\n-     identifying target communications within the global network\n-     performing global network analysis and mapping\n-     using knowledge of customer requirements to analyze and process intelligence information\n-     performing exploitation and operations on target networks",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for continual learning and strong problem-solving, analytic and interpersonal skills who is: \n\n-     flexible\n-     able to communicate effectively \n-     able to collaborate with others\n \nSpecialized skills and experience in one or more of the following is desired: \n\n-     Knowledge of network protocols (especially TCP/IP, VOIP, wireless protocols) \n-     Understanding of Internet \n-     Understanding of WAN and LAN \n-     Vulnerability analysis \n-     Programming experience (prefer one or more of the following: C, C++, Java, Assembly, Python)",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Digital Network Exploitation Analyst - Experienced Level (Utah)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477- $149,026 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": null,
    "locationArea": "1257",
    "locationFull": "Draper, Utah, UT",
    "locationSpecificId": "49A",
    "postedDate": "2024-10-04T00:00:00.000Z"
  },
  {
    "_id": "66f6cca3b231b42178205639",
    "jobNumber": "1238367",
    "OtherActivities": null,
    "agency": "NSA",
    "description": null,
    "fullDescription": null,
    "grade": "07/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "O",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-13T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900000",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-10-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": null,
    "jobQualifications": null,
    "jobQualificationsExt": null,
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency employs a diverse workforce that plays a critical role in protecting our nation's security every day. The NSA is seeking individuals with relevant Intelligence Community (IC) experience to support our mission. Previous NSA employees are highly encouraged to apply to this job posting. Applicants to this advertisement will be considered against the two skill areas that they chose in the screening questions and will be required to meet all applicable minimum qualifications. To determine the minimum qualifications associated with a particular vacancy, please review the relevant vacancy announcement.\n\nRetired Federal government employees are encouraged to apply directly to the \"Retired Federal Government Employees\" job posting so that we can consider your application as a reemployed annuitant. In addition, we suggest you contact the Office of Personnel Management should you have any questions regarding the impact of reemployment on your current benefits as a federal retiree.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "NSA corporately hires for many areas of consideration. Your responses to screening questions attached to this job posting will help us to guide you toward the area(s) that best fit your background/experience:\n\no Collection\no Computer Science\no Cybersecurity & Analysis\no Data Science\no Engineering and Physical Science\no Language Analysis\no Mathematics\no Networking and Telecommunications \n\nQualifications\n\nThe minimum qualifications against which the applicant will be evaluated derive from the skill area to which they are matched. In addition, the applicant must have previous experience working as a civilian employee or military affiliate in an Intelligence Community Agency.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Former Intelligence Community (IC) Professionals",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-10-01T00:00:00.000Z"
  },
  {
    "_id": "66f6cca3b231b42178205637",
    "jobNumber": "1238595",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.",
    "grade": "09/1 to 13/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-12T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-28T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nFULL PERFORMANCE\nEntry is with a high school diploma or GED, plus applicable training, plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience.  \n\nDegree must be in an Engineering or an Engineering Technology related field. If qualifying with a high school diploma/GED, must have applicable Vocational/Technical or Military training (for example, Electronics, Computers, Drafting, Engineering, Manufacturing, or Networking).\n\nRelevant experience must include one or more of the following: providing engineering technical support for the development, fabrication, testing, or site installation of electrical, electronic, mechanical, or software products/systems; assisting in assembling, modifying, debugging, or testing prototype products; working as an electrician or with electronic or appliance repair. Relevant experience may also include formal or informal experience working with computers, robotics, electronics, or manufacturing, electronic shop experience, or experience with schematic diagrams, environmental testing, and quality assurance testing. \n\nCommercial industry certifications, such as the MASE (Master Automotive Service Excellence), would count for two years of experience.\n\nSENIOR\nEntry is with a high school diploma or GED, plus applicable training, plus 6 years of relevant experience, or an Associate's degree plus 4 years of relevant experience, or a Bachelor's degree plus 2 years of relevant experience.\n\nDegree must be in an Engineering or an Engineering Technology related field. If qualifying with a high school diploma/GED, must have applicable Vocational/Technical or Military training (for example, Electronics, Computers, Drafting, Engineering, Manufacturing, or Networking).\n\nRelevant experience must include one or more of the following: providing engineering technical support for the development, fabrication, testing, or site installation of electrical, electronic, mechanical, or software products/systems; assisting in assembling, modifying, debugging, or testing prototype products; working as an electrician or with electronic or appliance repair. Relevant experience may also include formal or informal experience working with computers, robotics, electronics, or manufacturing, electronic shop experience, or experience with schematic diagrams, environmental testing, and quality assurance testing.\n\nCommercial industry certifications, such as the MASE (Master Automotive Service Excellence), would count for two years of experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Do you have vocational/technical training in Technical Trades, Electronics, Computers, Drafting, Engineering, or Networking? Do you enjoy building, installing, modifying, repairing, fabricating prototyping parts/mechanisms, and/or testing electronic equipment? \n\nThe National Security Agency (NSA) is seeking highly motivated Engineering Specialists/Technicians - Technical Trades to help build, install, modify, repair, fabricate prototype parts/mechanisms, and/or test electronic equipment. We have opportunities at our NSA Headquarters and at our NSA Hawaii regional center. The responsibilities of an Engineering Specialist/Technician may include:\n\n- Installing, operating, maintaining, troubleshooting and/or repairing of equipment and systems in accordance with applicable standards and processes \n- Performing rack, stack, and cabling of equipment in IT machine rooms \n- Maintaining Configuration Items (CI) in a centralized data base \n- Capturing and tracking IT machine room Power, Space, and Cooling \n- Serving as an Access Manager for IT machine rooms \n- Operating industrial/production equipment, machinery (Lathes, CNC, EDM, Mills, Waterjet, Welder, Industrial Printers, Routers, 3D Printers, Electro Plating, Vacuum Casting/Forming, Injection Molding, Industrial Painting/Finishing, and Textile) and tools such as machine tools, presses, air compressors, and packaging equipment \n- Operating mechanized material-handling equipment (for example, forklifts, hand trucks)\n- Informing customers, management, or relevant others of work progress, project status, and problems \n- Ordering, procuring, receiving, inspecting, and/or verifying ordered supplies, materials, or equipment \n- Driving vehicles, such as cars, vans, or trucks to transport cargo or passengers\n- 3D scanning, metrology, and hardware reverse engineering",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate has a desire for continual learning along with excellent problem-solving, analytic, and interpersonal skills, who is: \n\n-  Innovative \n-  Well-organized \n-  Able to handle and prioritize multiple assignments \n-  Able to accomplish assignments with little direct supervision \n-  Able to communicate effectively both orally and written \n-  Medically clearable for worldwide travel \n-  Able to work effectively across several different functional areas in a collaborative environment \n\nKnowledge, skills, and experience in one or more of the following is desired: \n\n-  Working at heights to include antenna towers \n-  Soldering of electronic components \n-  Troubleshooting of electrical and mechanical devices \n-  RF amplification and distribution \n-  Power distribution \n-  Fabrication of RF and multi-conductor cable assemblies \n-  Additive Manufacturing \n-  3D print \n-  Rapid prototyping\n-  FDM (Fused Deposition Modeling) \n-  SLA (Stereo Lithography Apparatus)\n-  Laser sintering \n-  SLS (Selective Laser Sintering) \n-  DLMS (Direct Laser metal Sintering) \n-  Plastic Powder Bed 3D printing \n-  Metal Powder Bed 3D Printing \n-  Tool & Die  Machining \n-  CNC (Computer Numerical Control) programming \n-  CAD (Computer-Aided Design)/CAM (Computer-Aided Manufacturing) \n-  Fabrication \n-  Sheet Metal Fabrication \n-  Welding \n-  Electro-plating \n-  Industrial painting \n-  Punch press \n-  Press brake \n-  Water jet\n-  DAWIA Certification may be required",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Engineering Specialist/Technician - Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $68,405 - $153,354 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-28T00:00:00.000Z"
  },
  {
    "_id": "66f6cca3b231b42178205638",
    "jobNumber": "1238596",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.",
    "fullDescription": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.",
    "grade": "09/1 to 09/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "E",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-12T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Engineering and Physical Sci",
    "jobFamilyId": "100050",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-28T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an Engineering and Physical Science professional, you will use your skills to create the systems and tools that will be used to enhance the operation of intelligence. You will advise, administer and perform scientific projects, such as planning, designing, and constructing specialized equipment, and ensuring adherence to sound engineering and scientific standards and principles. The NSA offers multiple areas of focus for facilities engineers, including computer, architectural, electrical, mechanical, and structural. In addition, we are seeking skills that include computer design, microelectronics, radio frequency design, and systems engineering. Apply your science and engineering skills to protect the nation.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nFULL PERFORMANCE\nEntry is with a high school diploma or GED, plus applicable training, plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience.  \n\nDegree must be in an Engineering or an Engineering Technology related field. If qualifying with a high school diploma/GED, must have applicable Vocational/Technical or Military training (for example, Electronics, Computers, Drafting, Engineering, Manufacturing, or Networking).\n\nRelevant experience must include one or more of the following: providing engineering technical support for the development, fabrication, testing, or site installation of electrical, electronic, mechanical, or software products/systems; assisting in assembling, modifying, debugging, or testing prototype products; working as an electrician or with electronic or appliance repair. Relevant experience may also include formal or informal experience working with computers, robotics, electronics, or manufacturing, electronic shop experience, or experience with schematic diagrams, environmental testing, and quality assurance testing. \n\nCommercial industry certifications, such as the MASE (Master Automotive Service Excellence), would count for two years of experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Do you have vocational/technical training in Technical Trades, Electronics, Computers, Drafting, Engineering, or Networking? Do you enjoy building, installing, modifying, repairing, fabricating prototyping parts/mechanisms, and/or testing electronic equipment? \n\nThe National Security Agency (NSA) is seeking highly motivated Engineering Specialists/Technicians - Technical Trades to help build, install, modify, repair, fabricate prototype parts/mechanisms, and/or test electronic equipment. We have opportunities at our NSA Headquarters and at our NSA Hawaii regional center. The responsibilities of an Engineering Specialist/Technician may include:\n\n- Installing, operating, maintaining, troubleshooting and/or repairing of equipment and systems in accordance with applicable standards and processes \n- Performing rack, stack, and cabling of equipment in IT machine rooms \n- Maintaining Configuration Items (CI) in a centralized data base \n- Capturing and tracking IT machine room Power, Space, and Cooling \n- Serving as an Access Manager for IT machine rooms \n- Operating industrial/production equipment, machinery (Lathes, CNC, EDM, Mills, Waterjet, Welder, Industrial Printers, Routers, 3D Printers, Electro Plating, Vacuum Casting/Forming, Injection Molding, Industrial Painting/Finishing, and Textile) and tools such as machine tools, presses, air compressors, and packaging equipment \n- Operating mechanized material-handling equipment (for example, forklifts, hand trucks)\n- Informing customers, management, or relevant others of work progress, project status, and problems \n- Ordering, procuring, receiving, inspecting, and/or verifying ordered supplies, materials, or equipment \n- Driving vehicles, such as cars, vans, or trucks to transport cargo or passengers\n- 3D scanning, metrology, and hardware reverse engineering",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate has a desire for continual learning along with excellent problem-solving, analytic, and interpersonal skills, who is: \n\n-  Innovative \n-  Well-organized \n-  Able to handle and prioritize multiple assignments \n-  Able to accomplish assignments with little direct supervision \n-  Able to communicate effectively both orally and written \n-  Medically clearable for worldwide travel \n-  Able to work effectively across several different functional areas in a collaborative environment \n\nKnowledge, skills, and experience in one or more of the following is desired: \n\n-  Working at heights to include antenna towers \n-  Soldering of electronic components \n-  Troubleshooting of electrical and mechanical devices \n-  RF amplification and distribution \n-  Power distribution \n-  Fabrication of RF and multi-conductor cable assemblies \n-  Additive Manufacturing \n-  3D print \n-  Rapid prototyping\n-  FDM (Fused Deposition Modeling) \n-  SLA (Stereo Lithography Apparatus)\n-  Laser sintering \n-  SLS (Selective Laser Sintering) \n-  DLMS (Direct Laser metal Sintering) \n-  Plastic Powder Bed 3D printing \n-  Metal Powder Bed 3D Printing \n-  Tool & Die  Machining \n-  CNC (Computer Numerical Control) programming \n-  CAD (Computer-Aided Design)/CAM (Computer-Aided Manufacturing) \n-  Fabrication \n-  Sheet Metal Fabrication \n-  Welding \n-  Electro-plating \n-  Industrial painting \n-  Punch press \n-  Press brake \n-  Water jet\n-  DAWIA Certification may be required",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Engineering Specialist/Technician - Experienced Level (Utah)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $59,966 - $77,955 (Full Performance)\nSalary range varies by location, work level, and relevant experience to the position. \n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": null,
    "locationArea": "1257",
    "locationFull": "Draper, Utah, UT",
    "locationSpecificId": "49A",
    "postedDate": "2024-09-28T00:00:00.000Z"
  },
  {
    "_id": "66e452c7b231b421788585db",
    "jobNumber": "1237879",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "fullDescription": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "grade": "07/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "6",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-14T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Physical Security",
    "jobFamilyId": "100110",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-13T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nENTRY/DEVELOPMENTAL\n\nEntry is with a high school diploma or GED and no experience.\n\nExperience working with basic office resources (e.g., e-mail, web browsers, word processors, and presentation graphics), working in security, law enforcement, and/or military service is desired. Must be at least 21 years of age and possess a valid U.S. driver's license. Certification in Act 120, MPTC, FLETC exempt, CPR, and AED is preferred.\n\nFULL PERFORMANCE \n\nEntry is with a high school diploma or GED plus 4 years of relevant experience, or an Associate degree plus 2 years of relevant experience.\n\nDegree in Criminology, Behavioral Science, Law Enforcement, or a Security related field is preferred, but a degree in any field is acceptable.\n\nRelevant experience must be with NSA police, equivalent experience (e.g., SARU, ATFP), or in security (i.e., personnel or physical). Certification in the following areas is preferred (i.e., Firearm, Act 120, MPTC, FLETC exempt). CPR, AED, HAZMAT, and Incident Command certifications and/or training is also preferred. Must be at least 21 years of age and possess a valid U.S. driver's license. Formal or informal leadership is preferred.\n\nSENIOR\n\nEntry is with a high school diploma or GED plus 6 years of relevant experience, or an Associates Degree plus 4 years of relevant experience, or a Bachelor's degree plus 2 years of relevant experience.\n\nDegree in Criminology, Behavioral Science, Law Enforcement, or a Security related field is preferred, but a degree in any field is acceptable.\n\nRelevant experience must be with NSA police, equivalent experience (e.g., SARU, ATFP), or in security (i.e., personnel or physical). Certification in the following areas is preferred (i.e., Firearm, Act 120, MPTC, FLETC exempt). CPR, AED, HAZMAT, and Incident Command certifications and/or training is also preferred. Must be at least 21 years of age and possess a valid U.S. driver's license. Formal or informal leadership is preferred.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "National Security Agency's Police Officers provide armed and uniformed security, force protection, and law enforcement functions in support of NSA's mission, assets, personnel, and facilities headquartered in and around Fort Meade. The NSA Police Force is an integral part of the NSA Security and Counterintelligence organization, which provides NSA worldwide counterintelligence, personnel, and facilities security support. \n\nPrimary Responsibilities: \n- Counterterrorism & Force Protection \n- Pedestrian and vehicular access control \n- Response and mitigation of security, medical, and fire emergencies \n- Critical incident management \n- Enforcement of laws and regulations relative to the protection of NSA assets \n- Vehicle, facility, and material security inspections \n- Firearms training and range management \n- Patrol of NSA property",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "- Enforce federal and state laws and applicable regulations\n- Respond to and investigate incidents\n- Validate badges to determine if individuals are authorized access to controlled areas\n- Operate and maintain proficiency with weapons\n- Patrol agency compounds, facilities, and perimeters to detect and deter potential unlawful acts, security breaches, or dangerous situations\n- Secure dangerous areas\n- Subdue suspects while conducting investigative detentions and/or arrests\n- Stand, walk, or kneel for long periods\n- Perform tasks that involve repetitive motions of the fingers, hands, arms, feet, legs, or other body parts\n- Perform physical activities outdoors under all weather conditions\n- Perform physically strenuous activities when responding to emergencies\n- Maintain endurance and agility in accordance with current regulations in order to perform specific job requirements \n- Drive vehicles, such as cars, vans, or trucks to transport cargo or passengers\n- Operate a motor vehicle under high speeds or high risk conditions\n- Follow safety and security procedures and practices when operating machinery, vehicles, or equipment\n\nOnly the highest caliber individuals qualify for these selected positions. At a minimum, applicants must meet the following qualifications: \n\n- Applicant must be a U.S. citizen.\n\n- Unquestionable loyalty to the United States and sound moral character as established by a comprehensive Federal Special Background Investigation (to include a polygraph).\n\n- Issues that could disqualify an applicant from consideration include, but are not limited to, whether the applicant has engaged in serious criminal activity, recent illegal drug use, a history of adverse employment actions to include absenteeism and termination, or significant credit problems such as recent bankruptcies. \n\n- This position requires the carrying of an Agency-issued firearm. The Gun Control Act of 1968, as amended, and applicable implementing regulations prohibit the NSA from issuing a firearm or ammunition to anyone who has a record of having been convicted of a crime involving domestic violence. Applicants who have been convicted of such a crime are not eligible to be considered for this position. \n\n- At least 21 years of age. \n\n- Excellent physical condition. \n\n- Must meet DoD vision standards for law enforcement occupations.\n\n- Must meet DoD hearing standards for law enforcement occupations. \n\n- Must be willing to work outdoors, shift-work, weekends, holidays, and overtime, under strenuous and potentially dangerous conditions. \n\n- Possess a valid state driver's license. \n\n- Entry is with a high school diploma or GED and no experience.\n\n- Experience working with basic office resources (e.g., e-mail, web browsers, word processors, and presentation graphics), working in security, law enforcement, and/or military service is desired. Must be at least 21 years of age and possess a valid U.S. driver's license. DoD Post Certification, CPR, and AED is preferred.\n\nAPPLICATION INFORMATION \n\nApplicants selected for further processing will be scheduled for the National Police Officer Selection Test (POST), NSA Police Physical Ability Test (PAT) and an Operational Interview. The PAT is included as part of the applicant process as it is a required element of the training. The PAT consists of:\n \n- 19 Push-Ups within 2 minutes\n- 1.5 mile run within 17 minutes and 30 seconds\n\nApplicants who successfully complete the initial testing may be extended a conditional offer of employment contingent upon successful completion of security and medical screenings, as follows: \n\n- Medical/psychological screening by NSA medical staff \n- Full field background investigation and polygraph testing\n\nApplicants selected for the position will have to successfully complete: \n\n- A Federal Law Enforcement Training Accreditation (FLETA) accredited basic academy program\n\nThis training provides a rigorous, physically and academically challenging battery of courses/instruction in law enforcement skills/techniques, which includes classroom instruction with written examinations, graded practical exercises, firearms instruction, and a PAT. \n\nThis training may be waived for candidates who have previously successfully completed a FLETA, CALEA or State P.O.S.T. accredited basic academy program, and can produce the course curriculum, transcript, and official certificate of completion.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Police / Law Enforcement Officer - Entry to Experienced Level (MD, UT, WV)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary Offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range:  $59,141 - $128,956 (Entry/Developmental, Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn-the-job training, Internal NSA courses, and external training will be made available based upon the need and experience of the selectee.\n\nWork Schedule:  Applicants should be aware this position supports 24/7 Operations.\n\nBenefits: All NSA employees are provided a comprehensive Federal employment benefit package that includes: \n\n- Federal health and life insurance options \n- Federal retirement plan \n- 11 paid holidays a year \n- Sick leave accrued at the rate of 4 hours per pay period (13 days/year) \n- Vacation leave ranging from 13-26 days a year (based on years of Federal service) \n- Military leave \n- Shift, weekend, and holiday salary differential \n- Paid overtime \n- Tuition reimbursement program \n- On-site child care (fee for service) \n- Credit Union services \n\nIN ADDITION, OFFICERS ARE PROVIDED: \n- Uniforms, equipment, and laundering at no cost \n- Performance based rank and salary promotions \n- Opportunities to apply for vacancies in the following specialized units: \n- Emergency Response Team (SWAT) \n- Chemical and Biological Rapid Response Team \n- K-9 Unit \n- Dispatch \n- Mountain Bike Patrol \n- Police Training Unit \n- Firearms Instructors",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD || Utah Data Center (UDC), UT || Sugar Grove, WV",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-13T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0a8",
    "jobNumber": "1235242",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "fullDescription": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "grade": "03/1 to 07/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "P",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-31T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: To be considered for our Co-op positions, you must submit a COMPLETE application package by 31 October. Your application package must include: \n\n1. Unofficial transcript with a traditional grading scale (GPA)\n2. PDF copy of your current resume\nIf your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcripts to CoopHiring@uwe.nsa.gov as an attachment.  Please do not send HTML transcripts accessible via a website or text versions thereof. \n\nDEADLINE: Applications are accepted 1 September - 31 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "jobQualifications": null,
    "jobQualificationsExt": "Only applicants that meet the following qualifications will be considered:\n  \n'\tMust be a U.S. Citizen\n'\tMust be a second semester college freshman or a college sophomore\n'\tMust be pursuing the following majors: Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track) or Chinese Language focused major\n'\tPreferred cumulative GPA of 3.0 or higher for all college work completed\n'\tMust be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA's Cooperative Education (Co-op) Program at Hawaii offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure. These Co-op opportunities are open to students who are majoring in Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track) or pursuing a Chinese language focused major. \n\nRight from the start, you will be involved in real life projects and will have full use of NSA labs, equipment, and advanced technologies. These areas will offer you increasing challenges and satisfying learning experiences, since our mission demands that we work on the cutting edge of technology. The full listing of each Co-op description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.\n\nProgram Details: \n'\t52 weeks of alternating semesters of school and work at NSA \n'\tDuring work tours, students work a 40-hour week\n'\tTuition reimbursement for one technical course per semester (up to $2,500)\n'\tEligible for full time employment following successful completion of the program\n\n***PLEASE NOTE:  As this program requires students to rotate between semesters of work and study, applicants are encouraged to discuss the possibility of participating in this type of program with their school (Academic Advisor, Co-Op Advisor, Registrar and/or Financial Aid Office, etc.) to determine the effect it may have on their full time student status during scheduled work tours as well as any effects it may have on scholarships and financial aid. \n \nTravel, housing, or transportation to/from work is not provided.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cooperative Education Program - Hawaii",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salaries are determined by the percentage of credits completed toward a degree. Each 20% block of credits completed with at least a 3.0 GPA will allow you to be promoted to the next grade. Grades range from GGD-03/05 to GGD-07/01, which equates to $39,095- $51,110 annually. Due to the rotational nature of the Co-op program, students are paid proportionate to the number of weeks worked in a year and are authorized Leave without Pay during scheduled school rotations. The salaries aforementioned include a locality based comparability payment.\n\nStudents will receive annual leave, sick leave and paid federal holidays.\n\n \nSPECIAL INCENTIVES/BENEFITS: \n\nHawaii enjoys several tangible and intangible quality of life benefits. All assignees currently receive a Cost of Living Allowance (COLA), taxed by the State of Hawaii and exempt from Federal taxation. For calendar year 2024 this percentage is 8.9% and is subject to change an annual basis.",
    "location": "Honolulu, HI",
    "locationArea": "282",
    "locationFull": "NSA/CSS Hawaii Kunia, HI",
    "locationSpecificId": "L282",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ab",
    "jobNumber": "1235240",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "fullDescription": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "grade": "03/1 to 07/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "P",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-31T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: To be considered for our Co-op positions, you must submit a COMPLETE application package by 31 October. Your application package must include: \n\n1. Unofficial transcript with a traditional grading scale (GPA)\n2. PDF copy of your current resume\nIf your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcripts to CoopHiring@uwe.nsa.gov as an attachment.  Please do not send HTML transcripts accessible via a website or text versions thereof. \n\nDEADLINE: Applications are accepted 1 September - 31 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "jobQualifications": null,
    "jobQualificationsExt": "Only applicants that meet the following qualifications will be considered:\n\n'\tMust be a U.S. Citizen \n'\tMust be pursuing a Chinese language-focused major\n'\tMust be a second semester college freshman or a college sophomore\n'\tPreferred cumulative GPA of 3.0 or higher for all college work completed\n'\tMust be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n'\tMust be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and March 2025",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA's Cooperative Education (Co-op) Program at Fort Meade, MD offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure. These Co-op opportunities are open to students who are pursuing a Chinese language-focused major. \nRight from the start, you will be involved in real life projects and will have full use of NSA labs, equipment, and advanced technologies. These areas will offer you increasing challenges and satisfying learning experiences, since our mission demands that we work on the cutting edge of technology. The full listing of each Co-op description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.\n\nProgram Details: \n'\t52 weeks of alternating semesters of school and work at NSA \n'\tDuring work tours, students work a 40-hour week\n'\tSubsidized student housing and travel entitlements during work tours if over 75 miles from Fort Meade, MD \n'\tTuition reimbursement for one technical course per semester (up to $2,500)\n'\tAlthough not guaranteed, potential for full time employment following successful completion of the program\n\n***PLEASE NOTE:  As this program requires students to rotate between semesters of work and study, applicants are encouraged to discuss the possibility of participating in this type of program with their school (Academic Advisor, Co-Op Advisor, Registrar and/or Financial Aid Office, etc.) to determine the effect it may have on their full time student status during scheduled work tours as well as any effects it may have on scholarships and financial aid.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cooperative Education Program - Language (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salaries are determined by the percentage of credits completed toward a degree. Each 20% block of credits completed with at least a 3.0 GPA will allow you to be promoted to the next grade. Grades range from GGD-03/05 to GGD-07/01, which equates to $40,739-$55,924 annually. Due to the rotational nature of the Co-op program, students are paid proportionate to the number of weeks worked in a year and are authorized Leave without Pay during scheduled school rotations. The salaries aforementioned include a locality based comparability payment.\n\nStudents will receive annual leave, sick leave and paid federal holidays.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ac",
    "jobNumber": "1235712",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in  Morse Code. The program provides hands-on work experience from August 2025 to July 2026 for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "fullDescription": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in  Morse Code. The program provides hands-on work experience from August 2025 to July 2026 for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "grade": "01/1 to 01/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "H",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-22T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Part-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Online applications must be submitted by 1 October 2024. Applications received after the deadline, as well as incomplete packets, will not be considered. \n\nStudents must also submit the following material via email to 373isrg.hr.recruitment@us.af.mil by 1 October 2024:\n\n(1) One Student Evaluation form (please request form from 373isrg.hr.recruitment@us.af.mil or contact your guidance counselor) \n(2) Official transcript from High School, which MUST include their junior year work in progress courses for both first and second semester. \n(3) Resume- Must include the relevant courses completed or in progress as well as the position (Morse Code) to which you are applying. \n\nYou may call NSAA HSWS point of contact for specific questions regarding the program:  NSAA HR Department: 907-552-3284, or, NSA Alaska Chief of Staff: 907-551-3812.\n\nTo apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: U.S. Citizenship is required for all applicants. Additionally, the Federal Government requires all personnel to be fully vaccinated at the time of employment, subject to exceptions as required by law. \n\nReasonable accommodations provided to applicants with disabilities during the application and hiring process where appropriate. NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. \n\nThis position is a Defense Civilian Intelligence Personnel System (DCIPS) position in the Excepted Service under 10 U.S.C. 1601. DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement. If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.\n\nYou may be asked a series of questions depending on the position you apply for. Your responses will be used as part of the screening process of your application and will assist in determining your eligibility for the position. Be sure to elaborate on experiences in your resume. Failure to provide the required information or providing inaccurate information will result in your application not being considered for this position. Only those applicants who meet the qualifications for the position will be contacted to begin employment processing.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The High School Work Study (HSWS) Program is currently a highly competitive program designed for high school students who plan to participate in a paid part-time internship during their senior year. Students have the opportunity to gain work experience in  Morse Code. The program provides hands-on work experience from August 2025 to July 2026 for 4 hours per day/20 hours per week Monday-Friday with a security clearance, part-time salary, paid leave, and the opportunity for permanent employment upon successful completion of the program.",
    "jobQualifications": null,
    "jobQualificationsExt": "- Must be 16 years of age by 31 December 2024\n- Must be eligible to be granted a Security Clearance.\n- Must be a U.S Citizen \n- Unweighted GPA of 2.5 or higher is preferred \n- Must be a High School Junior \n- Must have reliable transportation \n- Must complete or be enrolled in a higher level Computer Science course prior to the completion of the junior year.\n- Students interested in the HSWS Program at the NSA Alaska (NSAA) must reside within commuting distance of Joint Base Elmendorf-Richardson, Anchorage, Alaska.\n\nAvailable Positions within the HSWS Program (Anchorage, AK Only):\n\nMorse Code - Students who are currently enrolled in Computer Science courses. They will use their technical knowledge to perform daily duties to include operations from the Signals Analysis discipline with a primary focus on international Morse code communications and using a wide range of systems and equipment to execute operations.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "HIGH SCHOOL WORK STUDY PROGRAM \n\nThe National Security Agency's (NSA) High School Work Study (HSWS) Morse Code Program application is open only to high school juniors who plan to participate in a school-sponsored Work Experience Program during their senior year.  \n\n**Program is subject to change**\n\nAPPLICATION INFORMATION: \n\nTo apply, students must check with their High School Work Experience Coordinator to determine the school's application process as well as specific course requirements for their school.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "High School Work Study Program - Alaska",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Students will be on a Grade and Step Scale.  All work studies are a Grade 01 Step 01. High School Work Study students are on a part-time schedule and make approximately $15.00 per hour in Alaska.\n\nStudents will earn Annual Leave and Sick Leave at a rate of one hour of Annual Leave and one hour of Sick Leave for every twenty hours worked. \n\nStudents are to work a Monday - Friday work schedule.  All students must work a minimum of 4 hours each day, 5 days a week, Monday through Friday.  Report times are between the hours of 10:30 am and 12:30 pm with core work hours from 12:30 pm to 2:30 pm.  The maximum number of hours a student may work per week is 32 hours.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Anchorage, AK",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  },
  {
    "_id": "66ba26c3b231b421784ee0ae",
    "jobNumber": "1235239",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "fullDescription": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "grade": "03/1 to 07/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "P",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-10-31T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Student Programs",
    "jobFamilyId": "100180",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "To apply for this position, please click the 'Apply' button located at the top right of this posting. After completing the application for the first time, or reviewing previously entered information, and clicking the 'Submit' button, you will receive a confirmation email. Please ensure your spam filters are configured to accept emails from noreply@intelligencecareers.gov. \n\n***PLEASE NOTE: To be considered for our Co-op positions, you must submit a COMPLETE application package by 31 October. Your application package must include: \n\n1. Unofficial transcript with a traditional grading scale (GPA)\n2. PDF copy of your current resume\nIf your Registrar is capable of directly sending electronic transcripts, please have them sent directly to you and then email the transcripts to CoopHiring@uwe.nsa.gov as an attachment.  Please do not send HTML transcripts accessible via a website or text versions thereof. \n\nDEADLINE: Applications are accepted 1 September - 31 October, however, selections for this program are made on a rolling basis and applicants are encouraged to apply as soon as possible to allow sufficient time for review and security clearance processing.\n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  NSA is committed to cultural diversity in its workplace.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-09-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA's Cooperative Education (Co-op) Program offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure.",
    "jobQualifications": null,
    "jobQualificationsExt": "Only applicants that meet the following qualifications will be considered:\n  \n'\tMust be a U.S. Citizen\n'\tMust be pursuing the following majors: Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track), Data Science, or Mathematics. \n'\tMust be a second semester college freshman or a college sophomore\n'\tPreferred cumulative GPA of 3.0 or higher for all college work completed\n'\tMust be eligible to be granted a TS/SCI security clearance after successfully completing a background investigation, a Full-scope Polygraph and a Psychological Evaluation\n'\tMust be available and in the U.S. for operational and technical interviews and other applicable processing, both in-person and via telephone/internet, between the months of November 2024 and March 2025",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA's Cooperative Education (Co-op) Program at Fort Meade, MD offers students exciting, impactful professional work opportunities (with pay and benefits!) to grow their knowledge of the Intelligence Community and federal government while advancing NSA's two primary missions: 1) Collecting, analyzing, and producing foreign signals intelligence; and 2) Providing cybersecurity solutions and guidance to protect critical national infrastructure. These Co-op opportunities are open to students who are majoring in Computer Science, Computer Engineering, Electrical Engineering, Cyber Security (technical track), Data Science, or Mathematics. Right from the start, you will be involved in real life projects and will have full use of NSA labs, equipment, and advanced technologies. These areas will offer you increasing challenges and satisfying learning experiences, since our mission demands that we work on the cutting edge of technology. The full listing of each Co-op description and details can be found by visiting: Intelligencecareers.gov/nsa/students-and-internships. If unable to open this link, please copy and paste into your browser.\n\nProgram Details: \n'\t52 weeks of alternating semesters of school and work at NSA \n'\tSubsidized student housing and travel entitlements during work tours if over 75 miles from Fort Meade, MD \n'\tTuition reimbursement for one technical course per semester (up to $2,500)\n'\tAlthough not guaranteed, potential full time employment following successful completion of the program\n\n***PLEASE NOTE:  As this program requires students to rotate between semesters of work and study, applicants are encouraged to discuss the possibility of participating in this type of program with their school (Academic Advisor, Co-Op Advisor, Registrar and/or Financial Aid Office, etc.) to determine the effect it may have on their full time student status during scheduled work tours as well as any effects it may have on scholarships and financial aid.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": null,
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cooperative Education Program (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Salaries are determined by the percentage of credits completed toward a degree. Each 20% block of credits completed with at least a 3.0 GPA will allow you to be promoted to the next grade. Grades range from GGD-03/05 to GGD-07/01, which equates to $40,739-$55,924 annually. Due to the rotational nature of the Co-op program, students are paid proportionate to the number of weeks worked in a year and are authorized Leave without Pay during scheduled school rotations. The salaries aforementioned include a locality based comparability payment.\n\nStudents will receive annual leave, sick leave and paid federal holidays.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-09-01T00:00:00.000Z"
  }
]
