[
  {
    "_id": "66607d11b231b42178d4d940",
    "jobNumber": "1232561",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The Office of Occupational Health & Well-Being (OHWB), known as the NSA Medical Center, supports the mission by applying professional knowledge in Occupational Health, Environmental, Industrial Hygiene and Safety operating in accordance with all governing body regulations. OHWB personnel will provide clinical services, including emergency response, physical exams, immunizations, vision and preventative health screenings. Personnel will also provide technical, managerial, and administrative services to the entire workforce. Promoting, assessing and optimizing the health and safety of the NSA workforce and workplace is always priority.",
    "fullDescription": "The Office of Occupational Health & Well-Being (OHWB), known as the NSA Medical Center, supports the mission by applying professional knowledge in Occupational Health, Environmental, Industrial Hygiene and Safety operating in accordance with all governing body regulations. OHWB personnel will provide clinical services, including emergency response, physical exams, immunizations, vision and preventative health screenings. Personnel will also provide technical, managerial, and administrative services to the entire workforce. Promoting, assessing and optimizing the health and safety of the NSA workforce and workplace is always priority.",
    "grade": "13/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "D",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-07-18T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Medicl and Occupatnal Hlth",
    "jobFamilyId": "100100",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-06-06T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The Office of Occupational Health & Well-Being (OHWB), known as the NSA Medical Center, supports the mission by applying professional knowledge in Occupational Health, Environmental, Industrial Hygiene and Safety operating in accordance with all governing body regulations. OHWB personnel will provide clinical services, including emergency response, physical exams, immunizations, vision and preventative health screenings. Personnel will also provide technical, managerial, and administrative services to the entire workforce. Promoting, assessing and optimizing the health and safety of the NSA workforce and workplace is always priority.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Clinical or Counseling Psychology.  A valid license to practice psychology in any state or territory is required.\n\nSENIOR\nEntry is with a Doctoral degree plus 2 years of relevant experience.\nRelevant experience must be in clinical psychology, and may also include performing psychology-related work (internships count against this requirement). \n\nEXPERT\nEntry is with a Doctoral degree plus 12 years of relevant experience.\nRelevant experience must be in clinical psychology (internships count against this requirement).",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency (NSA), America's premier cryptologic organization, is seeking experienced, doctoral-level Clinical Psychologists.  The successful candidates will join one of three distinct teams; all multidisciplinary requiring flexibility within a dynamic work environment. \n\n(1)\tPsychological Services - Assessment \n\nThe selected individual will apply professional psychological knowledge and skills to conduct mission-related risk assessments, consultations, and trainings. These functions play a vital role in assisting internal customers with making security, suitability and/or management decisions. Specific job duties may include: (a) assessment of applicants, employees and affiliates; (b) consultation to security regarding security clearances and other adjudicative decisions; (c) selection of individuals for sensitive/high-risk assignments; (d) screening of civilian and military personnel for pre- and post-deployment processing; and (e) consultation to supervisors and military commanders regarding personnel and administrative decisions. Administrative responsibilities may include coordination of services provided by contractors, program development and/or management, maintaining data and records, quality assurance and customer service, and developing, mentoring, and coaching others.\n\n(2)\tEmployee Assistance Services - Therapy \n\nThe selected individual will support the NSA mission by providing psychological treatment for civilians and military service members, as well as their spouses. The clinical psychologist will perform clinical intake assessments, followed by brief therapy (8-10 sessions) within individual, couples, or group modalities. On-call and emergency response is required to address employees who are at risk of harm to themselves or others. Psychoeducational classes, clinical presentations, and peer review meetings with on-site clinicians are all included in the scope of work. \n\n(3)\tWorkplace Psychological Consultation - Management Consultation \n\nThe selected individual will support the NSA mission by providing multi-tiered support to managers at all levels including Embedded Psychological Support, Tailored Consultations to Management, and Psychological Education and Training. Workplace consultations will focus on identifying and mitigating individual and organizational issues as well as consultation and training for operational personnel. Psychoeducational classes on topics such as depression, stress reduction, suicide awareness and prevention, and deployment are included in the scope of work.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate must have a PhD or PsyD in Clinical or Counseling Psychology from an APA-accredited program. Successful completion of an APA-accredited clinical internship is preferred. A current and valid license to practice psychology in one of the 50 states, the District of Columbia, or US Territory with no pending adverse actions (e.g. suspensions, restrictions, or revocations) is required. At least 2 years post-licensure clinical experience is required, which may include post-doctorate internship. \n\nThe ideal candidate will possess a knowledge of the principles, theories and accepted practices of Clinical Psychology as they relate to knowledge and skills to (a) assess employees and affiliates; (b) identify, prevent and solve individual and organizational adjustment problems; (c) optimize work/life balance for individuals and organizations; (d) provide psychological consultation and training to operational managers and personnel; (e) provide referrals, advice, or consulting on counseling, EAPs, or medical treatment options; (f) apply emergency and crisis management procedures (e.g., crisis interventions); and (g) detect and attend to the behavior of others, including verbal and non-verbal cues that may indicate a potential security issue or concern.  Experience working with any of the following populations is preferred, but not required: Intelligence Community, Department of Defense (military or civilian), forensic practice; or law enforcement agencies.\n\nPlease annotate, in ranking order, your position preference on the cover letter.  The choices, as stated above, are (1) Psychological Assessment to provide psychological consultation to Agency partners who make operational, adjudicative, management decisions about personnel; (2) Employee Assistance Services to provide short-term therapy to NSA civilians, military, and their spouses; and (3) Workplace Psychological Consultation to provide leadership support in high-tempo operational organizations to proactively address culture and organizational issues.\n\nThere are opportunities in all 3 teams at NSA's Headquarters (Fort Meade, Maryland). In addition, rotational positions for Employee Assistance Services (therapy) are available in Fort Gordon, Georgia; Kunia, Hawaii; Joint Base San Antonio, Texas; and Anchorage, Alaska. Enterprise locations are typically a 3-year rotational assignment. Please indicate on the cover letter if you are interested in an Enterprise rotational position opportunity.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Clinical Psychologist - Experienced to Expert Level (MD, GA, TX, AK, HI)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $103,409 - $191,900 (Senior, Expert)\nSalary range varies by location, work level, and relevant experience to the position.\nThis position is hiring for Maryland, Georgia, Texas, Hawaii, and Alaska.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Anchorage, AK || Fort Eisenhower, GA || NSA/CSS Hawaii Kunia, HI || Fort George G. Meade Complex, MD || NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L225",
    "postedDate": "2024-06-06T00:00:00.000Z"
  },
  {
    "_id": "6650ab54b231b4217856666c",
    "jobNumber": "1231591",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you passionate about using your foreign language skills, working at the forefront of NSA's exciting SIGINT mission? Opportunities include either the Direct Hire, Language Analysis Development Program (LADP), or Enhancement Cross-training. Click below to learn more.",
    "fullDescription": "Are you passionate about using your foreign language skills, working at the forefront of NSA's exciting SIGINT mission? Opportunities include either the Direct Hire, Language Analysis Development Program (LADP), or Enhancement Cross-training. Click below to learn more.",
    "grade": "07/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "L",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-17T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Language Analysis",
    "jobFamilyId": "100020",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-06-03T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you passionate about using your foreign language skills, working at the forefront of NSA's exciting SIGINT mission? Opportunities include either the Direct Hire, Language Analysis Development Program (LADP), or Enhancement Cross-training. Click below to learn more.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nRelevant experience must be in one or more of the following: performing professional work in the language (for example, translation, transcription), military, teaching, and analysis; OR non-language work in a field such as intelligence analysis, international relations, security studies, intelligence studies, journalism, law, STEM fields (for example, computer science, chemistry, space or weapons systems, or cyber), and other topics relevant to NSA mission. \n\nApplicant must have a minimum language proficiency of Interagency Language Roundtable (ILR) equal to a level 2/2 in reading and listening in the target language for which the applicant is being considered, OR be selected for placement in and commit to the Agency's intensive language training (acquisition or enhancement) programs. Selection for these programs is done in collaboration with the Language Analysis Skill Community and Language Analysis Development Program, and is intended for use with hard-to-fill or critical languages.\n\nMinimum ILR proficiency levels for the intensive language training programs are as follows (education and experience requirements above also apply): \n\nApplicants for the enhancement program must have either:\n(a) a minimum language proficiency equal to a combined score of ILR Level 1/1 (for example: 0+/1+, 2/0, where 0+=.5, 1 = 1, 1+ = 1.5, 2 = 2) in the target language for which the applicant is being considered\nOR\n(b) a minimum score of 110 on the DLAB.\n\n\nApplicants being considered for the acquisition program must have either: \n(a) a minimum language proficiency of ILR Level 2/2 in any world language other than English;\nOR\n(b) a minimum score of 110 on the DLAB.\n\n\nENTRY/DEVELOPMENTAL\nEntry is with a high school diploma or GED plus 4 years of relevant experience, or an Associate's degree plus 2 years of relevant experience, or a Bachelor's degree with no experience. A degree in any field is acceptable. \n\nFULL PERFORMANCE\nEntry is with a high school diploma or GED plus 7 years of relevant experience, or an Associate's degree plus 5 years of relevant experience, or a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. A degree in any field is acceptable.  \n\nSENIOR\nEntry is with a high school diploma or GED plus 10 years of relevant experience, or an Associate's degree plus 8 years of relevant experience, or a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. A degree in any field is acceptable.\n\nEXPERT\nEntry is with a high school diploma or GED plus 13 years of relevant experience, or an Associate's degree plus 11 years of relevant experience, or a Bachelor's degree plus 9 years of relevant experience, or a Master's degree plus 7 years of relevant experience, or a Doctoral degree plus 5 years of relevant experience. A degree in any field is acceptable.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA's Linguists, known as Multidisciplined Language Analysts (MDLAs), are expected to take an inclusive approach to problem solving and mission accomplishment by frequently engaging with partners, enablers, and customers across the Intelligence Community.\n\nBased on skill level and experience, NSA MDLAs are considered for either the Language Analysis Development Program (LADP); the Chinese Enhancement Cross-Training Program; or in the case of MDLAs with extensive experience in Signals Intelligence (SIGINT), direct hire into positions supporting an analytic mission office.\n\nLADP:\nThe LADP, which lasts up to three years, is designed to provide an intensive, accelerated opportunity to acquire the unique technical skills and experience needed to successfully apply knowledge and analytic ability to the SIGINT mission and help MDLAs achieve core analytic competencies in accordance with the Cryptologic Training System Training Standard and the MDLA competencies framework. The program includes 4-5 operational tours in a variety of offices, interspersed with formal classroom and computer-based training. These on-the-job operational tours are primarily focused on analyzing foreign language materials within the framework of the two main SIGINT disciplines of intelligence analysis - SIGINT reporting and SIGINT development.\n\nCross-Training Program (Language Enhancement):\nThe current Language Analysis Cross Training Program is designed to enhance an existing language which is critically needed to fulfill NSA's mission. After successful completion of the Cross-Training program, most graduates will enter the Language Analysis Development Program (LADP), which lasts up to three years.\nMDLAs are at the forefront of carrying out NSA's SIGINT mission, and they do so in a variety of ways:\n\n- Offer U.S. policymakers and military leaders a window into the foreign language world of intelligence targets by analyzing, transcribing, and translating key information\n- Research and understand foreign intelligence targets, how they operate, and how they fit in the larger geo-political context\n- Apply new techniques and develop creative solutions to address analytic problems such as synthesizing large volumes of data and disparate sources of information\n- Demonstrate a firm understanding of the communications environment and technology trends of foreign intelligence targets\n- Craft written and oral assessments of foreign intelligence that provide unique insights into target intentions unavailable from other intelligence disciplines\n- Work independently and collaborate effectively (both within NSA and with other analysts in the Intelligence Community) in research, analysis, and reporting",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is intellectually curious, has a desire for continual learning, and is:\n\n- Proficient (reading and listening) in one or more critical foreign languages, including Chinese, Persian Farsi, Arabic, Russian, Ukrainian, and other languages as missions and needs evolve, and/or the lower-density languages Somali (with Maay Maay), Swahili (with Kalenjin, Luo, Kikuyu,), French (with Lingala or Bambara), Urdu (with Punjabi), and Pashto - (this requirement only applies to Direct hire and LADP applicants)\n\n- Well organized and able to handle multiple assignments\n- A strong written and oral communicator\n- Able to synthesize information to solve complex problems\n- Able to provide timely and accurate customer service\n\nCoursework, knowledge, and experience in one or more of the following is desired:\n- Target development\n- Social network analysis\n- Metadata analysis\n- Research methodology\n- Topical or Regional studies relevant to national security\n- Quantitative/Statistical analysis\n- Data modeling, mining, or science\n- Cyber security\n- Computer science or networking\n- Telecommunications\n\nRelevant Internships, extracurricular activities, and/or foreign study are also considered. \nPrior military without a degree but with language analysis cryptologic experience will be considered.\n\nIn most cases, Experienced Level Language Analysts at NSA will have substantial experience in one or more of the following areas:\n- Performing language quality control;\n- Serving as an established Subject Matter Expert (SME);\n- Authoring and releasing reports;\n- Mentoring, coaching, and leading other Language Analysts;\n- Ensuring the technical health of the mission;\n- Mastering and coaching others on the use of a variety of internal tools;\n- Testing at Interagency Language Roundtable (ILR) 3/3 levels for one or more mission languages; and\n- Displaying a broad knowledge of the Intelligence Community and how various elements work together to prosecute mission.\n\nNOTE:  If you are selected to process further, you will be required to complete an online interview and take the Defense Language Proficiency Test (DLPT) which measures language proficiency and/or the Defense Language Aptitude Battery (DLAB) which measures potential for learning a foreign language. Invitations and instructions for the online interview and scheduling for the language test will be emailed to you - you must complete these steps before your application can be considered for further processing. Please check your Spam folder just in case these emails landed there instead of your Inbox. You will be required to test within one month of receiving the language test email as this information will be used as part of the selection decision.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Linguist / Language Analyst - Entry to Expert Level (MD, HI, GA, TX, UT, CO, AK)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $49,025 - $191,900 (Entry/Developmental, Full Performance, Senior, Expert) \nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Anchorage, AK || Denver/Aurora, CO || Fort Eisenhower, GA || Honolulu, HI || Fort George G. Meade Complex, MD || San Antonio, TX || Draper, Utah, UT",
    "locationSpecificId": "L225",
    "postedDate": "2024-06-03T00:00:00.000Z"
  },
  {
    "_id": "664e085cb231b42178406c90",
    "jobNumber": "1231923",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "09/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-24T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-05-24T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Computer Science (CS) or related field (e.g., Engineering, Mathematics). Degrees in Information Technology, Information Systems, Information Security, Networking (Systems Administration), and Cybersecurity may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and upper-level mathematics. \n\nRelevant experience must be in one or more of the following: design/development of computer or information systems to include engineering hardware and/or software over their lifecycle (i.e., requirements analysis, design, implementation, testing, integration, deployment/installation, and maintenance), programming, computer systems research, reverse engineering, or computer/network security. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience). Cybersecurity Certifications (e.g., NET+, Security+, Certified Information System Security Professional (CISSP), and Certification Accreditation Professional (CAP)) may count as a total of 1 year of experience.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The need to maintain our core Computer Science group is vital to provide the technical capabilities necessary to successfully execute NSA's mission. The increased complexity of supporting NSA's mission requires world class researchers, programmers, and developers who operate in teams in areas such as software engineering, information technology infrastructure, high performance computing, data science, architectures, computer security, and networking in order to design and develop advanced tools, techniques, and systems.\n\nComputer Systems Security Managers (CSSMs) at the NSA play a vital role in maintaining the confidentiality, availability, and integrity of the Agency computing infrastructure. As a CSSM at the NSA, your responsibilities may include:\n\n- Supporting a program, organization, system, or enclave \n- Reviewing investigative processing of security incidents\n- Developing or interpreting computer security policies\n- Overseeing, evaluating and supporting the security authorization process \n- Providing leadership, management and direction of cybersecurity activities\n- Advising senior leadership (e.g., Chief Information Security Officer [CISO], Authorizing Official [AO]) on risk levels, and changes affecting the organization's cybersecurity posture \n- Advising senior leadership of information security programs, policies, processes, systems, and mission elements",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for experiential learning and strong problem-solving, analytic and interpersonal skills who is: \n\n- Able to work effectively across several different functional areas in a collaborative environment\n- Able to communicate effectively (both orally and written), individually and in teams\n- Well-organized and able to handle multiple assignments\n- Willing to take the initiative \n- Willing to be innovative to achieve success\n\nKnowledge and experience in one or more of the following is desired: \n\n- Applying confidentiality, integrity, and availability principles \n- Computer systems and networking operations, concepts and protocols\n- Creating security processes for Agency Infrastructure Systems, adhering to standard agency security policies\n- Applying cybersecurity and privacy laws, regulations, policies, and ethics\n- Cyber threat and vulnerability mitigation\n- Incident response\n- Information assurance best practices\n- SSPs, SOPs, NIST, COOP, and other IT-related security policies\n- Risk management processes (e.g., methods for assessing and mitigating risk)\n- Windows and Linux systems administration within physical and virtual workstations and servers operating environments \n- VMware ESXi, vSphere\n- Applying system and security patches\n- Managing hardware and/or software over their lifecycle\n- Network configurations & security (e.g., managing firewall, routers, switches, TCP/IP, VOIP, wireless protocols) \n- System and network security methodologies\n- Vulnerability scanning and analysis",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Computer Systems Security Manager - Mid to Experienced Level (MD, TX)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range:  $92,398 - $187,662 (Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD || NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L225",
    "postedDate": "2024-05-24T00:00:00.000Z"
  },
  {
    "_id": "663ce4d7b231b42178b53925",
    "jobNumber": "1230794",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The United States has experienced profound changes that impact the way the National Security Agency (NSA) conducts its mission. The explosion of Internet communications has created a need for the Computer Network Operations (CNO) mission. This very important mission includes computer network defense and computer network exploitation. In order to carry out these functions NSA is looking for IT Security Professionals who are highly skilled, want to stay on the leading edge of technology and impassioned about ensuring the United States maintains a strategic edge in cyberspace. These are NOT your average Cyber, Computer Science, Networking, or Engineering jobs!\n\nNSA is in search of top-notch certified cyber professionals with technical expertise and driving desire at the forefront of their field. We have positions in penetration testing, defensive operations, identifying cyber threats and vulnerabilities and building defensive capabilities, designing, developing, deploying, sustaining and monitoring state-of-the-art network solutions (WAN, CAN, LAN, DCN and Satellite communications networks) that are deployed across NSA worldwide.  Help protect national security interests as part of the world's most advanced team of cyber professionals!",
    "fullDescription": "The United States has experienced profound changes that impact the way the National Security Agency (NSA) conducts its mission. The explosion of Internet communications has created a need for the Computer Network Operations (CNO) mission. This very important mission includes computer network defense and computer network exploitation. In order to carry out these functions NSA is looking for IT Security Professionals who are highly skilled, want to stay on the leading edge of technology and impassioned about ensuring the United States maintains a strategic edge in cyberspace. These are NOT your average Cyber, Computer Science, Networking, or Engineering jobs!\n\nNSA is in search of top-notch certified cyber professionals with technical expertise and driving desire at the forefront of their field. We have positions in penetration testing, defensive operations, identifying cyber threats and vulnerabilities and building defensive capabilities, designing, developing, deploying, sustaining and monitoring state-of-the-art network solutions (WAN, CAN, LAN, DCN and Satellite communications networks) that are deployed across NSA worldwide.  Help protect national security interests as part of the world's most advanced team of cyber professionals!",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "N",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-13T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Cyber",
    "jobFamilyId": "100040",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-05-13T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The United States has experienced profound changes that impact the way the National Security Agency (NSA) conducts its mission. The explosion of Internet communications has created a need for the Computer Network Operations (CNO) mission. This very important mission includes computer network defense and computer network exploitation. In order to carry out these functions NSA is looking for IT Security Professionals who are highly skilled, want to stay on the leading edge of technology and impassioned about ensuring the United States maintains a strategic edge in cyberspace. These are NOT your average Cyber, Computer Science, Networking, or Engineering jobs!\n\nNSA is in search of top-notch certified cyber professionals with technical expertise and driving desire at the forefront of their field. We have positions in penetration testing, defensive operations, identifying cyber threats and vulnerabilities and building defensive capabilities, designing, developing, deploying, sustaining and monitoring state-of-the-art network solutions (WAN, CAN, LAN, DCN and Satellite communications networks) that are deployed across NSA worldwide.  Help protect national security interests as part of the world's most advanced team of cyber professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.  \n\nDegree must be in Network Engineering, Systems Engineering, Information Technology, Computer Science, Mathematics, Data Science, or related field (e.g., General Engineering, Computer Engineering, Electrical Engineering, Computer Science, Computer Forensics, Cyber Security, Software Engineering, Information Assurance, or Computer Security).\n\nRelevant experience must be in one or more of the following: computer or information systems design/development, programming, information/cyber/network security, vulnerability analysis, penetration testing, computer forensics, information assurance and/or systems engineering. Additionally, must have experience in network or system administration. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course), Undergraduate Cyber Training (UCT), Network Warfare Bridge Course (NWBC)/Intermediate Network Warfare Training (INWT), Cyber Defense Operations will be considered towards the relevant experience requirement (i.e., 20-24 weeks course will count as 6 months of experience, 10-14 weeks will count as 3 months of experience).\n\nFULL PERFORMANCE\n\nEntry is with a Bachelor's degree plus 3 years of relevant experience; a Master's degree plus 1 year of relevant experience; a Doctoral degree and no experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 5 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 5 years of relevant experience; or successful completion of CNO Apprentice Exploiter (A*X) certification plus 3 years of relevant experience.\n\nSENIOR\n\nEntry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 8 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 8 years of relevant experience; or successful completion of CNO Journeyman Exploiter (J*X) certification, CNO Master Operator, Red Team Journeyman, or Red Team Master Operator Certification plus 4 years of relevant experience.\n\nEXPERT\n\nEntry is with a Bachelor's degree plus 9 years of relevant experience, or a Master's degree plus 7 years of relevant experience, or a Doctoral degree plus 5 years of relevant experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 11 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 11 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The professionals at the National Security Agency (NSA) have one common goal: to protect our nation.  The mission requires a strong offense and a steadfast defense.  The offense collects, processes and disseminates intelligence information derived from foreign signals for intelligence and counterintelligence purposes.  The defense prevents adversaries from gaining access to sensitive classified national security information.\n\nOn the offensive side of the NSA mission you will:\n\n-\tExecute computer network operations against foreign adversaries' information systems and networks\n-\tUse advanced software applications for network navigation, tactical forensic analysis, and collection of valuable intelligence information\n-\tResearch and implement solution sets to influence and enhance network offensive posture.\n\nOn the defensive side of the NSA mission, as part of the Red Team, you will:\n\n-\tExecute computer network operations against official US government organizations worldwide for the purpose of strengthening information system security \n-\tIdentify intrusions and vulnerabilities and recommend mitigation strategies and techniques to secure networks \n-\tIdentify, analyze and develop defensive measures to thwart advanced, state-sponsored intrusions of DoD and Federal Government networks around the world\n-\tConduct and support Computer Network Operations to interactively search for Advanced Persistent Threats (APT) and Indicators of Compromise (IOC) using enhanced data collection and analysis methods\n-\tUse advanced software applications for network navigation, perform tactical forensic analysis and collect valuable network data to proactively identify and characterize adversarial activity.\n\nCyber Networking Certification (Apprentice, Journeyman, or Master) is required.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with solid decision making and problem solving skills, ability to react quickly, and technical proficiency in several of the following areas: \n\n-\tOperating systems fundamentals (Windows and/or Unix/Linux)\n-\tSystem administration (Windows and/or Unix/Linux)\n-\tNetwork administration \n-\tNetwork traffic analysis \n-\tPenetration testing \n-\tNetwork security\n-\tIncident response\n-\tComputer and network forensics \n-\tVulnerability and malware analysis \n-\tLow level protocol and packet analysis \n-\tScripting and/or programming languages\n\nThis position is well-suited for individuals who enjoy visiting network security websites, attending conferences such as Black Hat / DEFCON, setting up and maintaining their own network or competing in Capture the Flag events.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Cyber Network Professional (Certified) - Offensive/Defensive Operations - Mid to Expert Level (GA, HI, MD, and TX)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $191,900 (Full Performance - Expert)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  Applicants should be aware that some of these jobs support 24/7 operations based on mission requirements and shift schedules may vary to include night shift.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort Eisenhower, GA || NSA/CSS Hawaii Kunia, HI || Fort George G. Meade Complex, MD || NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L225",
    "postedDate": "2024-05-13T00:00:00.000Z"
  },
  {
    "_id": "663a41f3b231b421789e07b8",
    "jobNumber": "1230841",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police on its complexes at Fort Meade, Maryland. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "fullDescription": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police on its complexes at Fort Meade, Maryland. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "grade": "07/1 to 12/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "6",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-30T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Physical Security",
    "jobFamilyId": "100110",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-05-08T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "The National Security Agency (NSA) has a current and ongoing requirement for personnel to serve as Full-time officers with the NSA Police on its complexes at Fort Meade, Maryland. Qualified individuals are encouraged to apply for these exciting and highly dynamic positions offering unlimited career growth, exceptional training, and the opportunity to serve your country as an employee of one of the most unique and respected Agencies in the Federal government.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nENTRY/DEVELOPMENTAL\n\nEntry is with a high school diploma or GED and no experience.\n\nExperience working with basic office resources (e.g., e-mail, web browsers, word processors, and presentation graphics), working in security, law enforcement, and/or military service is desired. Must be at least 21 years of age and possess a valid U.S. driver's license. Certification in Act 120, MPTC, FLETC exempt, CPR, and AED is preferred.\n\nFULL PERFORMANCE \n\nEntry is with a high school diploma or GED plus 4 years of relevant experience, or an Associate degree plus 2 years of relevant experience.\n\nDegree in Criminology, Behavioral Science, Law Enforcement, or a Security related field is preferred, but a degree in any field is acceptable.\n\nRelevant experience must be with NSA police, equivalent experience (e.g., SARU, ATFP), or in security (i.e., personnel or physical). Certification in the following areas is preferred (i.e., Firearm, Act 120, MPTC, FLETC exempt). CPR, AED, HAZMAT, and Incident Command certifications and/or training is also preferred. Must be at least 21 years of age and possess a valid U.S. driver's license. Formal or informal leadership is preferred.\n\nSENIOR\n\nEntry is with a high school diploma or GED plus 6 years of relevant experience, or an Associates Degree plus 4 years of relevant experience, or a Bachelor's degree plus 2 years of relevant experience.\n\nDegree in Criminology, Behavioral Science, Law Enforcement, or a Security related field is preferred, but a degree in any field is acceptable.\n\nRelevant experience must be with NSA police, equivalent experience (e.g., SARU, ATFP), or in security (i.e., personnel or physical). Certification in the following areas is preferred (i.e., Firearm, Act 120, MPTC, FLETC exempt). CPR, AED, HAZMAT, and Incident Command certifications and/or training is also preferred. Must be at least 21 years of age and possess a valid U.S. driver's license. Formal or informal leadership is preferred.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "National Security Agency's Police Officers provide armed and uniformed security, force protection, and law enforcement functions in support of NSA's mission, assets, personnel, and facilities headquartered in and around Fort Meade. The NSA Police Force is an integral part of the NSA Security and Counterintelligence organization, which provides NSA worldwide counterintelligence, personnel, and facilities security support. \n\nPrimary Responsibilities: \n- Counterterrorism & Force Protection \n- Pedestrian and vehicular access control \n- Response and mitigation of security, medical, and fire emergencies \n- Critical incident management \n- Enforcement of laws and regulations relative to the protection of NSA assets \n- Vehicle, facility, and material security inspections \n- Firearms training and range management \n- Patrol of NSA property",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "- Enforce federal and state laws and applicable regulations\n- Respond to and investigate incidents\n- Validate badges to determine if individuals are authorized access to controlled areas\n- Operate and maintain proficiency with weapons\n- Patrol agency compounds, facilities, and perimeters to detect and deter potential unlawful acts, security breaches, or dangerous situations\n- Secure dangerous areas\n- Subdue suspects while conducting investigative detentions and/or arrests\n- Stand, walk, or kneel for long periods\n- Perform tasks that involve repetitive motions of the fingers, hands, arms, feet, legs, or other body parts\n- Perform physical activities outdoors under all weather conditions\n- Perform physically strenuous activities when responding to emergencies\n- Maintain endurance and agility in accordance with current regulations in order to perform specific job requirements \n- Drive vehicles, such as cars, vans, or trucks to transport cargo or passengers\n- Operate a motor vehicle under high speeds or high risk conditions\n- Follow safety and security procedures and practices when operating machinery, vehicles, or equipment\n\nOnly the highest caliber individuals qualify for these selected positions. At a minimum, applicants must meet the following qualifications: \n\n- Applicant must be a U.S. citizen.\n\n- Unquestionable loyalty to the United States and sound moral character as established by a comprehensive Federal Special Background Investigation (to include a polygraph).\n\n- Issues that could disqualify an applicant from consideration include, but are not limited to, whether the applicant has engaged in serious criminal activity, recent illegal drug use, a history of adverse employment actions to include absenteeism and termination, or significant credit problems such as recent bankruptcies. \n\n- This position requires the carrying of an Agency-issued firearm. The Gun Control Act of 1968, as amended, and applicable implementing regulations prohibit the NSA from issuing a firearm or ammunition to anyone who has a record of having been convicted of a crime involving domestic violence. Applicants who have been convicted of such a crime are not eligible to be considered for this position. \n\n- At least 21 years of age. \n\n- Excellent physical condition. \n\n- Must meet DoD vision standards for law enforcement occupations.\n\n- Must meet DoD hearing standards for law enforcement occupations. \n\n- Must be willing to work outdoors, shift-work, weekends, holidays, and overtime, under strenuous and potentially dangerous conditions. \n\n- Possess a valid state driver's license. \n\n- Entry is with a high school diploma or GED and no experience.\n\n- Experience working with basic office resources (e.g., e-mail, web browsers, word processors, and presentation graphics), working in security, law enforcement, and/or military service is desired. Must be at least 21 years of age and possess a valid U.S. driver's license. DoD Post Certification, CPR, and AED is preferred.\n\nAPPLICATION INFORMATION \n\nApplicants selected for further processing will be scheduled for the National Police Officer Selection Test (POST), NSA Police Physical Ability Test (PAT) and an Operational Interview. The PAT is included as part of the applicant process as it is a required element of the training. The PAT consists of:\n \n- 19 Push-Ups within 2 minutes\n- 1.5 mile run within 17 minutes and 30 seconds\n\nApplicants who successfully complete the initial testing may be extended a conditional offer of employment contingent upon successful completion of security and medical screenings, as follows: \n\n- Medical/psychological screening by NSA medical staff \n- Full field background investigation and polygraph testing\n\nApplicants selected for the position will have to successfully complete: \n\n- A Federal Law Enforcement Training Accreditation (FLETA) accredited basic academy program\n\nThis training provides a rigorous, physically and academically challenging battery of courses/instruction in law enforcement skills/techniques, which includes classroom instruction with written examinations, graded practical exercises, firearms instruction, and a PAT. \n\nThis training may be waived for candidates who have previously successfully completed a FLETA, CALEA or State P.O.S.T. accredited basic academy program, and can produce the course curriculum, transcript, and official certificate of completion.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "NSA Police / Law Enforcement Officer - Entry to Experienced Level (MD, HI)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary Offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range:  $59,141 - $128,956 (Entry/Developmental, Full Performance, Senior)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn-the-job training, Internal NSA courses, and external training will be made available based upon the need and experience of the selectee.\n\nWork Schedule:  Applicants should be aware this position supports 24/7 Operations.\n\nBenefits: All NSA employees are provided a comprehensive Federal employment benefit package that includes: \n\n- Federal health and life insurance options \n- Federal retirement plan \n- 11 paid holidays a year \n- Sick leave accrued at the rate of 4 hours per pay period (13 days/year) \n- Vacation leave ranging from 13-26 days a year (based on years of Federal service) \n- Military leave \n- Shift, weekend, and holiday salary differential \n- Paid overtime \n- Tuition reimbursement program \n- On-site child care (fee for service) \n- Credit Union services \n\nIN ADDITION, OFFICERS ARE PROVIDED: \n- Uniforms, equipment, and laundering at no cost \n- Performance based rank and salary promotions \n- Opportunities to apply for vacancies in the following specialized units: \n- Emergency Response Team (SWAT) \n- Chemical and Biological Rapid Response Team \n- K-9 Unit \n- Dispatch \n- Mountain Bike Patrol \n- Police Training Unit \n- Firearms Instructors",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "NSA/CSS Hawaii Wahiawa, HI || Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-05-08T00:00:00.000Z"
  },
  {
    "_id": "663104f4b231b42178510976",
    "jobNumber": "1230456",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you an emerging or network professional who wants to work our nation's tough cybersecurity problems and protect our nation?  The mission requires a strong offense and a steadfast defense. The offense collects, processes and disseminates intelligence information derived from foreign signals for intelligence and counterintelligence purposes. The defense prevents adversaries from gaining access to sensitive classified national security information.",
    "fullDescription": "Are you an emerging or network professional who wants to work our nation's tough cybersecurity problems and protect our nation?  The mission requires a strong offense and a steadfast defense. The offense collects, processes and disseminates intelligence information derived from foreign signals for intelligence and counterintelligence purposes. The defense prevents adversaries from gaining access to sensitive classified national security information.",
    "grade": "11/1 to 14/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "N",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-28T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Cyber",
    "jobFamilyId": "100040",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-05-03T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you an emerging or network professional who wants to work our nation's tough cybersecurity problems and protect our nation?  The mission requires a strong offense and a steadfast defense. The offense collects, processes and disseminates intelligence information derived from foreign signals for intelligence and counterintelligence purposes. The defense prevents adversaries from gaining access to sensitive classified national security information.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Network Engineering, Systems Engineering, Computer Science, or Information Technology. Related fields will be considered if they include, at a minimum, courses in differential and integral calculus and 5 of the following 18 areas: (a) statics or dynamics, (b) strength of materials/stress-strain relationships, (c) fluid mechanics, hydraulics, (d) thermodynamics, (e) electromagnetic fields, (f) nature and properties of materials/relating particle and aggregate structure to properties, (g) solid state electronics, (h) microprocessor applications, (i), computer systems, (j) signal processing, (k) digital design, (l) systems and control theory, (m) circuits or generalized circuits, (n) communication systems, (o) power systems, (p) computer networks, (q) software development, (r) Any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, or soil mechanics.\n\nRelevant experience must be in network or system administration. Additionally, experience must include one or more of the following areas: computer or information systems design/development, programming, information/cyber/network security, vulnerability analysis, penetration testing, computer forensics, information assurance or systems engineering. If not credited toward education requirement, completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course), Undergraduate Cyber Training (UCT), Network Warfare Bridge Course (NWBC)/Intermediate Network Warfare Training (INWT), Cyber Defense Operations will be considered towards the relevant experience requirement (i.e., 20-24 weeks course will count as 6 months of experience, 10-14 weeks will count as 3 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 5 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 5 years of relevant experience.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 8 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 8 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency is a leader in deploying high-caliber solutions, continually moving forward and contributing to industry leading technologies. We are looking for results driven individuals that strive for excellence, enjoy the challenges of a fast paced environment and the desire to make a difference. We are looking for talented networking professionals to design, develop, deploy, sustain and monitor state-of-the-art network solutions (WAN, CAN, LAN, DCN and Satellite communications networks) that are deployed across NSA worldwide. \n\nNetwork Professionals are hired into positions directly supporting a technical mission office or one of the different development programs like the Information Technology Development Program (ITDP) which is a three-year full-time development program. The goal of the development program is to provide entry-level information technology specialists (that is, individuals with degrees in computer science, information systems, information technology, and related degrees and experience) the opportunity to learn the various facets of the mission.  These facets include:\n\n- Development, engineering and deployment of NSA mission systems\n- Architecture, development, building, and maintenance of NSA's fault-tolerant world-wide information technology infrastructure\n- High-performance computing system development for cryptanalytic mission applications\n- Human resources, financial, and other business data warehouse storage and access\n- Information system security, engineering, testing, and evaluation.\n\nAvailable positions are in penetration testing, defensive operations, identifying cyber threats and vulnerabilities and building defensive capabilities, designing, developing, deploying, sustaining and monitoring state-of-the-art network solutions (WAN, CAN, LAN, DCN and Satellite communications networks) that are deployed across NSA worldwide.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "We are hiring networking professionals with education and/or experience in several of the following areas:\n\n- VMWare and Virtualization platforms\n- Multi-vendor infrastructure platforms (i.e., Cisco, Brocade, Juniper, Arista)\n- Network encryption devices and WAN accelerators \n- Multi-vendor Layer 3 routing protocols (i.e., BGP, OSFP, EIGRP, IGRP, HSRP, VRRP) \n- Virtual Private Networking (i.e., MPLS, GRE, L2VPN, EVPN, Pseudowire, IPsec, MACSEC)\n- Data center architectures and converged networks \n- Current networking trends, including commercial implementations of Software Defined Networks (SDN) for both Data Center Network and WAN applications\n- Load balancing and Application Delivery Controller technologies and implementations \n- WAN architectures (i.e., Carrier Ethernet, Optical Fabrics (OTN), SONET)\n- Network monitoring tools (i.e., NetFlow Tracker, HP Network Node Manager, Cisco LMS, Cisco Call Manager, Wireshark, and Splunk)\n- Network Modeling (RiverBed/OPNet, NetSim)\n- Network Boundary (Next Generation Firewalls (Palo Alto, Cisco FIREPOWER), IPSEC/SSL VPN Concentrators)\n- Cross Domain Solutions (SafeNet MDeX System, OWL Cyber Defense Cross Domain Solutions)\n- Technical certifications (e.g., CCNA, CCNP, SEC+)\n\n\nThe ideal candidate is someone with excellent problem-solving, communication and interpersonal skills who is/can:\n\n- Motivated \n- Flexible\n- Innovative\n- Work effectively in diverse environments \n- Well-organized \n- Handle multiple assignments",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Network Designer/Architect - Mid to Experienced Level (MD, TX)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $187,662 (Full Performance, Senior)\nSalary range varies by work level and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule: This is a full-time position, Monday - Friday, with basic 8 hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD || NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L225",
    "postedDate": "2024-05-03T00:00:00.000Z"
  },
  {
    "_id": "6627ca87b231b421780474d1",
    "jobNumber": "1230034",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Our adversaries and cyber criminals continue to push limits in cyberspace, creating more national security threats than we have ever seen. In order to ensure the United States maintains its strategic edge in cyberspace, NSA is looking for Computer Network Defense Analysts who are highly skilled, want to stay on the leading edge of technology and are impassioned about ensuring the security of our nation.",
    "fullDescription": "Our adversaries and cyber criminals continue to push limits in cyberspace, creating more national security threats than we have ever seen. In order to ensure the United States maintains its strategic edge in cyberspace, NSA is looking for Computer Network Defense Analysts who are highly skilled, want to stay on the leading edge of technology and are impassioned about ensuring the security of our nation.",
    "grade": "07/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "N",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-26T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Cyber",
    "jobFamilyId": "100040",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-05-01T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Our adversaries and cyber criminals continue to push limits in cyberspace, creating more national security threats than we have ever seen. In order to ensure the United States maintains its strategic edge in cyberspace, NSA is looking for Computer Network Defense Analysts who are highly skilled, want to stay on the leading edge of technology and are impassioned about ensuring the security of our nation.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\n\nDegree must be in Network Engineering, Systems Engineering, Information Technology or related field (e.g., General Engineering, Computer Engineering, Electrical Engineering, Computer Science, Computer Forensics, Cyber Security, Software Engineering, Information Assurance, or Computer Security).\n\nRelevant experience must be in one or more of the following: computer or information systems design/development, programming, information/cyber/network security, vulnerability analysis, penetration testing, computer forensics, information assurance, systems engineering, network administration, or system administration. If not credited toward education requirement, completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course), Undergraduate Cyber Training (UCT), Network Warfare Bridge Course (NWBC)/Intermediate Network Warfare Training (INWT), Cyber Defense Operations will be considered towards the relevant experience requirement (i.e., 20-24 weeks course will count as 6 months of experience, 10-14 weeks will count as 3 months of experience).\n\nENTRY/DEVELOPMENTAL\nEntry is with a Bachelor's degree and no experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 2 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 2 years of relevant experience.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience, or a Master's degree plus 1 year of relevant experience, or a Doctoral degree and no experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 5 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 5 years of relevant experience.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience, or a Master's degree plus 4 years of relevant experience, or a Doctoral degree plus 2 years of relevant experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 8 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 8 years of relevant experience.\n\nEXPERT\nEntry is with a Bachelor's degree plus 9 years of relevant experience, or a Master's degree plus 7 years of relevant experience, or a Doctoral degree plus 5 years of relevant experience. The following may also be considered for individuals with in-depth experience that is clearly related to the position: an Associate's degree plus 11 years of relevant experience; or at least 18 semester hours of military coursework/training in networking, computer science, or cyber topics plus 11 years of relevant experience.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Computer Network Defense Analysts work in multiple organizations at NSA and are primarily responsible for finding vulnerabilities, delivering analyses, crafting mitigations, developing cybersecurity products, and educating our customers to prevent and eradicate the cyber threats to the Defense Industrial Base, critical infrastructures and U.S. National Security Systems - to include NSA's own information systems and networks assets. They apply technical expertise to provide computer network defense capabilities, continuous monitoring, technical analysis, situational awareness, and incident response for the highest classified capabilities, systems, and data in our Nation. \n\nDepending on their experience and preferences, Computer Network Defense Analysts are hired into positions directly supporting a technical Cybersecurity mission office or into a development program like the Intrusion Analyst Skill Development Program (IASDP) or the Cybersecurity Operations Development Program (CSODP). These development programs are roughly 3 years in length and combine formal training and diverse work assignments.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "As a Cybersecurity Computer Network Defense Analyst, you will hone your technical proficiencies in multiple areas, as noted below:\n\n- Network analysis\n- Network protocol analysis\n- Network Signature development (Including Snort and Suricata signatures)\n- Operating system administration (Windows and Unix/Linux)\n- Network Security\n- Incident response\n- Computer and network forensics\n- Network administration\n- Vulnerability and malware analysis\n- Software reverse engineering (including familiarly with tools like Ghidra, IDA Pro, etc.)\n- Low level protocol and packet analysis\n- Scripting and/or programming (examples include Python, C, HTML, CSS, JavaScript, PHP, SQL, Lua, etc.)\n\nIdeal candidates for all positions are inquisitive and tenacious, with solid decision-making skills and the ability to react quickly, all while thriving in a team environment.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Computer Network Defense Analyst - Entry to Expert Level (HI, MD, TX)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $85,052 - $191,900 (Entry/Developmental, Full Performance, Senior, Expert)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "NSA/CSS Hawaii Kunia, HI || Fort George G. Meade Complex, MD || NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L225",
    "postedDate": "2024-05-01T00:00:00.000Z"
  },
  {
    "_id": "66291c16b231b4217810782c",
    "jobNumber": "1230123",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you looking to apply your computer science and other technical expertise to develop technologies and tools and be a part of cutting edge innovations? Come join our team of experts! NSA is in search of Research Scientists and Senior Research Scientists to solve complex problems, test innovative approaches and research new solutions to make the U.S. and its allies safer and more secure. Help protect national security interests as part of the world's most advanced team of computer science professionals.",
    "fullDescription": "Are you looking to apply your computer science and other technical expertise to develop technologies and tools and be a part of cutting edge innovations? Come join our team of experts! NSA is in search of Research Scientists and Senior Research Scientists to solve complex problems, test innovative approaches and research new solutions to make the U.S. and its allies safer and more secure. Help protect national security interests as part of the world's most advanced team of computer science professionals.",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-21T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-04-26T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you looking to apply your computer science and other technical expertise to develop technologies and tools and be a part of cutting edge innovations? Come join our team of experts! NSA is in search of Research Scientists and Senior Research Scientists to solve complex problems, test innovative approaches and research new solutions to make the U.S. and its allies safer and more secure. Help protect national security interests as part of the world's most advanced team of computer science professionals.",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position.\nDegree must be in Computer Science (CS) or Computer Engineering (CE). Other STEM fields (e.g., Engineering, Mathematics, or Information Systems (IS)) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics).\nRelevant experience must be in one or more of the following: computer systems research, simulation/model development and prototyping, software design, programming, computational science, algorithm analysis and design, reverse engineering, designing/developing computer or information systems, including engineering hardware or software, machine learning, artificial intelligence, visualization, human-computer interaction, cybersecurity, data science, or high performance computing.\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nEXPERT\nEntry is with a Bachelor's degree plus 9 years of relevant experience or a Master's degree plus 7 years of relevant experience or a Doctoral degree plus 5 years of relevant experience. An Associate's degree plus 11 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA Research Scientists are actively expanding the boundaries of what can be accomplished with artificial intelligence, machine learning, human-machine teaming, software reverse engineering, data science, novel architectures, cyber security, high performance computing, and computational linguistics. Our experts generalize mission problems, advance the scientific state-of-the-art to solve problems, and work with other NSA organizations to get solutions in front of mission users and decision-makers. \nOur researchers also have the opportunity to collaborate regularly with the scientific community, academia, industry, and other government laboratories; publish papers on unclassified aspects of our work in scientific journals and at conferences; transfer NSA technology to the marketplace through open source software releases and public-private partnerships; serve as faculty members at local universities; and participate in university and K-12 STEM outreach activities across the country.\nThe ideal candidate must be able to demonstrate sound judgement, strong technical skills and the ability to work effectively in a dynamic team environment, as well as independently. Excellent oral and written communication skills, and a proven track record of analyzing and solving technical problems with innovative solutions are also preferred.  The candidate should have demonstrated success in conducting Computer Science research to include turning research ideas into running prototype-grade systems. \n\nAs a Research Scientist, other responsibilities may include:\n-\tConducting scientific experiments, documenting results, and communicating with colleagues, customers, and decision makers\n-\tTraining, testing, and deploying machine learning models\n-\tApplying software engineering principles to design and/or develop software applications\n-\tDesigning and optimizing algorithms, data structures, modeling, and analytics to solve real-world scientific problems\n-\tUsing principles, techniques, procedures, and tools to architect and facilitate the development of hardware solutions\n-\tDeveloping methods and applications for tools to exploit and analyze computer systems and network vulnerabilities\n-\tModeling, simulating, prototyping, and/or benchmarking high performance computing systems.\n-\tDeveloping and implementing approaches to increase the productivity and/or efficiency of high performance computers.  \n-\tInvestigating and validating the security properties claimed by confidential computing mechanisms and architectures.\n-\tAdvancing the understanding and capabilities for flexible, layered integrity measurement and attestation architectures and mechanisms.\n-\tResearch, design, and prototype novel approaches to operating system, hypervisor, or firmware security.\n-\tApplying machine learning models to perform enhanced monitoring and anomaly detection on embedded systems network communications to include IoT devices using Bluetooth and other wireless IoT protocols",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Candidates with experience in cybersecurity, computer network defense, vulnerabilities and countermeasures, software development and debugging, network protocols, and those with expertise in Artificial Intelligence and Machine Learning (AI/ML) are strongly encouraged to apply.\n\nRelevant experience in multimodal data, to include: speech, image, video or text processing and/or data science, applied machine learning or artificial intelligence across the disciplines of Human Language Technology (HLT), Computer Vision (CV), Natural Language Processing (NLP) and Natural Language Understanding (NLU).  Additionally, applicants with experience in visualization, data analysis, machine learning model research, development, and evaluation, data engineering, multilingual and multimodal modeling, automatic speech recognition (ASR) or language modeling, large language models (LLM) or related topics are especially encouraged to apply.\n\nCandidates with knowledge, skills and experience in high performance computing are also strongly encouraged to apply; in particular, processor and system architectures and networks, memory, tasking (accelerators, parallelism, resource management, heterogeneous computing), productivity (systems modeling & simulation, evaluation, prototyping and benchmarking), scalable algorithms, programming languages and libraries, and hardware-software co-design.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Research Scientist / Computer Systems Researcher - Mid to Expert Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477- $191,900 (Full Performance, Senior, Expert)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-04-26T00:00:00.000Z"
  },
  {
    "_id": "66291c16b231b4217810782d",
    "jobNumber": "1230133",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "fullDescription": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-21T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-04-26T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "NSA is in search of Computer Science professionals to solve complex problems, test innovative approaches and research new solutions to storing, manipulating, and presenting information. We are looking for you to apply your computer science expertise to projects that seek to create new standards for the transformation of information. If you want to develop technologies and tools and be a part of cutting edge innovations; join our team of experts! Help protect national security interests as part of the world's most advanced team of computer science professionals!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Computer Science (CS) or related field (e.g., Engineering, Mathematics). Degrees in Information Technology, Information Systems, Information Security, Networking (Systems Administration), Information Assurance, and Cybersecurity may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and upper-level mathematics.\n\nRelevant experience must be in engineering of computer or information systems over their lifecycle (i.e., requirements analysis, design, development, implementation, testing, integration, deployment/installation, and maintenance), programming, vulnerability analysis, penetration testing, computer forensics, and/or systems engineering. Completion of military training in a relevant area such as JCAC (Joint Cyber Analysis course) will be considered towards the relevant experience requirement (i.e., 24-week JCAC course will count as 6 months of experience).\n\nFULL PERFORMANCE\nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nSENIOR\nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree and 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n\nEXPERT\nEntry is with a Bachelor's degree plus 9 years of relevant experience or a Master's degree plus 7 years of relevant experience or a Doctoral degree and 5 years of relevant experience. An Associate's degree plus 11 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Testing & Evaluation Specialists at the NSA develop unit and system tests to evaluate compliance with customer requirements. They also conduct testing and evaluate cyberspace operations capabilities and the effects of developed capabilities. They make recommendations based on results. Some positions are responsible for performing penetration testing, mimicking real-world attacks to identify methods for circumventing the security features of NSA applications, systems and networks. \n\nTesting & Evaluation Specialists apply principles, methods, and tools for testing & evaluating computer or computer-related equipment/computing systems. Based on testing results, Test and Evaluation Specialist may assist network and system professionals in the troubleshooting and re-creation of test scenarios.\n\nAs an experienced testing professional, NSA has opportunity for you to contribute, learn, and grow in virtually any Computer Science focus area, including: development, penetration, and operational full testing cycles.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "The ideal candidate is someone with a desire for experiential learning and strong problem-solving, analytic and interpersonal skills who is:\n\n- willing to take the initiative\n- innovative\n- able to work effectively across several different functional areas in a collaborative environment\n- able to communicate effectively (both orally and written)\n- well-organized and able to handle multiple assignments\n\nDevelopment, Penetration, and / or Operational full test cycle experience with exposure to several (not all) of the following areas: \n\n- Understanding of requirements testability\n- TEMP creation \n- Test Plan creation \n- Use cases, test cases, test scenario \n- Requirements Traceability matrix \n- Requirements Verification Traceability matrix \n- Deficiency report creation and resolution understanding \n- Test automation tools\n- Requirements traceability tools\n- Analysis of problems to determine technical solutions\n- Development of test procedures to ensure conformity with specifications or standards\n- Document processes, analyses, and/or results\n- System engineering, test and evaluation tradecraft, and software engineering. \n- Knowledge of automation tools and Linux is helpful.\n- Hands on penetration testing or ethical hacking including areas such as Kali Linux and Metasploit.\n- Training or Certification in penetration testing, such as CEH, PenTest+, and GSEC, which are preferred for some positions.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Testing and Evaluation Specialist - Mid to Experienced Level (Maryland)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $191,900 (Full Performance, Senior, Expert)\nSalary range varies by location, work level and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-04-26T00:00:00.000Z"
  },
  {
    "_id": "66194a31b231b4217885ebc4",
    "jobNumber": "1226325",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Have you worked in the IC/NSA as a civilian employee or military member with a TS/SI clearance?  If so, NSA wants you! NSA has exciting opportunities for former federal civilian/military service members to be part of an expert workforce. To be considered for our openings, you simply build a quality resume following the profile building directions, and then click \"apply\". We will review your experience and interest, assess our openings against your qualifications and contact you directly.",
    "fullDescription": "Have you worked in the IC/NSA as a civilian employee or military member with a TS/SI clearance?  If so, NSA wants you! NSA has exciting opportunities for former federal civilian/military service members to be part of an expert workforce. To be considered for our openings, you simply build a quality resume following the profile building directions, and then click \"apply\". We will review your experience and interest, assess our openings against your qualifications and contact you directly.",
    "grade": "07/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "O",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-15T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900000",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-04-18T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Have you worked in the IC/NSA as a civilian employee or military member with a TS/SI clearance?  If so, NSA wants you! NSA has exciting opportunities for former federal civilian/military service members to be part of an expert workforce. To be considered for our openings, you simply build a quality resume following the profile building directions, and then click \"apply\". We will review your experience and interest, assess our openings against your qualifications and contact you directly.",
    "jobQualifications": null,
    "jobQualificationsExt": "The minimum qualifications against which the applicant will be evaluated derive from the work role to which they are matched. In addition, the applicant must have previous experience working as a civilian employee or military affiliate in an Intelligence Community Agency.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "The National Security Agency employs a diverse workforce that plays a critical role in protecting our nation's security every day. The NSA is seeking individuals with relevant Intelligence Community (IC) experience to support our mission. Previous NSA employees are highly encouraged to apply to this job posting. Applicants to this advertisement will be considered against the two skill areas that they chose in the screening questions and will be required to meet all applicable minimum qualifications. To determine the minimum qualifications associated with a particular vacancy, please review the relevant vacancy announcement.\n\nRetired Federal government employees are encouraged to apply directly to the \"Retired Federal Government Employees\" job posting so that we can consider your application as a reemployed annuitant. In addition, we suggest you contact the Office of Personnel Management should you have any questions regarding the impact of reemployment on your current benefits as a federal retiree.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "NSA corporately hires for many areas of consideration. Your responses to screening questions attached to this job posting will help us to guide you toward the area(s) that best fit your background/experience:\n\no\tAcquisition and Business\no\tCollection\no\tCommunications\no\tComputer Science\no\tCorporate Officer\no\tCryptanalysis\no\tCryptographic Operations\no\tCybersecurity & Analysis\no\tEducation and Training\no\tEngineering and Physical Science\no\tFacilities\no\tHuman Resources\no\tIntelligence Analysis\no\tLanguage Analysis\no\tLegal, Policy, Oversight and Communications\no\tLogistics\no\tMathematics\no\tNetworking and Telecommunications\no\tOccupational Health\no\tOrganizational Leadership\no Safety and Environment\no\tSecurity\no\tSignals Analysis\no\tSupport Services",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Former Intelligence Community (IC) Professionals",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:   Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-04-18T00:00:00.000Z"
  },
  {
    "_id": "66194a31b231b4217885ebbe",
    "jobNumber": "1229399",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "As an established Software Engineer, NSA has opportunity for you to contribute, learn, and grow in virtually any Computer Science focus area, including: Cybersecurity, High Performance Computing (HPC), Quantum Computing Research, Data Analytics, Machine Learning/Artificial Intelligence (ML/AI), Cryptology/Cryptography, and countless others.  If it is considered Computer Science, chances are good we have at least one team focused on it. Individual opportunities are too numerous to list, so tell us what you want to do and let's talk!",
    "fullDescription": "As an established Software Engineer, NSA has opportunity for you to contribute, learn, and grow in virtually any Computer Science focus area, including: Cybersecurity, High Performance Computing (HPC), Quantum Computing Research, Data Analytics, Machine Learning/Artificial Intelligence (ML/AI), Cryptology/Cryptography, and countless others.  If it is considered Computer Science, chances are good we have at least one team focused on it. Individual opportunities are too numerous to list, so tell us what you want to do and let's talk!",
    "grade": "11/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "C",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-18T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Computer Science",
    "jobFamilyId": "100030",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-04-12T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "As an established Software Engineer, NSA has opportunity for you to contribute, learn, and grow in virtually any Computer Science focus area, including: Cybersecurity, High Performance Computing (HPC), Quantum Computing Research, Data Analytics, Machine Learning/Artificial Intelligence (ML/AI), Cryptology/Cryptography, and countless others.  If it is considered Computer Science, chances are good we have at least one team focused on it. Individual opportunities are too numerous to list, so tell us what you want to do and let's talk!",
    "jobQualifications": null,
    "jobQualificationsExt": "The qualifications listed are the minimum acceptable to be considered for the position. \n\nDegree must be in Computer Science (CS) or Software Engineering. Related fields (e.g., Engineering, Mathematics) may be considered relevant if the programs contain, at minimum, a concentration of courses in the following foundational CS areas: algorithms; computer architecture (not network architecture); programming methodologies and languages; data structures; logic and computation; and advanced mathematics (for example, calculus, discrete mathematics). \n\nRelevant experience must be in the software development process (i.e., requirements analysis, software design, implementation, testing, integration, deployment/installation, and maintenance) and programming.\n\nFULL PERFORMANCE \nEntry is with a Bachelor's degree plus 3 years of relevant experience or a Master's degree plus 1 year of relevant experience or a Doctoral degree and no experience. An Associate's degree plus 5 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.\n \nSENIOR \nEntry is with a Bachelor's degree plus 6 years of relevant experience or a Master's degree plus 4 years of relevant experience or a Doctoral degree plus 2 years of relevant experience. An Associate's degree plus 8 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position. \n\nEXPERT \nEntry is with a Bachelor's degree plus 9 years of relevant experience or a Master's degree plus 7 years of relevant experience or a Doctoral degree plus 5 years of relevant experience. An Associate's degree plus 11 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "NSA is seeking experienced (3 or more years) Software Engineers to advance a number of high impact systems and teams.  Opportunities change constantly, but recent needs include: large scale platform development (hardware and software, HPC, cloud); accessibility development (508 compliance); AI/ML; complex algorithms and cryptography. Most positions are located in Fort Meade, MD, with very limited opportunities in Aurora, CO; Fort Gordon, GA; Kunia/Wahiawa, HI; and San Antonio, TX.\n\nAs a SWE at NSA, your work makes the world a safer place in countless ways including: saving lives of U.S. and ally soldiers; providing U.S. policy and decision makers with critical, timely intelligence; ensuring the continued safety of U.S. citizens and residents by thwarting foreign adversaries; and defending vital networks.\n\nThe Agency offers a work/life balance that is hard to beat, with flexible work schedules, generous leave policies, and a number of continuing education programs to help meet your long term career goals. The sheer breadth of technologies supported provides endless opportunity for broadening expertise and leadership growth.\n\nTools and technologies used evolve quickly, with systems and responsibilities spanning the full spectrum.  More common tools and areas of interest include: C/C++, Java, cloud computing, Angular, React, Python, PIG Analytics, Pyspark, agile development, continuous integration/continuous delivery (CI/CD), containers and Docker, Kubernetes, Amazon Web Services (AWS), Linux (VMWare), ElasticSearch, Rust, micro services, Ansible, clusters, digital forensics, incident response, quantum, and so much more.   Beyond technical skills, we also need strong critical thinkers, collaborators, independent self-starters, continuous learners and flexible contributors.   We look forward to hearing from you - what excites you and where you think you can make the most impact.\n\n*We strongly encourage you to upload transcripts as you apply for qualification verification.*",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "With a broad range of positions available, tools, platforms, and methodologies used will vary from one team to another.\n\nUse of industry norms is common, including but not limited to: Docker, Kubernetes, AWS, GitLab, Atlassian Suite, Open Source (see code.nsa.gov for examples of NSA contribution, like Ghidra, Apache Accumulo, and Apache Nifi), Databases (both relational and non-relational), various languages (Java, C, C++, Python, etc.).",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Software Engineer - Mid to Expert Level (MD, HI, GA, CO, TX)",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary Range: $102,477 - $191,900 (Full Performance, Senior, Expert)\nSalary range varies by location, work level, and relevant experience to the position.\n\nOn the job training, internal NSA courses, and external training will be made available based on the need and experience of the selectee.\n\nBenefits: NSA offers excellent benefits to include relocation assistance, flexible work schedules, generous leave programs, paid personal fitness time, training and continuing education classes, health and life insurance, Federal Thrift Savings Plan (TSP), and a Federal retirement plan.\n\nWork Schedule:  This is a full-time position, Monday - Friday, with basic 8hr/day work requirement between 6:00 a.m. and 6:00 p.m. (flexible).",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Denver/Aurora, CO || Fort Eisenhower, GA || NSA/CSS Hawaii Kunia, HI || Fort George G. Meade Complex, MD || NSA/CSS Texas, San Antonio TX, TX",
    "locationSpecificId": "L225",
    "postedDate": "2024-04-12T00:00:00.000Z"
  },
  {
    "_id": "65ccec6cb231b42178df6754",
    "jobNumber": "1223858",
    "OtherActivities": null,
    "agency": "NSA",
    "description": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "fullDescription": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "grade": "12/1 to 15/10",
    "jobAdditionalInformation": null,
    "jobAdditionalRequirements": null,
    "jobApprovingOfficial": null,
    "jobAreaOfConsideration": "Q",
    "jobAssessmentFactors": null,
    "jobCloseDate": "2024-06-15T00:00:00.000Z",
    "jobClosingStatement": null,
    "jobContactInformation": null,
    "jobCoverLetter": null,
    "jobCredit": null,
    "jobDCIPS": "The National Security Agency (NSA) is part of the DoD Intelligence Community Defense Civilian Intelligence Personnel System (DCIPS).  All positions in the NSA are in the Excepted Services under 10 United States Codes (USC) 1601 appointment authority.  DoD Components with DCIPS positions apply Veterans' Preference to eligible candidates as defined by Section 2108 of Title 5 USC, in accordance with the procedures provided in DoD Instruction 1400.25, Volume 2005, DCIPS Employment and Placement.  If you are a veteran claiming veterans' preference, as defined by Section 2108 of Title 5 U.S.C., you may be asked to submit documents verifying your eligibility.",
    "jobDawia": null,
    "jobDeptMktgStatement": null,
    "jobDevelopAssignment": null,
    "jobDuties": null,
    "jobDutyOrg": null,
    "jobEmergencyEssential": null,
    "jobFamily": "Other",
    "jobFamilyId": "900001",
    "jobFullTimePartTime": "Full-time",
    "jobGradeRange": null,
    "jobHeader": null,
    "jobHighlyDesiredSkills": null,
    "jobHiringEvents": null,
    "jobHowEvaluated": null,
    "jobHowToApply": "Apply soonest, as job postings can close earlier than stated end dates due to changes in requirements.  It is important to review and note the minimum qualifications, as only those applicants who meet the required qualifications will be contacted to continue the employment process.  Please populate the resume tool to showcase any relevant work experience and education related to the position and answer any applicable screening questions. Information collected will be used to determine eligibility, and failure to provide accurate information may result in disqualification for this position. \n\nA confirmation email will be sent after submission of the first application and also after any future updates to submitted applications.  **Due to time sensitive communications regarding applications, please ensure your spam filters are configured to accept email from noreply@intelligencecareers.gov.  For job vacancies that include stated testing requirements, also include the following: @uwe.nsa.gov, @nsa.gov, and @pearson.com** \n\nU.S. Citizenship is required for all applicants.  NSA is an equal opportunity employer and abides by applicable employment laws and regulations. NSA is also committed to the promotion of diversity within its workforce. All applicants and employees are subject to random drug testing in accordance with Executive Order 12564. Employment is contingent upon successful completion of a security background investigation and polygraph. Reasonable accommodations may be provided to applicants with disabilities during the application and hiring process where appropriate.  Please visit our Diversity link for more information https://www.intelligencecareers.gov/NSA/diversity-and-inclusion.",
    "jobHowToApplyInt": null,
    "jobHowToApplyJDA": null,
    "jobIncumbent": null,
    "jobInfoEntitlements": null,
    "jobInfoPosition": null,
    "jobInfoPositionJDA": null,
    "jobInformation": null,
    "jobLengthOfAssignment": null,
    "jobLengthOfTour": null,
    "jobMajorDuties": null,
    "jobManLevel": null,
    "jobMissionElement": null,
    "jobMissionPOC": null,
    "jobNominatingOfficial": null,
    "jobNotes": null,
    "jobOpenDate": "2024-02-20T00:00:00.000Z",
    "jobOpenTo": null,
    "jobOrgMarketing": null,
    "jobOrganization": null,
    "jobPayPlan": "GG",
    "jobPhysicalReq": null,
    "jobPosNumber": null,
    "jobPosition": null,
    "jobPositionSummary": "Are you a retired Federal civilian, who is willing to work on a temporary or part-time basis?",
    "jobQualifications": null,
    "jobQualificationsExt": "Applicants will be evaluated by hiring managers and assessed according to the position requirements. Qualified applicants must be either current Federal civilian retirees or be within 6 months of retirement from civilian Federal service.",
    "jobQualsInt": null,
    "jobReportingDate": null,
    "jobRequirements": "Retired Federal civilian employees employed at the National Security Agency (NSA) provide expertise and corporate knowledge to temporarily support mission requirements, augment the existing work force, and/or mentor the next generation of Agency employees.\n\nPlease respond to the screening questions attached to this job posting. Your responses enable our hiring team to match your skills and experience to mission needs.",
    "jobSchedule": null,
    "jobSkillCommunity": null,
    "jobSkillsInternal": "Retired Federal civilian employees are encouraged to apply so that your skills and experience can be reviewed according to current needs and requirements.",
    "jobSocialResp": null,
    "jobSpecialBenefits": null,
    "jobSpecializedCompetency": null,
    "jobStatus": "010",
    "jobTDY": null,
    "jobTitle": "Retired Federal Government Civilian Employees",
    "jobTraining": null,
    "jobVisible": true,
    "jobWeightedCriteria": null,
    "jobWhoApply": null,
    "jobWorkSchedule": "Pay: Salary offers are based on candidates' education level and years of experience relevant to the position and also take into account information provided by the hiring manager/organization regarding the work level for the position.\n\nSalary range varies by location, work level, and relevant experience to the position. \n\nWork Schedule: Part-time, flexible according to the mission needs and hiring organization.",
    "location": "Fort Meade, MD",
    "locationArea": "225",
    "locationFull": "Fort George G. Meade Complex, MD",
    "locationSpecificId": "L225",
    "postedDate": "2024-02-20T00:00:00.000Z"
  }
]
